#if !defined(__E_STATIC_LIB)
#include "include_ogrelib_header.h"

//TODO 静态库需要的部分,会记录所有的函数名到数组里,静态编译的时候需要取回命令名
static ARG_INFO g_argumentInfo_ogrelib_global_var[] = 
{
    // 1=参数名称, 2=参数详细解释, 3=指定图像索引,从1开始,0表示无, 4=图像数目(用作动画)
    // 5=参数类型, 6=参数默认值,   7=参数标志 AS_ 开头常量
    // AS_HAS_DEFAULT_VALUE         有默认值,倒数第二个参数是默认值
    // AS_DEFAULT_VALUE_IS_EMPTY    默认值为空,有可空标志
    // AS_RECEIVE_VAR               只能传递变量,相当于传引用,传递过来的肯定不是数组
    // AS_RECEIVE_VAR_ARRAY         传递过来的肯定是数组变量引用
    // AS_RECEIVE_VAR_OR_ARRAY      传递变量或者数组变量引用
    // AS_RECEIVE_ARRAY_DATA        传递数组
    // AS_RECEIVE_ALL_TYPE_DATA     传递数组/非数组
    // AS_RECEIVE_VAR_OR_OTHER      可以传递 变量/数据/返回值数据



    /*000*/ {"全局唯一标识符", "用“置私有数据”方法时传入的全局唯一标识符参数。", 0, 0, MAKELONG(0x0D, 0), 0, NULL},

    /*001*/ {"全局唯一标识符", "此私有数据的全局唯一标识符。", 0, 0, MAKELONG(0x0D, 0), 0, NULL},
    /*002*/ {"数据", "想要关联到本资源上的数据。", 0, 0, SDT_BIN, 0, NULL},
    /*003*/ {"标志", "保留。", 0, 0, SDT_INT, 0, AS_HAS_DEFAULT_VALUE},

    /*004*/ {"设备", "要获得的设备变量。", 0, 0, MAKELONG(0x09, 0), 0, AS_RECEIVE_VAR},

    /*005*/ {"全局唯一标识符", "用“置私有数据”方法时传入的全局唯一标识符参数。", 0, 0, MAKELONG(0x0D, 0), 0, NULL},
    /*006*/ {"数据", "要获取的数据。", 0, 0, SDT_BIN, 0, AS_RECEIVE_VAR},

    /*007*/ {"优先级", "新的优先级。", 0, 0, SDT_INT, 0, NULL},

    /*008*/ {"全局唯一标识符", "用“置私有数据”方法时传入的全局唯一标识符参数。", 0, 0, MAKELONG(0x0D, 0), 0, NULL},
    /*009*/ {"数据", "要获取的数据。", 0, 0, SDT_BIN, 0, AS_RECEIVE_VAR},

    /*010*/ {"过滤类型", "要设置的过滤类型，值可以为“纹理过滤类型”常量数据类型中的值。", 0, 0, MAKELONG(0x2F, 0), 0, NULL},

    /*011*/ {"精细级别", "要设置的新的精细级别。", 0, 0, SDT_INT, 0, NULL},

    /*012*/ {"全局唯一标识符", "此私有数据的全局唯一标识符。", 0, 0, MAKELONG(0x0D, 0), 0, NULL},
    /*013*/ {"数据", "想要关联到本资源上的数据。", 0, 0, SDT_BIN, 0, NULL},
    /*014*/ {"标志", "保留。", 0, 0, SDT_INT, 0, AS_HAS_DEFAULT_VALUE},

    /*015*/ {"哪一面", "本参数表示要增加立方体哪一面为脏区域。", 0, 0, MAKELONG(0x3B, 0), 0, NULL},
    /*016*/ {"区域", "要增加的区域。", 0, 0, MAKELONG(0x01, 0), 0, NULL},

    /*017*/ {"哪一面", "本参数表示要取立方体哪一面。", 0, 0, MAKELONG(0x3B, 0), 0, NULL},
    /*018*/ {"级别", "要取的级别。", 0, 0, SDT_INT, 0, NULL},
    /*019*/ {"页面", "存放的页面。", 0, 0, MAKELONG(0x08, 0), 0, AS_RECEIVE_VAR},

    /*020*/ {"级别", "要取的级别。", 0, 0, SDT_INT, 0, NULL},
    /*021*/ {"信息", "存放取后的信息。", 0, 0, MAKELONG(0x1D, 0), 0, AS_RECEIVE_VAR},

    /*022*/ {"全局唯一标识符", "用“置私有数据”方法时传入的全局唯一标识符参数。", 0, 0, MAKELONG(0x0D, 0), 0, NULL},
    /*023*/ {"数据", "要获取的数据。", 0, 0, SDT_BIN, 0, AS_RECEIVE_VAR},

    /*024*/ {"全局唯一标识符", "此私有数据的全局唯一标识符。", 0, 0, MAKELONG(0x0D, 0), 0, NULL},
    /*025*/ {"数据", "想要关联到本资源上的数据。", 0, 0, SDT_BIN, 0, NULL},
    /*026*/ {"标志", "保留。", 0, 0, SDT_INT, 0, AS_HAS_DEFAULT_VALUE},

    /*027*/ {"哪一面", "本参数表示要取立方体哪一面。", 0, 0, MAKELONG(0x3B, 0), 0, NULL},
    /*028*/ {"级别", "要写入的级别。", 0, 0, SDT_INT, 0, NULL},
    /*029*/ {"区域", "要写入的区域。", 0, 0, MAKELONG(0x01, 0), 0, NULL},
    /*030*/ {"数据", "要写入的数据,注：数据必须与区域匹配。", 0, 0, SDT_BIN, 0, NULL},

    /*031*/ {"哪一面", "本参数表示要取立方体哪一面。", 0, 0, MAKELONG(0x3B, 0), 0, NULL},
    /*032*/ {"级别", "要读的级别。", 0, 0, SDT_INT, 0, NULL},
    /*033*/ {"区域", "要读的区域。", 0, 0, MAKELONG(0x01, 0), 0, NULL},
    /*034*/ {"数据", "读入数据存放的地方。", 0, 0, SDT_BIN, 0, AS_RECEIVE_VAR},

    /*035*/ {"信息", "存放取后的信息。", 0, 0, MAKELONG(0x19, 0), 0, AS_RECEIVE_VAR},

    /*036*/ {"全局唯一标识符", "用“置私有数据”方法时传入的全局唯一标识符参数。", 0, 0, MAKELONG(0x0D, 0), 0, NULL},
    /*037*/ {"数据", "要获取的数据。", 0, 0, SDT_BIN, 0, AS_RECEIVE_VAR},

    /*038*/ {"全局唯一标识符", "此私有数据的全局唯一标识符。", 0, 0, MAKELONG(0x0D, 0), 0, NULL},
    /*039*/ {"数据", "想要关联到本资源上的数据。", 0, 0, SDT_BIN, 0, NULL},
    /*040*/ {"标志", "保留。", 0, 0, SDT_INT, 0, AS_HAS_DEFAULT_VALUE},

    /*041*/ {"偏移", "要写入数据的偏移，表示从哪儿开始写。单位为字节。注：如果要写入整个缓冲，请将本参数和下一个参数置0。", 0, 0, SDT_INT, 0, NULL},
    /*042*/ {"大小", "要写入数据的大小。单位为字节。", 0, 0, SDT_BIN, 0, NULL},
    /*043*/ {"数据", "要写入的数据。", 0, 0, SDT_BIN, 0, NULL},

    /*044*/ {"偏移", "要写入数据的偏移，表示从哪儿开始读。单位为字节。", 0, 0, SDT_INT, 0, NULL},
    /*045*/ {"大小", "要读入数据的大小。注：此参数不能指定为0。", 0, 0, SDT_BIN, 0, NULL},
    /*046*/ {"数据", "返回的数据。", 0, 0, SDT_BIN, 0, AS_RECEIVE_VAR},

    /*047*/ {"区域", "要变脏的区域。", 0, 0, MAKELONG(0x01, 0), 0, NULL},

    /*048*/ {"级别", "要取的级别。", 0, 0, SDT_INT, 0, NULL},
    /*049*/ {"信息", "存放取后的信息。", 0, 0, MAKELONG(0x1D, 0), 0, AS_RECEIVE_VAR},

    /*050*/ {"全局唯一标识符", "用“置私有数据”方法时传入的全局唯一标识符参数。", 0, 0, MAKELONG(0x0D, 0), 0, NULL},
    /*051*/ {"数据", "要获取的数据。", 0, 0, SDT_BIN, 0, AS_RECEIVE_VAR},

    /*052*/ {"级别", "要取的级别。", 0, 0, SDT_INT, 0, NULL},
    /*053*/ {"页面", "存放的页面。", 0, 0, MAKELONG(0x08, 0), 0, AS_RECEIVE_VAR},

    /*054*/ {"级别", "要写入的级别。", 0, 0, SDT_INT, 0, NULL},
    /*055*/ {"区域", "要写入的区域。", 0, 0, MAKELONG(0x01, 0), 0, NULL},
    /*056*/ {"数据", "要写入的数据,注：数据必须与区域匹配。", 0, 0, SDT_BIN, 0, NULL},

    /*057*/ {"级别", "要读的级别。", 0, 0, SDT_INT, 0, NULL},
    /*058*/ {"区域", "要读的区域。", 0, 0, MAKELONG(0x01, 0), 0, NULL},
    /*059*/ {"数据", "读入数据存放的地方。", 0, 0, SDT_BIN, 0, AS_RECEIVE_VAR},

    /*060*/ {"信息", "存放取后的信息。", 0, 0, MAKELONG(0x14, 0), 0, AS_RECEIVE_VAR},

    /*061*/ {"全局唯一标识符", "用“置私有数据”方法时传入的全局唯一标识符参数。", 0, 0, MAKELONG(0x0D, 0), 0, NULL},
    /*062*/ {"数据", "要获取的数据。", 0, 0, SDT_BIN, 0, AS_RECEIVE_VAR},

    /*063*/ {"全局唯一标识符", "此私有数据的全局唯一标识符。", 0, 0, MAKELONG(0x0D, 0), 0, NULL},
    /*064*/ {"数据", "想要关联到本资源上的数据。", 0, 0, SDT_BIN, 0, NULL},
    /*065*/ {"标志", "保留。", 0, 0, SDT_INT, 0, AS_HAS_DEFAULT_VALUE},

    /*066*/ {"偏移", "要写入数据的偏移，表示从哪儿开始写。单位为字节。注：如果要写入整个缓冲，请将本参数和下一个参数置0。", 0, 0, SDT_INT, 0, NULL},
    /*067*/ {"数据", "要写入的数据。", 0, 0, SDT_BIN, 0, NULL},

    /*068*/ {"偏移", "要写入数据的偏移，表示从哪儿开始读。单位为字节。", 0, 0, SDT_INT, 0, NULL},
    /*069*/ {"大小", "要读入数据的大小。注：此参数不能指定为0。", 0, 0, SDT_BIN, 0, NULL},
    /*070*/ {"数据", "返回的数据。", 0, 0, SDT_BIN, 0, AS_RECEIVE_VAR},

    /*071*/ {"父容器", "返回的父容器。", 0, 0, MAKELONG(0x11, 0), 0, AS_RECEIVE_VAR},

    /*072*/ {"立体信息", "返回立体的信息。", 0, 0, MAKELONG(0x24, 0), 0, AS_RECEIVE_VAR},

    /*073*/ {"全局唯一标识符", "用“置私有数据”方法时传入的全局唯一标识符参数。", 0, 0, MAKELONG(0x0D, 0), 0, NULL},
    /*074*/ {"数据", "要获取的数据。", 0, 0, SDT_BIN, 0, AS_RECEIVE_VAR},

    /*075*/ {"全局唯一标识符", "此私有数据的全局唯一标识符。", 0, 0, MAKELONG(0x0D, 0), 0, NULL},
    /*076*/ {"数据", "想要关联到本资源上的数据。", 0, 0, SDT_BIN, 0, NULL},
    /*077*/ {"标志", "保留。", 0, 0, SDT_INT, 0, AS_HAS_DEFAULT_VALUE},

    /*078*/ {"立体区域", "要写入的立体区域。", 0, 0, MAKELONG(0x23, 0), 0, NULL},
    /*079*/ {"数据", "要写入的立体区域的数据，注：数据和区域应该是对应的。", 0, 0, SDT_BIN, 0, NULL},

    /*080*/ {"立体区域", "要读的立体区域。", 0, 0, MAKELONG(0x23, 0), 0, NULL},
    /*081*/ {"数据", "返回的数据。", 0, 0, SDT_BIN, 0, AS_RECEIVE_VAR},

    /*082*/ {"立体空间", "要增加的立体空间区域。", 0, 0, MAKELONG(0x23, 0), 0, NULL},

    /*083*/ {"级别", "立体的信息的级别。", 0, 0, SDT_INT, 0, NULL},
    /*084*/ {"立体信息", "返回立体的信息。", 0, 0, MAKELONG(0x24, 0), 0, AS_RECEIVE_VAR},

    /*085*/ {"全局唯一标识符", "用“置私有数据”方法时传入的全局唯一标识符参数。", 0, 0, MAKELONG(0x0D, 0), 0, NULL},
    /*086*/ {"数据", "要获取的数据。", 0, 0, SDT_BIN, 0, AS_RECEIVE_VAR},

    /*087*/ {"级别", "立体对应的级别。", 0, 0, SDT_INT, 0, NULL},
    /*088*/ {"立体", "返回的立体。", 0, 0, MAKELONG(0x25, 0), 0, AS_RECEIVE_VAR},

    /*089*/ {"全局唯一标识符", "此私有数据的全局唯一标识符。", 0, 0, MAKELONG(0x0D, 0), 0, NULL},
    /*090*/ {"数据", "想要关联到本资源上的数据。", 0, 0, SDT_BIN, 0, NULL},
    /*091*/ {"标志", "保留。", 0, 0, SDT_INT, 0, AS_HAS_DEFAULT_VALUE},

    /*092*/ {"级别", "要写入数据的级别。", 0, 0, SDT_INT, 0, NULL},
    /*093*/ {"立体区域", "要写入的立体区域。", 0, 0, MAKELONG(0x23, 0), 0, NULL},
    /*094*/ {"数据", "要写入的立体区域的数据，注：数据和区域应该是对应的。", 0, 0, SDT_BIN, 0, NULL},

    /*095*/ {"级别", "要读出数据的级别。", 0, 0, SDT_INT, 0, NULL},
    /*096*/ {"立体区域", "要写入的立体区域。", 0, 0, MAKELONG(0x23, 0), 0, NULL},
    /*097*/ {"数据", "返回的数据。", 0, 0, SDT_BIN, 0, AS_RECEIVE_VAR},

    /*098*/ {"声明", "要返回的定义数组。", 0, 0, MAKELONG(0x16, 0), 0, AS_RECEIVE_VAR_ARRAY},

    /*099*/ {"纹理层", "要指定的纹理层。", 0, 0, SDT_INT, 0, NULL},
    /*100*/ {"纹理", "指定的纹理, 本参数可以是“纹理”、“基础纹理”、“立体纹理”、“立方体纹理”数据类型。", 0, 0, _SDT_ALL, 0, NULL},

    /*101*/ {"锁定类型", "指定锁定的类型。", 0, 0, SDT_INT, 0, NULL},
    /*102*/ {"矩形区域", "指定要锁定的页面矩形区域。为空则锁定整个页面。", 0, 0, MAKELONG(0x01, 0), 0, AS_DEFAULT_VALUE_IS_EMPTY},

    /*103*/ {"锁定类型", "指定锁定的类型。", 0, 0, SDT_INT, 0, NULL},
    /*104*/ {"矩形区域", "指定要锁定的页面矩形区域。为空则锁定整个页面。", 0, 0, MAKELONG(0x01, 0), 0, AS_DEFAULT_VALUE_IS_EMPTY},

    /*105*/ {"设备环境句柄", "要释放的设备环境句柄。", 0, 0, SDT_INT, 0, NULL},

    /*106*/ {"设备参数", "设备初始化参数。", 0, 0, MAKELONG(0x1B, 0), 0, NULL},
    /*107*/ {"窗口句柄", "设备窗口句柄。", 0, 0, SDT_INT, 0, NULL},
    /*108*/ {"设备类型", "指定设备的类型，为以下常量值之一：1、#设备常量.硬件加速；2、#设备常量.软件加速；3、#设备常量.第三方设备插件。", 0, 0, SDT_INT, 0, NULL},
    /*109*/ {"设备创建行为", "控制设备创建行为，为以下常量值之一或之和：2、#设备常量.FPU保护；4、#设备常量.采用多线程；16、#设备常量.纯设备；32、#设备常量.软件顶点运算；64、#设备常量.硬件顶点运算；128、#设备常量.混合顶点运算；256、#设备常量.代替显卡驱动程序管理；512、#设备常量.驱动所有主适配器；", 0, 0, SDT_INT, 0, NULL},

    /*110*/ {"索引", "本参数表示此灯光在场景中的索引。", 0, 0, SDT_INT, 0, NULL},
    /*111*/ {"灯光", "要设置的灯光，为“灯光”数据类型。", 0, 0, MAKELONG(0x0B, 0), 0, NULL},

    /*112*/ {"索引", "本参数表示此灯光在场景中的索引，是“设置灯光”参数中的那个索引。", 0, 0, SDT_INT, 0, NULL},
    /*113*/ {"启用或禁用", "本参数表示启用或禁用索引中指的灯光。", 0, 0, SDT_BOOL, 0, NULL},

    /*114*/ {"材质", "本参数表示要设定的材质。", 0, 0, MAKELONG(0x0C, 0), 0, NULL},

    /*115*/ {"清除标志", "指定要清除的页面，可以为以下常量值之一或之和：1、#设备常量.渲染目标页面；2、#设备常量.深度缓冲区；4、#设备常量.复制缓冲页面。", 0, 0, SDT_INT, 0, NULL},
    /*116*/ {"渲染目标页面颜色", "指定渲染目标页面颜色。", 0, 0, SDT_INT, 0, NULL},
    /*117*/ {"深度缓冲值", "深度缓冲值，参数取值范围为：0.0 - 1.0。0.0表示离观察者较近，1.0表示离观察者较远。", 0, 0, SDT_FLOAT, 1, AS_DEFAULT_VALUE_IS_EMPTY},
    /*118*/ {"复制缓冲", NULL, 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*119*/ {"矩形", "指定要清除的矩形区域。", 0, 0, MAKELONG(0x01, 0), 0, AS_DEFAULT_VALUE_IS_EMPTY},

    /*120*/ {"源矩形", "将指定矩形区域的后台缓冲页面显示到前台。默认为将整个后台缓冲页面显示到前台。", 0, 0, MAKELONG(0x01, 0), 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*121*/ {"目的矩形", "目的页面的矩形区域。默认为整个客户区域。", 0, 0, MAKELONG(0x01, 0), 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*122*/ {"目标窗口", "指定显示的目标窗口，默认为设备参数中的设备窗口句柄。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},

    /*123*/ {"缓冲区大小", "将指定矩形区域的后台缓冲页面显示到前台。默认为将整个后台缓冲页面显示到前台。", 0, 0, SDT_INT, 0, NULL},
    /*124*/ {"用途", "为“资源用途”常量值之一。", 0, 0, MAKELONG(0x37, 0), 0, NULL},
    /*125*/ {"灵活顶点格式", NULL, 0, 0, SDT_INT, 0, NULL},
    /*126*/ {"内存池类型", "为“内存池类型”常量值之一。", 0, 0, MAKELONG(0x39, 0), 0, NULL},
    /*127*/ {"顶点缓冲", "要创建的顶点缓冲。", 0, 0, MAKELONG(0x13, 0), 0, NULL},

    /*128*/ {"图元类型", "绘制的图元（即图形的基本单位）类型。为以下常量值之一：1、#设备常量.点列；2、#设备常量.线列；3、#设备常量.线带；4、#设备常量.三角形列；5、#设备常量.三角形带；6、#设备常量.三角扇形。", 0, 0, SDT_INT, 0, NULL},
    /*129*/ {"第一个顶点序号", "三角形顶点列表中第一个将被绘制的顶点的序号。不能为负数。", 0, 0, SDT_INT, 0, NULL},
    /*130*/ {"图元个数", "要绘制的图元的个数。", 0, 0, SDT_INT, 0, NULL},

    /*131*/ {"灵活的向量格式", "绘制的图元（即图形的基本单位）类型。为以下常量值之一：1、#设备常量.点列；2、#设备常量.线列；3、#设备常量.线带；4、#设备常量.三角形列；5、#设备常量.三角形带；6、#设备常量.三角扇形。", 0, 0, SDT_INT, 0, NULL},
    /*132*/ {"索引缓冲偏移量", "索引缓冲区的偏移量。", 0, 0, SDT_INT, 0, NULL},
    /*133*/ {"最小顶点索引值", "要绘制的最小的顶点索引值。", 0, 0, SDT_INT, 0, NULL},
    /*134*/ {"顶点个数", "要绘制的顶点个数。从（索引缓冲偏移量 + 最小顶点索引值）处开始计算。", 0, 0, SDT_INT, 0, NULL},
    /*135*/ {"索引起始位置", "在索引数组中读取索引的起始位置。", 0, 0, SDT_INT, 0, NULL},
    /*136*/ {"图元个数", "要绘制的图元的个数。", 0, 0, SDT_INT, 0, NULL},

    /*137*/ {"数据流", NULL, 0, 0, SDT_INT, 0, NULL},
    /*138*/ {"绑定的顶点缓冲", "将被绑定到数据源上的顶点缓冲。", 0, 0, MAKELONG(0x13, 0), 0, NULL},
    /*139*/ {"顶点数据大小", "每一个顶点数据的大小，以字节为单位。", 0, 0, SDT_INT, 0, NULL},
    /*140*/ {"流组件大小", "流组件的大小，以字节为单位。", 0, 0, SDT_INT, 0, NULL},

    /*141*/ {"灵活的向量格式", NULL, 0, 0, SDT_INT, 0, NULL},

    /*142*/ {"渲染状态", "渲染状态。为渲染状态常量中的任一常量。", 0, 0, MAKELONG(0x2B, 0), 0, NULL},
    /*143*/ {"渲染状态值", "指定设备渲染状态值。", 0, 0, SDT_INT, 0, NULL},

    /*144*/ {"变换状态", "指定变换状态。为“变换状态”常量值之一。", 0, 0, MAKELONG(0x3A, 0), 0, NULL},
    /*145*/ {"矩阵", "这个矩阵将要被设置为当前变换的矩阵。", 0, 0, MAKELONG(0x04, 0), 0, NULL},

    /*146*/ {"序号", NULL, 0, 0, SDT_INT, 0, NULL},
    /*147*/ {"系数", NULL, 0, 0, SDT_FLOAT, 0, NULL},

    /*148*/ {"调色板号", "将要设置为当前纹理调色板的调色板号码。", 0, 0, SDT_INT, 0, NULL},

    /*149*/ {"X坐标", NULL, 0, 0, SDT_INT, 0, NULL},
    /*150*/ {"Y坐标", NULL, 0, 0, SDT_INT, 0, NULL},
    /*151*/ {"更新选项", "设置光标更新选项。0、调用交换页面命令时更新；1、立即更新。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},

    /*152*/ {"热区偏移X坐标", "热区相对于左上角的偏移量。", 0, 0, SDT_INT, 0, NULL},
    /*153*/ {"热区偏移Y坐标", "热区相对于左上角的偏移量。", 0, 0, SDT_INT, 0, NULL},
    /*154*/ {"光标位图页面", NULL, 0, 0, MAKELONG(0x08, 0), 0, NULL},

    /*155*/ {"Z模板缓冲页面", "Z模板缓冲页面。为空则关闭Z模板缓冲操作并释放上一个Z模板缓冲。", 0, 0, MAKELONG(0x08, 0), 0, AS_DEFAULT_VALUE_IS_EMPTY},

    /*156*/ {"启用对话框", "真为启用对话框，假为禁用对话框。", 0, 0, SDT_BOOL, 0, NULL},

    /*157*/ {"索引缓冲", "要设置的索引缓冲数据。", 0, 0, MAKELONG(0x18, 0), 0, NULL},

    /*158*/ {"曲面段个数", "指定使用多少段来生成曲面。如果段个数小于1.0，关闭曲面表面模式；反之则开启曲面表面模式。默认值为0.0。", 0, 0, SDT_FLOAT, 0, AS_DEFAULT_VALUE_IS_EMPTY},

    /*159*/ {"调色板序号", NULL, 0, 0, SDT_INT, 0, NULL},
    /*160*/ {"调色板单元", "要设置的调色板单元。", 0, 0, MAKELONG(0x1F, 0), 0, NULL},

    /*161*/ {"渲染对象索引", NULL, 0, 0, SDT_INT, 0, NULL},
    /*162*/ {"渲染对象页面", "新的渲染对象页面。如为空，则相应序号的渲染对象将被禁用。", 0, 0, MAKELONG(0x08, 0), 0, NULL},

    /*163*/ {"取样器索引", NULL, 0, 0, SDT_INT, 0, NULL},
    /*164*/ {"取样器状态类型", "为“取样器状态类型”常量中的任一值。", 0, 0, SDT_INT, 0, NULL},
    /*165*/ {"状态值", "要设置的取样器状态值。该状态值的意义由取样器状态类型决定。", 0, 0, SDT_INT, 0, NULL},

    /*166*/ {"顶点处理模式", "要设置的顶点处理模式。为以下两个值之一：32、#设备常量.软件顶点处理；64、#设备常量.硬件顶点处理。", 0, 0, SDT_INT, 0, NULL},

    /*167*/ {"索引", "本参数表示纹理层索引。值可以是0至7。D3D最少允许有8层纹理。", 0, 0, SDT_INT, 0, NULL},
    /*168*/ {"类型", "本参数表示纹理层类型, 值可以是“纹理层状态类型”常量数据类型中的值。", 0, 0, MAKELONG(0x30, 0), 0, NULL},
    /*169*/ {"值", "本参数表示纹理层状态类型的值。意义根据纹理层状态类型的不同而不同。", 0, 0, SDT_INT, 0, NULL},

    /*170*/ {"设备特性", "要取得的设备特性。", 0, 0, MAKELONG(0x26, 0), 0, NULL},

    /*171*/ {"交换链标识", "指定一个交换链。", 0, 0, SDT_INT, 0, NULL},
    /*172*/ {"后台缓冲序号", "要取得的后台缓冲序号。序号范围从0 - (后台缓冲数量 - 1)。为0返回第一个后台页面（不是前台页面），不能通过该命令取得前台页面。", 0, 0, SDT_INT, 0, NULL},
    /*173*/ {"后台缓冲页面", "要取得的后台缓冲页面。", 0, 0, MAKELONG(0x08, 0), 0, NULL},

    /*174*/ {"深度缓冲页面", "要取得的深度缓冲页面。", 0, 0, MAKELONG(0x08, 0), 0, NULL},

    /*175*/ {"交换链标识", "指定一个交换链。", 0, 0, SDT_INT, 0, NULL},
    /*176*/ {"显示模式", "要取得的显示模式。", 0, 0, MAKELONG(0x22, 0), 0, NULL},

    /*177*/ {"交换链标识", "指定一个交换链。", 0, 0, SDT_INT, 0, NULL},
    /*178*/ {"目标页面", "设备前台缓冲页面的副本。在窗口模式中，目标页面的大小为桌面大小；在全屏模式中，目标页面的大小为屏幕大小。", 0, 0, MAKELONG(0x08, 0), 0, NULL},

    /*179*/ {"索引", "本参数表示要获取灯光的索引。", 0, 0, SDT_INT, 0, NULL},
    /*180*/ {"灯光", "本参数表示要获取的灯光。", 0, 0, MAKELONG(0x0B, 0), 0, AS_RECEIVE_VAR},

    /*181*/ {"灯光序号", "要取得状态的灯光序号。", 0, 0, SDT_INT, 0, NULL},

    /*182*/ {"材质", "本参数表示要获取的材质。", 0, 0, MAKELONG(0x0C, 0), 0, AS_RECEIVE_VAR},

    /*183*/ {"渲染目标序号", NULL, 0, 0, SDT_INT, 0, NULL},
    /*184*/ {"渲染目标页面", "要取得的渲染目标页面。", 0, 0, MAKELONG(0x08, 0), 0, NULL},

    /*185*/ {"变换状态", "指定变换状态。为“变换状态”常量值之一。", 0, 0, MAKELONG(0x3A, 0), 0, NULL},
    /*186*/ {"矩阵", "要取得的变换矩阵。", 0, 0, MAKELONG(0x04, 0), 0, NULL},

    /*187*/ {"视见区", "要取得的视见区。", 0, 0, MAKELONG(0x07, 0), 0, NULL},

    /*188*/ {"纹理层标识", "要取得的纹理层标识。", 0, 0, SDT_INT, 0, NULL},
    /*189*/ {"纹理", "要取得的纹理。", 0, 0, MAKELONG(0x10, 0), 0, NULL},

    /*190*/ {"是否显示", "真为显示；假为隐藏。", 0, 0, SDT_BOOL, 0, NULL},

    /*191*/ {"源页面", NULL, 0, 0, MAKELONG(0x08, 0), 0, NULL},
    /*192*/ {"源矩形区域", "源矩形区域。为空则复制整个页面。", 0, 0, MAKELONG(0x01, 0), 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*193*/ {"目的页面", NULL, 0, 0, MAKELONG(0x08, 0), 0, NULL},
    /*194*/ {"目的矩形区域", "目的矩形区域。为空则复制整个页面。", 0, 0, MAKELONG(0x01, 0), 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*195*/ {"过滤器类型", "为“纹理过滤类型”常量中的任一值。", 0, 0, SDT_INT, 0, NULL},

    /*196*/ {"源页面", NULL, 0, 0, MAKELONG(0x08, 0), 0, NULL},
    /*197*/ {"源矩形区域", "源矩形区域。为空则复制整个页面。", 0, 0, MAKELONG(0x01, 0), 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*198*/ {"目的页面", NULL, 0, 0, MAKELONG(0x08, 0), 0, NULL},
    /*199*/ {"横坐标", "目的页面上的复制起点横坐标。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*200*/ {"纵坐标", "目的页面上的复制起点纵坐标。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},

    /*201*/ {"状态信息类型", "要在新的状态块中记录的状态信息的类型。为以下常量值之一：1、#设备常量.顶点和像素状态；2、#设备常量.像素状态；3、#设备常量.顶点状态。", 0, 0, SDT_INT, 0, NULL},
    /*202*/ {"状态块句柄", NULL, 0, 0, MAKELONG(0x20, 0), 0, NULL},

    /*203*/ {"状态块句柄", NULL, 0, 0, MAKELONG(0x20, 0), 0, NULL},

    /*204*/ {"页面", "要填充颜色的页面。", 0, 0, MAKELONG(0x08, 0), 0, NULL},
    /*205*/ {"颜色", "指定要填充的颜色。", 0, 0, SDT_INT, 0, NULL},
    /*206*/ {"矩形区域", "要填充的矩形区域。置空则填充整个页面。", 0, 0, MAKELONG(0x01, 0), 0, AS_DEFAULT_VALUE_IS_EMPTY},

    /*207*/ {"设备参数", "新交换链的描述参数。", 0, 0, MAKELONG(0x1B, 0), 0, NULL},
    /*208*/ {"附加交换链", NULL, 0, 0, MAKELONG(0x21, 0), 0, NULL},

    /*209*/ {"宽度", "深度模板页面宽度（以像素为单位）。", 0, 0, SDT_INT, 0, NULL},
    /*210*/ {"高度", "深度模板页面高度（以像素为单位）。", 0, 0, SDT_INT, 0, NULL},
    /*211*/ {"格式", "深度模板页面的格式。为“页面格式”常量值之一。", 0, 0, MAKELONG(0x35, 0), 0, NULL},
    /*212*/ {"多重采样类型", "为“多重采样类型”常量类型中的任一值。", 0, 0, MAKELONG(0x38, 0), 0, NULL},
    /*213*/ {"多重采样质量等级", NULL, 0, 0, SDT_INT, 0, NULL},
    /*214*/ {"Z缓冲清除", "0、禁用Z缓冲清除功能；1、启用Z缓冲清除功能。", 0, 0, SDT_BOOL, 0, NULL},
    /*215*/ {"页面", "要创建的深度模板缓冲页面。", 0, 0, MAKELONG(0x08, 0), 0, NULL},

    /*216*/ {"长度", "索引缓冲区的长度（以字节为单位）。", 0, 0, SDT_INT, 0, NULL},
    /*217*/ {"资源用途", "为“资源用途”常量值之一。", 0, 0, MAKELONG(0x37, 0), 0, NULL},
    /*218*/ {"内存池类型", "为“内存池类型”常量值之一。", 0, 0, MAKELONG(0x39, 0), 0, NULL},
    /*219*/ {"索引缓冲", "要创建的索引缓冲资源。", 0, 0, MAKELONG(0x18, 0), 0, NULL},

    /*220*/ {"宽度", "页面宽度。", 0, 0, SDT_INT, 0, NULL},
    /*221*/ {"高度", "页面高度。", 0, 0, SDT_INT, 0, NULL},
    /*222*/ {"页面格式", "为“页面格式”常量值之一。", 0, 0, MAKELONG(0x35, 0), 0, NULL},
    /*223*/ {"内存池类型", "为“内存池类型”常量值之一。", 0, 0, MAKELONG(0x39, 0), 0, NULL},
    /*224*/ {"页面", "要创建的页面。", 0, 0, MAKELONG(0x08, 0), 0, NULL},

    /*225*/ {"页面宽度", "渲染目标页面宽度（以像素为单位）。", 0, 0, SDT_INT, 0, NULL},
    /*226*/ {"页面高度", "渲染目标页面高度（以像素为单位）。", 0, 0, SDT_INT, 0, NULL},
    /*227*/ {"格式", "渲染目标页面的格式。为“页面格式”常量值之一。", 0, 0, MAKELONG(0x35, 0), 0, NULL},
    /*228*/ {"多重采样类型", "为“多重采样类型”常量类型中的任一值。", 0, 0, MAKELONG(0x38, 0), 0, NULL},
    /*229*/ {"多重采样质量等级", NULL, 0, 0, SDT_INT, 0, NULL},
    /*230*/ {"可锁定", "0、渲染目标页面不可锁定；1、渲染目标页面可锁定。", 0, 0, SDT_BOOL, 0, NULL},
    /*231*/ {"页面", "要创建的渲染目标页面。", 0, 0, MAKELONG(0x08, 0), 0, NULL},

    /*232*/ {"顶点成员", NULL, 0, 0, MAKELONG(0x16, 0), 0, NULL},
    /*233*/ {"顶点着色器声明", "要创建的顶点着色器声明。", 0, 0, MAKELONG(0x17, 0), 0, NULL},

    /*234*/ {"顶点着色器声明", "要置入的顶点着色器声明。", 0, 0, MAKELONG(0x17, 0), 0, NULL},

    /*235*/ {"顶点着色器声明", "要取得的顶点着色器声明。", 0, 0, MAKELONG(0x17, 0), 0, NULL},

    /*236*/ {"设备参数", "设备描述参数。", 0, 0, MAKELONG(0x1B, 0), 0, AS_DEFAULT_VALUE_IS_EMPTY},

    /*237*/ {"宽度", "顶层纹理的宽度（以像素为单位）。", 0, 0, SDT_INT, 0, NULL},
    /*238*/ {"高度", "顶层纹理的高度（以像素为单位）。", 0, 0, SDT_INT, 0, NULL},
    /*239*/ {"级数", "纹理的级数。", 0, 0, SDT_INT, 0, NULL},
    /*240*/ {"资源用途", "为“资源用途”常量值之一。", 0, 0, MAKELONG(0x37, 0), 0, NULL},
    /*241*/ {"页面格式", "为“页面格式”常量值之一。", 0, 0, MAKELONG(0x35, 0), 0, NULL},
    /*242*/ {"内存池类型", "为“内存池类型”常量值之一。", 0, 0, MAKELONG(0x39, 0), 0, NULL},
    /*243*/ {"纹理", "要创建的纹理资源。", 0, 0, MAKELONG(0x0F, 0), 0, NULL},

    /*244*/ {"边缘宽度", "所有顶层立方体纹理的边缘宽度。", 0, 0, SDT_INT, 0, NULL},
    /*245*/ {"级数", "每个立方体纹理面的级数。", 0, 0, SDT_INT, 0, NULL},
    /*246*/ {"资源用途", "为“资源用途”常量值之一。", 0, 0, MAKELONG(0x37, 0), 0, NULL},
    /*247*/ {"页面格式", "为“页面格式”常量值之一。", 0, 0, MAKELONG(0x35, 0), 0, NULL},
    /*248*/ {"内存池类型", "为“内存池类型”常量值之一。", 0, 0, MAKELONG(0x39, 0), 0, NULL},
    /*249*/ {"立方体纹理", "要创建的立方体纹理资源。", 0, 0, MAKELONG(0x12, 0), 0, NULL},

    /*250*/ {"宽度", "顶层立体纹理的宽度（以像素为单位）。", 0, 0, SDT_INT, 0, NULL},
    /*251*/ {"高度", "顶层立体纹理的高度（以像素为单位）。", 0, 0, SDT_INT, 0, NULL},
    /*252*/ {"深度", "顶层立体纹理的深度（以像素为单位）。", 0, 0, SDT_INT, 0, NULL},
    /*253*/ {"级数", "纹理的级数。", 0, 0, SDT_INT, 0, NULL},
    /*254*/ {"资源用途", "为“资源用途”常量值之一。", 0, 0, MAKELONG(0x37, 0), 0, NULL},
    /*255*/ {"页面格式", "为“页面格式”常量值之一。", 0, 0, MAKELONG(0x35, 0), 0, NULL},
    /*256*/ {"内存池类型", "为“内存池类型”常量值之一。", 0, 0, MAKELONG(0x39, 0), 0, NULL},
    /*257*/ {"立体纹理", "要创建的立体纹理资源。", 0, 0, MAKELONG(0x11, 0), 0, NULL},

    /*258*/ {"变换状态", "为“变换状态类型”常量值之一。", 0, 0, MAKELONG(0x3A, 0), 0, NULL},
    /*259*/ {"矩阵", "这个矩阵将要被设置为当前变换的矩阵。", 0, 0, MAKELONG(0x04, 0), 0, NULL},

    /*260*/ {"顶点着色器文件", "指定顶点着色器文件。", 0, 0, SDT_TEXT, 0, NULL},
    /*261*/ {"顶点着色器", "要创建的顶点着色器。", 0, 0, MAKELONG(0x15, 0), 0, NULL},

    /*262*/ {"注册编号", "第一个常量值的注册编号。", 0, 0, SDT_INT, 0, NULL},
    /*263*/ {"常量数组", "要置入的常量数组。", 0, 0, SDT_FLOAT, 0, AS_RECEIVE_VAR_ARRAY},
    /*264*/ {"四维向量个数", "常量数组中的四维向量个数。", 0, 0, SDT_INT, 0, NULL},

    /*265*/ {"注册编号", "第一个常量值的注册编号。", 0, 0, SDT_INT, 0, NULL},
    /*266*/ {"常量数据", "要置入的常量数据。", 0, 0, MAKELONG(0x04, 0), 0, NULL},
    /*267*/ {"四维向量个数", "常量数组中的四维向量个数。", 0, 0, SDT_INT, 0, NULL},

    /*268*/ {"顶点着色器", NULL, 0, 0, MAKELONG(0x15, 0), 0, NULL},

    /*269*/ {"顶点着色器", "要创建的顶点着色器。", 0, 0, MAKELONG(0x15, 0), 0, NULL},

    /*270*/ {"像素着色器文件", "指定顶点着色器文件。", 0, 0, SDT_TEXT, 0, NULL},
    /*271*/ {"像素着色器", "要创建的像素着色器。", 0, 0, MAKELONG(0x27, 0), 0, NULL},

    /*272*/ {"注册编号", "第一个常量值的注册编号。", 0, 0, SDT_INT, 0, NULL},
    /*273*/ {"常量数组", "要置入的常量数组。", 0, 0, SDT_FLOAT, 0, AS_RECEIVE_VAR_ARRAY},
    /*274*/ {"四维向量个数", "常量数组中的四维向量个数。", 0, 0, SDT_INT, 0, NULL},

    /*275*/ {"注册编号", "第一个常量值的注册编号。", 0, 0, SDT_INT, 0, NULL},
    /*276*/ {"常量数据", "要置入的常量数据。", 0, 0, MAKELONG(0x04, 0), 0, NULL},
    /*277*/ {"四维向量个数", "常量数组中的四维向量个数。", 0, 0, SDT_INT, 0, NULL},

    /*278*/ {"像素着色器", NULL, 0, 0, MAKELONG(0x27, 0), 0, NULL},

    /*279*/ {"像素着色器", "要创建的像素着色器。", 0, 0, MAKELONG(0x27, 0), 0, NULL},

    /*280*/ {"适配器序号", "指定要取得模式列表的适配器的序号。0表示主显示适配器。", 0, 0, SDT_INT, 0, NULL},
    /*281*/ {"像素格式", "允许的像素格式。有效的格式有以下几个：21、#页面格式.透8红8绿8蓝8；22、#页面格式.保8红8绿8蓝8；23、#页面格式.红5绿6蓝5；24、#页面格式.保1红5绿5蓝5；25、#页面格式.透1红5绿5蓝5；35、#页面格式.透2红10绿10蓝10。", 0, 0, MAKELONG(0x35, 0), 0, NULL},

    /*282*/ {"适配器序号", "指定要取得模式的适配器的序号。默认值为主显示适配器。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*283*/ {"显示模式", "要取得的当前显示模式。", 0, 0, MAKELONG(0x22, 0), 0, NULL},

    /*284*/ {"适配器序号", "指定要检测的适配器的序号。默认值为主显示适配器。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*285*/ {"设备类型", "指定设备的类型，为以下常量值之一：1、#设备常量.硬件加速；2、#设备常量.软件加速；3、#设备常量.第三方设备插件。", 0, 0, SDT_INT, 0, NULL},
    /*286*/ {"显示格式", "要检测的适配器的显示格式。", 0, 0, MAKELONG(0x35, 0), 0, NULL},
    /*287*/ {"后台缓冲格式", "应该注意到，在窗口模式，后台缓冲的格式不一定要匹配于显示格式，只要你的硬件支持适当的颜色转换就可以了。不论你的硬件是否支持这种功能，本方法都会返回适当的结果。", 0, 0, MAKELONG(0x35, 0), 0, NULL},
    /*288*/ {"窗口模式", "是否窗口模式或全屏模式。真为窗口模式，假为全屏模式。", 0, 0, SDT_BOOL, 0, NULL},

    /*289*/ {"适配器序号", "指定要检测的适配器的序号。默认值为主显示适配器。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*290*/ {"设备类型", "指定设备的类型，为以下常量值之一：1、#设备常量.硬件加速；2、#设备常量.软件加速；3、#设备常量.第三方设备插件。", 0, 0, SDT_INT, 0, NULL},
    /*291*/ {"显示格式", "要检测的适配器的显示格式。", 0, 0, MAKELONG(0x35, 0), 0, NULL},
    /*292*/ {"用途", "为“资源用途”常量值之一。", 0, 0, MAKELONG(0x37, 0), 0, NULL},
    /*293*/ {"资源类型", "为“资源类型”常量值之一。", 0, 0, MAKELONG(0x36, 0), 0, NULL},
    /*294*/ {"检测格式", "要检测的设备页面格式。", 0, 0, MAKELONG(0x35, 0), 0, NULL},

    /*295*/ {"设备", "要取得的设备。", 0, 0, MAKELONG(0x09, 0), 0, NULL},

    /*296*/ {"后台缓冲序号", "要取得的后台缓冲序号。序号范围从0 - (后台缓冲数量 - 1)。为0返回第一个后台页面（不是前台页面），不能通过该命令取得前台页面。", 0, 0, SDT_INT, 0, NULL},
    /*297*/ {"后台缓冲页面", "要取得的后台缓冲页面。", 0, 0, MAKELONG(0x08, 0), 0, NULL},

    /*298*/ {"显示模式", "要取得的显示模式。", 0, 0, MAKELONG(0x22, 0), 0, NULL},

    /*299*/ {"目标页面", "交换链前台缓冲页面的副本。在窗口模式中，目标页面的大小为桌面大小；在全屏模式中，目标页面的大小为屏幕大小。", 0, 0, MAKELONG(0x08, 0), 0, NULL},

    /*300*/ {"设备参数", "要取得的设备参数。", 0, 0, MAKELONG(0x1B, 0), 0, NULL},

    /*301*/ {"源矩形", "源矩形。为空则显示整个源页面。", 0, 0, MAKELONG(0x01, 0), 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*302*/ {"目的矩形", "目的矩形。为空则整个客户区域被填充。", 0, 0, MAKELONG(0x01, 0), 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*303*/ {"目标窗口", "指定显示的目标窗口，置空则为设备参数中的设备窗口句柄。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},

    /*304*/ {"几维纹理", "可以为“灵活顶点格式”常量数据类型中的“一维纹理”、“二维纹理”、“三维纹理”、“四维纹理”。", 0, 0, MAKELONG(0x3C, 0), 0, NULL},
    /*305*/ {"第几层", "第几层维理。", 0, 0, SDT_INT, 0, NULL},

    /*306*/ {"设备", "指定与立方体纹理相关联的设备。", 0, 0, MAKELONG(0x09, 0), 0, NULL},
    /*307*/ {"尺寸", "指定宽度和高度（以像素为单位）。并返回校正后的尺寸。", 0, 0, SDT_INT, 0, AS_RECEIVE_VAR},
    /*308*/ {"渐进映射级数", "指定渐进映射级数。并返回校正后的渐进映射级数。", 0, 0, SDT_INT, 0, AS_RECEIVE_VAR},
    /*309*/ {"用途", "为以下两个值之一：0、1。如果为1，值相当于#资源用途.渲染目标。", 0, 0, SDT_INT, 0, NULL},
    /*310*/ {"像素格式", "要取得的像素格式。并返回校正后的像素格式。", 0, 0, MAKELONG(0x35, 0), 0, AS_RECEIVE_VAR},
    /*311*/ {"内存池类型", "指定纹理的放置位置。为“内存池类型”常量值之一。", 0, 0, MAKELONG(0x39, 0), 0, NULL},

    /*312*/ {"设备", "指定与纹理相关联的设备。", 0, 0, MAKELONG(0x09, 0), 0, NULL},
    /*313*/ {"宽度", "指定宽度（以像素为单位）。并返回校正后的宽度。", 0, 0, SDT_INT, 0, AS_RECEIVE_VAR},
    /*314*/ {"高度", "指定高度（以像素为单位）。并返回校正后的高度。", 0, 0, SDT_INT, 0, AS_RECEIVE_VAR},
    /*315*/ {"渐进映射级数", "指定渐进映射级数。返回校正后的渐进映射级数。", 0, 0, SDT_INT, 0, AS_RECEIVE_VAR},
    /*316*/ {"用途", "为以下两个值之一：0、1。如果为1，值相当于#资源用途.渲染目标。", 0, 0, SDT_INT, 0, NULL},
    /*317*/ {"像素格式", "要取得的像素格式。并返回校正后的像素格式。", 0, 0, MAKELONG(0x35, 0), 0, AS_RECEIVE_VAR},
    /*318*/ {"内存池类型", "指定纹理的放置位置。为“内存池类型”常量值之一。", 0, 0, MAKELONG(0x39, 0), 0, NULL},

    /*319*/ {"设备", "指定与立体纹理相关联的设备。", 0, 0, MAKELONG(0x09, 0), 0, NULL},
    /*320*/ {"宽度", "指定宽度（以像素为单位）。并返回校正后的尺寸。", 0, 0, SDT_INT, 0, AS_RECEIVE_VAR},
    /*321*/ {"高度", "指定高度（以像素为单位）。并返回校正后的尺寸。", 0, 0, SDT_INT, 0, AS_RECEIVE_VAR},
    /*322*/ {"深度", "指定深度（以像素为单位）。并返回校正后的尺寸。", 0, 0, SDT_INT, 0, AS_RECEIVE_VAR},
    /*323*/ {"渐进映射级数", "指定渐进映射级数。返回校正后的渐进映射级数。", 0, 0, SDT_INT, 0, AS_RECEIVE_VAR},
    /*324*/ {"用途", "没用，置为0。", 0, 0, SDT_INT, 0, NULL},
    /*325*/ {"像素格式", "要取得的像素格式。并返回校正后的像素格式。", 0, 0, MAKELONG(0x35, 0), 0, AS_RECEIVE_VAR},
    /*326*/ {"内存池类型", "指定纹理的放置位置。为“内存池类型”常量值之一。", 0, 0, MAKELONG(0x39, 0), 0, NULL},

    /*327*/ {"目标纹理", "指定的目标纹理。", 0, 0, MAKELONG(0x0F, 0), 0, AS_RECEIVE_VAR},
    /*328*/ {"源纹理", "源高度贴图纹理。", 0, 0, MAKELONG(0x0F, 0), 0, NULL},
    /*329*/ {"源调色板单元", "源256色调色板。", 0, 0, MAKELONG(0x1F, 0), 0, AS_RECEIVE_VAR},
    /*330*/ {"标志", "控制生成法线贴图的标志。", 0, 0, SDT_INT, 0, NULL},
    /*331*/ {"通道", "指定源高度贴图通道信息。", 0, 0, SDT_INT, 0, NULL},
    /*332*/ {"Amplitude", NULL, 0, 0, SDT_FLOAT, 0, NULL},

    /*333*/ {"设备", "指定与纹理相关联的设备。", 0, 0, MAKELONG(0x09, 0), 0, NULL},
    /*334*/ {"尺寸", "立方体纹理的宽度和高度（以像素为单位）", 0, 0, SDT_INT, 0, NULL},
    /*335*/ {"渐进级数", "指定渐进级数。如果参数值为0或-1，将创建一个完整的渐进映射链。", 0, 0, SDT_INT, 0, NULL},
    /*336*/ {"用途", "为“资源用途”常量值之一。", 0, 0, MAKELONG(0x37, 0), 0, NULL},
    /*337*/ {"像素格式", "要取得的像素格式。", 0, 0, MAKELONG(0x35, 0), 0, NULL},
    /*338*/ {"内存池类型", "指定纹理的放置位置。为“内存池类型”常量值之一。", 0, 0, MAKELONG(0x39, 0), 0, NULL},
    /*339*/ {"立方体纹理", "要创建的立方体纹理对象。", 0, 0, MAKELONG(0x12, 0), 0, AS_RECEIVE_VAR},

    /*340*/ {"设备", "指定与立方体纹理相关联的设备。", 0, 0, MAKELONG(0x09, 0), 0, NULL},
    /*341*/ {"文件名", "指定文件名。", 0, 0, SDT_TEXT, 0, NULL},
    /*342*/ {"立方体纹理", "要创建的立方体纹理对象。", 0, 0, MAKELONG(0x12, 0), 0, AS_RECEIVE_VAR},

    /*343*/ {"设备", "指定与立方体纹理相关联的设备。", 0, 0, MAKELONG(0x09, 0), 0, NULL},
    /*344*/ {"文件名", "指定文件名。", 0, 0, SDT_TEXT, 0, NULL},
    /*345*/ {"尺寸", "立方体纹理的宽度和高度（以像素为单位）。", 0, 0, SDT_INT, 0, NULL},
    /*346*/ {"渐进级数", "指定渐进级数。如果参数值为0或-1，将创建一个完整的渐进映射链。", 0, 0, SDT_INT, 0, NULL},
    /*347*/ {"用途", "为“资源用途”常量值之一。", 0, 0, MAKELONG(0x37, 0), 0, NULL},
    /*348*/ {"像素格式", "要取得的像素格式。", 0, 0, MAKELONG(0x35, 0), 0, NULL},
    /*349*/ {"内存池类型", "指定纹理的放置位置。为“内存池类型”常量值之一。", 0, 0, MAKELONG(0x39, 0), 0, NULL},
    /*350*/ {"纹理过滤器", "指定图像如何过滤。为“纹理通道过滤”常量值之一或组合。值为-1时相当于：#纹理通道过滤.由点生成目标点 + #纹理通道过滤.用抖动运算产生。", 0, 0, MAKELONG(0x40, 0), 0, NULL},
    /*351*/ {"渐进过滤器", "指定图像如何过滤。为“纹理通道过滤”常量值之一或组合。值为-1时等于：#纹理通道过滤.由区域生成目标点。", 0, 0, MAKELONG(0x40, 0), 0, NULL},
    /*352*/ {"关键色", "表示被替换为Alpha = 0的透明色。设置为0，表示禁用透明色。", 0, 0, SDT_INT, 0, NULL},
    /*353*/ {"源图像文件信息", NULL, 0, 0, MAKELONG(0x28, 0), 0, AS_RECEIVE_VAR},
    /*354*/ {"调色板", "返回256色调色板单元。", 0, 0, MAKELONG(0x1F, 0), 0, AS_RECEIVE_VAR},
    /*355*/ {"立方体纹理", "要创建的立方体纹理对象。", 0, 0, MAKELONG(0x12, 0), 0, AS_RECEIVE_VAR},

    /*356*/ {"设备", "指定与立方体纹理相关联的设备。", 0, 0, MAKELONG(0x09, 0), 0, NULL},
    /*357*/ {"源数据", "要创建纹理的内存文件数据。", 0, 0, SDT_BIN, 0, NULL},
    /*358*/ {"立方体纹理", "要创建的立方体纹理对象。", 0, 0, MAKELONG(0x12, 0), 0, AS_RECEIVE_VAR},

    /*359*/ {"设备", "指定与立方体纹理相关联的设备。", 0, 0, MAKELONG(0x09, 0), 0, NULL},
    /*360*/ {"源数据", "要创建纹理的内存文件数据。", 0, 0, SDT_BIN, 0, NULL},
    /*361*/ {"尺寸", "立方体纹理的宽度和高度（以像素为单位）。", 0, 0, SDT_INT, 0, NULL},
    /*362*/ {"渐进级数", "指定渐进级数。如果参数值为0或-1，将创建一个完整的渐进映射链。", 0, 0, SDT_INT, 0, NULL},
    /*363*/ {"用途", "为“资源用途”常量值之一。", 0, 0, MAKELONG(0x37, 0), 0, NULL},
    /*364*/ {"像素格式", "要取得的像素格式。", 0, 0, MAKELONG(0x35, 0), 0, NULL},
    /*365*/ {"内存池类型", "指定纹理的放置位置。为“内存池类型”常量值之一。", 0, 0, MAKELONG(0x39, 0), 0, NULL},
    /*366*/ {"纹理过滤器", "指定图像如何过滤。为“纹理通道过滤”常量值之一或组合。值为-1时相当于：#纹理通道过滤.由点生成目标点 + #纹理通道过滤.用抖动运算产生。", 0, 0, MAKELONG(0x40, 0), 0, NULL},
    /*367*/ {"渐进过滤器", "指定图像如何过滤。为“纹理通道过滤”常量值之一或组合。值为-1时等于：#纹理通道过滤.由区域生成目标点。", 0, 0, MAKELONG(0x40, 0), 0, NULL},
    /*368*/ {"关键色", "表示被替换为Alpha = 0的透明色。设置为0，表示禁用透明色。", 0, 0, SDT_INT, 0, NULL},
    /*369*/ {"源图像文件信息", NULL, 0, 0, MAKELONG(0x28, 0), 0, AS_RECEIVE_VAR},
    /*370*/ {"调色板", "返回256色调色板单元。", 0, 0, MAKELONG(0x1F, 0), 0, AS_RECEIVE_VAR},
    /*371*/ {"立方体纹理", "要创建的立方体纹理对象。", 0, 0, MAKELONG(0x12, 0), 0, AS_RECEIVE_VAR},

    /*372*/ {"设备", "指定与纹理相关联的设备。", 0, 0, MAKELONG(0x09, 0), 0, NULL},
    /*373*/ {"宽度", "纹理的宽度（以像素为单位）。", 0, 0, SDT_INT, 0, NULL},
    /*374*/ {"高度", "纹理的高度（以像素为单位）。", 0, 0, SDT_INT, 0, NULL},
    /*375*/ {"渐进级数", "指定渐进级数。如果参数值为0或-1，将创建一个完整的渐进映射链。", 0, 0, SDT_INT, 0, NULL},
    /*376*/ {"用途", "为“资源用途”常量值之一。", 0, 0, MAKELONG(0x37, 0), 0, NULL},
    /*377*/ {"像素格式", "要取得的像素格式。", 0, 0, MAKELONG(0x35, 0), 0, NULL},
    /*378*/ {"内存池类型", "指定纹理的放置位置。为“内存池类型”常量值之一。", 0, 0, MAKELONG(0x39, 0), 0, NULL},
    /*379*/ {"纹理", "要创建的纹理对象。", 0, 0, MAKELONG(0x0F, 0), 0, AS_RECEIVE_VAR},

    /*380*/ {"设备", "指定与纹理相关联的设备。", 0, 0, MAKELONG(0x09, 0), 0, NULL},
    /*381*/ {"文件名", "指定文件名。", 0, 0, SDT_TEXT, 0, NULL},
    /*382*/ {"纹理", "要创建的纹理对象。", 0, 0, MAKELONG(0x0F, 0), 0, NULL},

    /*383*/ {"设备", "指定与纹理相关联的设备。", 0, 0, MAKELONG(0x09, 0), 0, NULL},
    /*384*/ {"文件名", "指定文件名。", 0, 0, SDT_TEXT, 0, NULL},
    /*385*/ {"宽度", "纹理的宽度（以像素为单位）。如果参数值为0或-1，尺寸将从文件中取得。", 0, 0, SDT_INT, 0, NULL},
    /*386*/ {"高度", "纹理的高度（以像素为单位）。如果参数值为0或-1，尺寸将从文件中取得。", 0, 0, SDT_INT, 0, NULL},
    /*387*/ {"渐进级数", "指定渐进级数。如果参数值为0或-1，将创建一个完整的渐进映射链。", 0, 0, SDT_INT, 0, NULL},
    /*388*/ {"用途", "为“资源用途”常量值之一。", 0, 0, MAKELONG(0x37, 0), 0, NULL},
    /*389*/ {"像素格式", "要取得的像素格式。", 0, 0, MAKELONG(0x35, 0), 0, NULL},
    /*390*/ {"内存池类型", "指定纹理的放置位置。为“内存池类型”常量值之一。", 0, 0, MAKELONG(0x39, 0), 0, NULL},
    /*391*/ {"纹理过滤器", "指定图像如何过滤。为“纹理通道过滤”常量值之一或组合。值为-1时相当于：#纹理通道过滤.由点生成目标点 + #纹理通道过滤.用抖动运算产生。", 0, 0, MAKELONG(0x40, 0), 0, NULL},
    /*392*/ {"渐进过滤器", "指定图像如何过滤。为“纹理通道过滤”常量值之一或组合。值为-1时等于：#纹理通道过滤.由区域生成目标点。", 0, 0, MAKELONG(0x40, 0), 0, NULL},
    /*393*/ {"关键色", "表示被替换为Alpha = 0的透明色。设置为0，表示禁用透明色。", 0, 0, SDT_INT, 0, NULL},
    /*394*/ {"源图像文件信息", NULL, 0, 0, MAKELONG(0x28, 0), 0, NULL},
    /*395*/ {"调色板", "返回256色调色板单元。", 0, 0, MAKELONG(0x1F, 0), 0, NULL},
    /*396*/ {"纹理", "要创建的纹理对象。", 0, 0, MAKELONG(0x0F, 0), 0, AS_RECEIVE_VAR},

    /*397*/ {"设备", "指定与纹理相关联的设备。", 0, 0, MAKELONG(0x09, 0), 0, NULL},
    /*398*/ {"源数据", "要创建纹理的内存文件数据。", 0, 0, SDT_BIN, 0, NULL},
    /*399*/ {"纹理", "要创建的纹理对象。", 0, 0, MAKELONG(0x0F, 0), 0, AS_RECEIVE_VAR},

    /*400*/ {"设备", "指定与纹理相关联的设备。", 0, 0, MAKELONG(0x09, 0), 0, NULL},
    /*401*/ {"源数据", "要创建纹理的内存文件数据。", 0, 0, SDT_BIN, 0, NULL},
    /*402*/ {"宽度", "纹理的宽度（以像素为单位）。如果参数值为0或-1，尺寸将从文件中取得。", 0, 0, SDT_INT, 0, NULL},
    /*403*/ {"高度", "纹理的高度（以像素为单位）。如果参数值为0或-1，尺寸将从文件中取得。", 0, 0, SDT_INT, 0, NULL},
    /*404*/ {"渐进级数", "指定渐进级数。如果参数值为0或-1，将创建一个完整的渐进映射链。", 0, 0, SDT_INT, 0, NULL},
    /*405*/ {"用途", "为“资源用途”常量值之一。", 0, 0, MAKELONG(0x37, 0), 0, NULL},
    /*406*/ {"像素格式", "要取得的像素格式。", 0, 0, MAKELONG(0x35, 0), 0, NULL},
    /*407*/ {"内存池类型", "指定纹理的放置位置。为“内存池类型”常量值之一。", 0, 0, MAKELONG(0x39, 0), 0, NULL},
    /*408*/ {"纹理过滤器", "指定图像如何过滤。为“纹理通道过滤”常量值之一或组合。值为-1时相当于：#纹理通道过滤.由点生成目标点 + #纹理通道过滤.用抖动运算产生。", 0, 0, MAKELONG(0x40, 0), 0, NULL},
    /*409*/ {"渐进过滤器", "指定图像如何过滤。为“纹理通道过滤”常量值之一或组合。值为-1时等于：#纹理通道过滤.由区域生成目标点。", 0, 0, MAKELONG(0x40, 0), 0, NULL},
    /*410*/ {"关键色", "表示被替换为Alpha = 0的透明色。设置为0，表示禁用透明色。", 0, 0, SDT_INT, 0, NULL},
    /*411*/ {"源图像文件信息", NULL, 0, 0, MAKELONG(0x28, 0), 0, AS_RECEIVE_VAR},
    /*412*/ {"调色板", "返回256色调色板单元。", 0, 0, MAKELONG(0x1F, 0), 0, AS_RECEIVE_VAR},
    /*413*/ {"纹理", "要创建的纹理对象。", 0, 0, MAKELONG(0x0F, 0), 0, AS_RECEIVE_VAR},

    /*414*/ {"设备", "指定与立体纹理相关联的设备。", 0, 0, MAKELONG(0x09, 0), 0, NULL},
    /*415*/ {"宽度", "立体纹理的宽度（以像素为单位）。不能为0。", 0, 0, SDT_INT, 0, NULL},
    /*416*/ {"高度", "立体纹理的高度（以像素为单位）。不能为0。", 0, 0, SDT_INT, 0, NULL},
    /*417*/ {"深度", "立体纹理的深度（以像素为单位）。不能为0。", 0, 0, SDT_INT, 0, NULL},
    /*418*/ {"渐进级数", "指定渐进级数。如果参数值为0或-1，将创建一个完整的渐进映射链。", 0, 0, SDT_INT, 0, NULL},
    /*419*/ {"用途", "为“资源用途”常量值之一。", 0, 0, MAKELONG(0x37, 0), 0, NULL},
    /*420*/ {"像素格式", "要取得的像素格式。", 0, 0, MAKELONG(0x35, 0), 0, NULL},
    /*421*/ {"内存池类型", "指定纹理的放置位置。为“内存池类型”常量值之一。", 0, 0, MAKELONG(0x39, 0), 0, NULL},
    /*422*/ {"立体纹理", "要创建的立体纹理对象。", 0, 0, MAKELONG(0x11, 0), 0, AS_RECEIVE_VAR},

    /*423*/ {"设备", "指定与立体纹理相关联的设备。", 0, 0, MAKELONG(0x09, 0), 0, NULL},
    /*424*/ {"文件名", "指定文件名。", 0, 0, SDT_TEXT, 0, NULL},
    /*425*/ {"立体纹理", "要创建的立体纹理对象。", 0, 0, MAKELONG(0x11, 0), 0, AS_RECEIVE_VAR},

    /*426*/ {"设备", "指定与立体纹理相关联的设备。", 0, 0, MAKELONG(0x09, 0), 0, NULL},
    /*427*/ {"文件名", "指定文件名。", 0, 0, SDT_TEXT, 0, NULL},
    /*428*/ {"宽度", "立体纹理的宽度（以像素为单位）。如果参数值为0或-1，尺寸将从文件中取得。", 0, 0, SDT_INT, 0, NULL},
    /*429*/ {"高度", "立体纹理的高度（以像素为单位）。如果参数值为0或-1，尺寸将从文件中取得。", 0, 0, SDT_INT, 0, NULL},
    /*430*/ {"深度", "立体纹理的深度（以像素为单位）。如果参数值为0或-1，尺寸将从文件中取得。", 0, 0, SDT_INT, 0, NULL},
    /*431*/ {"渐进级数", "指定渐进级数。如果参数值为0或-1，将创建一个完整的渐进映射链。", 0, 0, SDT_INT, 0, NULL},
    /*432*/ {"用途", "为“资源用途”常量值之一。", 0, 0, MAKELONG(0x37, 0), 0, NULL},
    /*433*/ {"像素格式", "要取得的像素格式。", 0, 0, MAKELONG(0x35, 0), 0, NULL},
    /*434*/ {"内存池类型", "指定纹理的放置位置。为“内存池类型”常量值之一。", 0, 0, MAKELONG(0x39, 0), 0, NULL},
    /*435*/ {"纹理过滤器", "指定图像如何过滤。为“纹理通道过滤”常量值之一或组合。值为-1时相当于：#纹理通道过滤.由点生成目标点 + #纹理通道过滤.用抖动运算产生。", 0, 0, MAKELONG(0x40, 0), 0, NULL},
    /*436*/ {"渐进过滤器", "指定图像如何过滤。为“纹理通道过滤”常量值之一或组合。值为-1时等于：#纹理通道过滤.由区域生成目标点。", 0, 0, MAKELONG(0x40, 0), 0, NULL},
    /*437*/ {"关键色", "表示被替换为Alpha = 0的透明色。设置为0，表示禁用透明色。", 0, 0, SDT_INT, 0, NULL},
    /*438*/ {"源图像文件信息", NULL, 0, 0, MAKELONG(0x28, 0), 0, AS_RECEIVE_VAR},
    /*439*/ {"调色板", "返回256色调色板单元。", 0, 0, MAKELONG(0x1F, 0), 0, AS_RECEIVE_VAR},
    /*440*/ {"立体纹理", "要创建的立体纹理对象。", 0, 0, MAKELONG(0x11, 0), 0, AS_RECEIVE_VAR},

    /*441*/ {"设备", "指定与立体纹理相关联的设备。", 0, 0, MAKELONG(0x09, 0), 0, NULL},
    /*442*/ {"源数据", "要创建立体纹理的内存文件数据。", 0, 0, SDT_BIN, 0, NULL},
    /*443*/ {"立体纹理", "要创建的立体纹理对象。", 0, 0, MAKELONG(0x11, 0), 0, AS_RECEIVE_VAR},

    /*444*/ {"设备", "指定与立体纹理相关联的设备。", 0, 0, MAKELONG(0x09, 0), 0, NULL},
    /*445*/ {"源数据", "要创建立体纹理的内存文件数据。", 0, 0, SDT_BIN, 0, NULL},
    /*446*/ {"宽度", "立体纹理的宽度（以像素为单位）。如果参数值为0或-1，尺寸将从文件中取得。", 0, 0, SDT_INT, 0, NULL},
    /*447*/ {"高度", "立体纹理的高度（以像素为单位）。如果参数值为0或-1，尺寸将从文件中取得。", 0, 0, SDT_INT, 0, NULL},
    /*448*/ {"深度", "立体纹理的深度（以像素为单位）。如果参数值为0或-1，尺寸将从文件中取得。", 0, 0, SDT_INT, 0, NULL},
    /*449*/ {"渐进级数", "指定渐进级数。如果参数值为0或-1，将创建一个完整的渐进映射链。", 0, 0, SDT_INT, 0, NULL},
    /*450*/ {"用途", "为“资源用途”常量值之一。", 0, 0, MAKELONG(0x37, 0), 0, NULL},
    /*451*/ {"像素格式", "要取得的像素格式。", 0, 0, MAKELONG(0x35, 0), 0, NULL},
    /*452*/ {"内存池类型", "指定纹理的放置位置。为“内存池类型”常量值之一。", 0, 0, MAKELONG(0x39, 0), 0, NULL},
    /*453*/ {"纹理过滤器", "指定图像如何过滤。为“纹理通道过滤”常量值之一或组合。值为-1时相当于：#纹理通道过滤.由点生成目标点 + #纹理通道过滤.用抖动运算产生。", 0, 0, MAKELONG(0x40, 0), 0, NULL},
    /*454*/ {"渐进过滤器", "指定图像如何过滤。为“纹理通道过滤”常量值之一或组合。值为-1时等于：#纹理通道过滤.由区域生成目标点。", 0, 0, MAKELONG(0x40, 0), 0, NULL},
    /*455*/ {"关键色", "表示被替换为Alpha = 0的透明色。设置为0，表示禁用透明色。", 0, 0, SDT_INT, 0, NULL},
    /*456*/ {"源图像文件信息", NULL, 0, 0, MAKELONG(0x28, 0), 0, AS_RECEIVE_VAR},
    /*457*/ {"调色板", "返回256色调色板单元。", 0, 0, MAKELONG(0x1F, 0), 0, AS_RECEIVE_VAR},
    /*458*/ {"立体纹理", "要创建的立体纹理对象。", 0, 0, MAKELONG(0x11, 0), 0, AS_RECEIVE_VAR},

    /*459*/ {"文件", "指定的文件名。", 0, 0, SDT_TEXT, 0, NULL},
    /*460*/ {"图像信息", "要保存的图像信息。", 0, 0, MAKELONG(0x28, 0), 0, NULL},

    /*461*/ {"图片资源", "指定的图片资源。", 0, 0, SDT_BIN, 0, NULL},
    /*462*/ {"图像信息", "要保存的图像信息。", 0, 0, MAKELONG(0x28, 0), 0, NULL},

    /*463*/ {"页面", "目标面页。", 0, 0, MAKELONG(0x08, 0), 0, NULL},
    /*464*/ {"调色板", "目标调色板，成员都为0表示不指定。", 0, 0, MAKELONG(0x1F, 0), 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*465*/ {"目标区域", "目标区域，成员都为0表示全部区域。", 0, 0, MAKELONG(0x01, 0), 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*466*/ {"原文件", "原文件名。", 0, 0, SDT_TEXT, 0, NULL},
    /*467*/ {"原区域", "原区域。", 0, 0, MAKELONG(0x01, 0), 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*468*/ {"过滤", "决定图像将如何过滤。", 0, 0, MAKELONG(0x40, 0), 0, NULL},
    /*469*/ {"关键色", "指定的颜色值将原图像和它相同的颜色变透明,设为0表示不用关键色。", 0, 0, SDT_INT, 0, NULL},
    /*470*/ {"图像信息", "要保存的图像信息。", 0, 0, MAKELONG(0x28, 0), 0, AS_DEFAULT_VALUE_IS_EMPTY},

    /*471*/ {"页面", "目标面页。", 0, 0, MAKELONG(0x08, 0), 0, NULL},
    /*472*/ {"调色板", "目标调色板，成员都为0表示不指定。", 0, 0, MAKELONG(0x1F, 0), 0, NULL},
    /*473*/ {"目标区域", "目标区域，成员都为0表示全部区域。", 0, 0, MAKELONG(0x01, 0), 0, NULL},
    /*474*/ {"图片资源", "指定的图片资源。", 0, 0, SDT_BIN, 0, NULL},
    /*475*/ {"原区域", "原区域。", 0, 0, MAKELONG(0x01, 0), 0, NULL},
    /*476*/ {"过滤", "决定图像将如何过滤。", 0, 0, MAKELONG(0x40, 0), 0, NULL},
    /*477*/ {"关键色", "指定的颜色值将原图像和它相同的颜色变透明,设为0表示不用关键色。", 0, 0, SDT_INT, 0, NULL},
    /*478*/ {"图像信息", "要保存的图像信息。", 0, 0, MAKELONG(0x28, 0), 0, NULL},

    /*479*/ {"目标文件", "要保存的目标文件名。", 0, 0, SDT_TEXT, 0, NULL},
    /*480*/ {"文件格式", "目标文件格式。", 0, 0, MAKELONG(0x41, 0), 0, NULL},
    /*481*/ {"页面", "页面。", 0, 0, MAKELONG(0x08, 0), 0, NULL},
    /*482*/ {"区域", "页面的区域，注：将结构全部填为0，表示整个页面。", 0, 0, MAKELONG(0x01, 0), 0, NULL},

    /*483*/ {"目标文件", "要保存的目标文件名。", 0, 0, SDT_TEXT, 0, NULL},
    /*484*/ {"文件格式", "目标文件格式。", 0, 0, MAKELONG(0x41, 0), 0, NULL},
    /*485*/ {"纹理", "纹理。", 0, 0, MAKELONG(0x10, 0), 0, NULL},

    /*486*/ {"目标文件", "要保存的目标文件名。", 0, 0, SDT_TEXT, 0, NULL},
    /*487*/ {"文件格式", "目标文件格式。", 0, 0, MAKELONG(0x41, 0), 0, NULL},
    /*488*/ {"立体", "立体空间。", 0, 0, MAKELONG(0x25, 0), 0, NULL},
    /*489*/ {"立体区域", "立体空间的区域，注：将结构全部填为0，表示整个立体空间。", 0, 0, MAKELONG(0x23, 0), 0, NULL},

    /*490*/ {"透明色", "透明色(A)，范围从0到255。", 0, 0, SDT_INT, 0, NULL},
    /*491*/ {"红色", "红色(R)，范围从0到255。", 0, 0, SDT_INT, 0, NULL},
    /*492*/ {"绿色", "绿色(G)，范围从0到255。", 0, 0, SDT_INT, 0, NULL},
    /*493*/ {"蓝色", "蓝色(B)，范围从0到255。", 0, 0, SDT_INT, 0, NULL},

    /*494*/ {"浮点数", "要转换为整型的浮点数。", 0, 0, SDT_FLOAT, 0, NULL},

    /*495*/ {"参数向量", NULL, 0, 0, MAKELONG(0x02, 0), 0, NULL},

    /*496*/ {"参数向量", NULL, 0, 0, MAKELONG(0x02, 0), 0, NULL},
    /*497*/ {"参数向量", NULL, 0, 0, MAKELONG(0x02, 0), 0, NULL},

    /*498*/ {"比例因子", "对向量进行缩放的比例因子", 0, 0, SDT_FLOAT, 0, NULL},

    /*499*/ {"变换矩阵", NULL, 0, 0, MAKELONG(0x04, 0), 0, NULL},

    /*500*/ {"变换矩阵", "如果一个非仿射矩阵变换，那么这个矩阵要作逆运算后再转置才传给函数", 0, 0, MAKELONG(0x04, 0), 0, NULL},

    /*501*/ {"视口", NULL, 0, 0, MAKELONG(0x07, 0), 0, NULL},
    /*502*/ {"投影矩阵", NULL, 0, 0, MAKELONG(0x04, 0), 0, NULL},
    /*503*/ {"视变换矩阵", NULL, 0, 0, MAKELONG(0x04, 0), 0, NULL},
    /*504*/ {"世界变换矩阵", NULL, 0, 0, MAKELONG(0x04, 0), 0, NULL},

    /*505*/ {"视口", NULL, 0, 0, MAKELONG(0x07, 0), 0, NULL},
    /*506*/ {"投影矩阵", NULL, 0, 0, MAKELONG(0x04, 0), 0, NULL},
    /*507*/ {"视变换矩阵", NULL, 0, 0, MAKELONG(0x04, 0), 0, NULL},
    /*508*/ {"世界变换矩阵", NULL, 0, 0, MAKELONG(0x04, 0), 0, NULL},

    /*509*/ {"参数向量", NULL, 0, 0, MAKELONG(0x02, 0), 0, NULL},
    /*510*/ {"插值参数", NULL, 0, 0, SDT_FLOAT, 0, NULL},

    /*511*/ {"参数向量", NULL, 0, 0, MAKELONG(0x03, 0), 0, NULL},

    /*512*/ {"参数向量", NULL, 0, 0, MAKELONG(0x03, 0), 0, NULL},
    /*513*/ {"参数向量", NULL, 0, 0, MAKELONG(0x03, 0), 0, NULL},

    /*514*/ {"缩放因子", NULL, 0, 0, SDT_FLOAT, 0, NULL},
    /*515*/ {"旋转中心向量", "如果该项为空，就用一个单位矩阵代替Mrc", 0, 0, MAKELONG(0x02, 0), 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*516*/ {"旋转矩阵", "如果该项为空，就用单位矩阵Mr代替", 0, 0, MAKELONG(0x06, 0), 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*517*/ {"平移向量", "如果该项为空，就用单位矩阵Mt代替", 0, 0, MAKELONG(0x02, 0), 0, AS_DEFAULT_VALUE_IS_EMPTY},

    /*518*/ {"眼睛位置", "眼睛所有在位置向量", 0, 0, MAKELONG(0x02, 0), 0, NULL},
    /*519*/ {"摄像机位置", "摄像机观察目标位置向量", 0, 0, MAKELONG(0x02, 0), 0, NULL},
    /*520*/ {"上方向向量", "世界坐标系向上方向向量。通常用[0, 1, 0]向量", 0, 0, MAKELONG(0x02, 0), 0, NULL},

    /*521*/ {"参数矩阵", NULL, 0, 0, MAKELONG(0x04, 0), 0, NULL},

    /*522*/ {"观察宽度", "观察时的宽度", 0, 0, SDT_FLOAT, 0, NULL},
    /*523*/ {"观察高度", "观察时的高度", 0, 0, SDT_FLOAT, 0, NULL},
    /*524*/ {"Z轴近点", "观察时Z轴最近点", 0, 0, SDT_FLOAT, 0, NULL},
    /*525*/ {"Z轴远点", "观察时Z轴最远点", 0, 0, SDT_FLOAT, 0, NULL},

    /*526*/ {"X轴最小值", "观察时X轴最小值", 0, 0, SDT_FLOAT, 0, NULL},
    /*527*/ {"X轴最大值", "观察时X轴最大值", 0, 0, SDT_FLOAT, 0, NULL},
    /*528*/ {"Y轴最小值", "观察时Y轴最小值", 0, 0, SDT_FLOAT, 0, NULL},
    /*529*/ {"Y轴最大值", "观察时Y轴最大值", 0, 0, SDT_FLOAT, 0, NULL},
    /*530*/ {"Z轴最小值", "观察时Z轴最小值", 0, 0, SDT_FLOAT, 0, NULL},
    /*531*/ {"Z轴最大值", "观察时Z轴最大值", 0, 0, SDT_FLOAT, 0, NULL},

    /*532*/ {"观察范围", "观察时y 轴方向的角度（弧度），就是观察范围夹角", 0, 0, SDT_FLOAT, 0, NULL},
    /*533*/ {"纵横比", "在视空间宽度除以高度", 0, 0, SDT_FLOAT, 0, NULL},
    /*534*/ {"前裁剪面位置", "前裁剪面到原点的距离", 0, 0, SDT_FLOAT, 0, NULL},
    /*535*/ {"后裁剪面位置", "后裁剪面到原点的距离", 0, 0, SDT_FLOAT, 0, NULL},

    /*536*/ {"前截面宽度", "前观察面的宽度", 0, 0, SDT_FLOAT, 0, NULL},
    /*537*/ {"前截面高度", "前观察面的高度", 0, 0, SDT_FLOAT, 0, NULL},
    /*538*/ {"前裁剪面位置", "前裁剪面到原点的距离", 0, 0, SDT_FLOAT, 0, NULL},
    /*539*/ {"后裁剪面位置", "后裁剪面到原点的距离", 0, 0, SDT_FLOAT, 0, NULL},

    /*540*/ {"平面", "指定平面", 0, 0, MAKELONG(0x05, 0), 0, NULL},

    /*541*/ {"轴向量", "指向任意轴向量", 0, 0, MAKELONG(0x02, 0), 0, NULL},
    /*542*/ {"转角", "绕着任意轴旋转的角度（单位是弧度）", 0, 0, SDT_FLOAT, 0, NULL},

    /*543*/ {"转角", "绕着X轴旋转的角度（单位是弧度）", 0, 0, SDT_FLOAT, 0, NULL},

    /*544*/ {"转角", "绕着Y轴旋转的角度（单位是弧度）", 0, 0, SDT_FLOAT, 0, NULL},

    /*545*/ {"转角", "绕着Z轴旋转的角度（单位是弧度）", 0, 0, SDT_FLOAT, 0, NULL},

    /*546*/ {"X轴缩放因子", "沿着X轴的缩放系数", 0, 0, SDT_FLOAT, 0, NULL},
    /*547*/ {"Y轴缩放因子", "沿着Y轴的缩放系数", 0, 0, SDT_FLOAT, 0, NULL},
    /*548*/ {"Z轴缩放因子", "沿着Z轴的缩放系数", 0, 0, SDT_FLOAT, 0, NULL},

    /*549*/ {"X轴偏移", "相对于原点沿着X轴的偏移", 0, 0, SDT_FLOAT, 0, NULL},
    /*550*/ {"Y轴偏移", "相对于原点沿着Y轴的偏移", 0, 0, SDT_FLOAT, 0, NULL},
    /*551*/ {"Z轴偏移", "相对于原点沿着Z轴的偏移", 0, 0, SDT_FLOAT, 0, NULL},

    /*552*/ {"空间点坐标", NULL, 0, 0, MAKELONG(0x02, 0), 0, NULL},
    /*553*/ {"平面法线", NULL, 0, 0, MAKELONG(0x02, 0), 0, NULL},

    /*554*/ {"空间点坐标", NULL, 0, 0, MAKELONG(0x02, 0), 0, NULL},
    /*555*/ {"空间点坐标", NULL, 0, 0, MAKELONG(0x02, 0), 0, NULL},
    /*556*/ {"空间点坐标", NULL, 0, 0, MAKELONG(0x02, 0), 0, NULL},

    /*557*/ {"直线起点向量", NULL, 0, 0, MAKELONG(0x02, 0), 0, NULL},
    /*558*/ {"直线终点向量", NULL, 0, 0, MAKELONG(0x02, 0), 0, NULL},

    /*559*/ {"模型", "指定将要清空的模型。", 0, 0, MAKELONG(0x1A, 0), 0, NULL},
    /*560*/ {"输入邻接信息", "要被清空的模型的邻接信息。", 0, 0, SDT_INT, 0, AS_RECEIVE_ARRAY_DATA},
    /*561*/ {"清空后的模型", "返回清空后的模型。", 0, 0, MAKELONG(0x1A, 0), 0, NULL},
    /*562*/ {"输出邻接信息", "清空后的模型的邻接信息。", 0, 0, SDT_INT, 0, AS_RECEIVE_VAR_ARRAY},

    /*563*/ {"第一个顶点地址", "顶点数组的地址，顶点的第一个向量需要是顶点的位置坐标。", 0, 0, MAKELONG(0x02, 0), 0, NULL},
    /*564*/ {"顶点个数", "指定顶点的个数。", 0, 0, SDT_INT, 0, NULL},
    /*565*/ {"顶点大小", "顶点大小（以字节为单位）。因顶点中有很多附加数据，如法向量、纹理坐标等，计算边界范围不需要这些数据，所以，需要知道跳过多少数据才能找到下一个顶点的坐标。", 0, 0, SDT_INT, 0, NULL},
    /*566*/ {"最小点", "返回边界盒的左下角。", 0, 0, MAKELONG(0x02, 0), 0, NULL},
    /*567*/ {"最大点", "返回边界盒的右上角。", 0, 0, MAKELONG(0x02, 0), 0, NULL},

    /*568*/ {"第一个顶点地址", "顶点数组的地址，顶点的第一个向量需要是顶点的位置坐标。", 0, 0, MAKELONG(0x02, 0), 0, NULL},
    /*569*/ {"顶点个数", "指定顶点的个数。", 0, 0, SDT_INT, 0, NULL},
    /*570*/ {"顶点大小", "顶点大小（以字节为单位）。因顶点中有很多附加数据，如法向量、纹理坐标等，计算边界范围不需要这些数据，所以，需要知道跳过多少数据才能找到下一个顶点的坐标。", 0, 0, SDT_INT, 0, NULL},
    /*571*/ {"中心坐标", "返回边界球的中心坐标。", 0, 0, MAKELONG(0x02, 0), 0, NULL},
    /*572*/ {"半径", "返回边界球的半径。", 0, 0, SDT_FLOAT, 0, AS_RECEIVE_VAR},

    /*573*/ {"模型", "规格化的模型。", 0, 0, MAKELONG(0x1A, 0), 0, NULL},
    /*574*/ {"邻接信息", "如果提供了邻接信息，则重复的顶点会被忽略；如果没有邻接信息，重复的顶点也会被重复计算。另外一点更加重要，需要计算法向量的模型对象的顶点格式必须包含“法线”标志。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY | AS_RECEIVE_ARRAY_DATA},

    /*575*/ {"模型", "给定的模型。", 0, 0, MAKELONG(0x1A, 0), 0, NULL},
    /*576*/ {"纹理阶段索引", "表现纹理阶段的索引。", 0, 0, SDT_INT, 0, NULL},
    /*577*/ {"正切数据索引", "提供使用正切数据的索引。", 0, 0, SDT_INT, 0, NULL},
    /*578*/ {"副法线索引", "提供使用副法线数据的索引。", 0, 0, SDT_INT, 0, NULL},
    /*579*/ {"环绕标志", "参数为0表示不环绕，为1表示在U和V方向上环绕。", 0, 0, SDT_INT, 0, NULL},
    /*580*/ {"邻接信息", NULL, 0, 0, SDT_INT, 0, AS_RECEIVE_ARRAY_DATA},

    /*581*/ {"模型", "表示要转换到一个带的模型。", 0, 0, MAKELONG(0x1A, 0), 0, NULL},
    /*582*/ {"属性标识", "表示要转换模型子集的属性标识。", 0, 0, SDT_INT, 0, NULL},
    /*583*/ {"索引缓冲创建选项", "指定索引缓冲创建选项。", 0, 0, SDT_INT, 0, NULL},
    /*584*/ {"索引缓冲", "表示包含带的索引缓冲。", 0, 0, MAKELONG(0x18, 0), 0, NULL},
    /*585*/ {"顶点个数", "索引缓冲的顶点个数。", 0, 0, SDT_INT, 0, AS_RECEIVE_VAR},

    /*586*/ {"模型", "表示要转换到一个带的模型。", 0, 0, MAKELONG(0x1A, 0), 0, NULL},
    /*587*/ {"属性标识", "表示要转换模型子集的属性标识。", 0, 0, SDT_INT, 0, NULL},
    /*588*/ {"索引缓冲创建选项", "指定索引缓冲创建选项。", 0, 0, SDT_INT, 0, NULL},
    /*589*/ {"索引缓冲", "表示包含带的索引缓冲。", 0, 0, MAKELONG(0x18, 0), 0, NULL},
    /*590*/ {"顶点个数", "索引缓冲的顶点个数。", 0, 0, SDT_INT, 0, AS_RECEIVE_VAR},
    /*591*/ {"每个带三角形数量", "每个带包含的三角形数量的数组。", 0, 0, SDT_INT, 0, AS_RECEIVE_VAR_ARRAY},
    /*592*/ {"带数量", "索引缓冲和相应的带长数组中包含的单独带的数量。", 0, 0, SDT_INT, 0, AS_RECEIVE_VAR},

    /*593*/ {"三角形数量", "模型中的三角形数量，必须指定一个大于0的数。", 0, 0, SDT_INT, 0, NULL},
    /*594*/ {"顶点数量", "顶点数量，必须指定一个大于0的数。", 0, 0, SDT_INT, 0, NULL},
    /*595*/ {"创建标志", "指定模型的创建标志，为“模型创建标志”常量值之一或组合。", 0, 0, SDT_INT, 0, NULL},
    /*596*/ {"顶点成员数组", "顶点成员数组。描述创建模型的顶点格式，该参数必须直接映射到灵活顶点格式。", 0, 0, MAKELONG(0x16, 0), 0, AS_RECEIVE_ARRAY_DATA},
    /*597*/ {"设备", "与模型相关联的设备对象。", 0, 0, MAKELONG(0x09, 0), 0, NULL},
    /*598*/ {"模型", "要创建的模型对象。", 0, 0, MAKELONG(0x1A, 0), 0, NULL},

    /*599*/ {"三角形数量", "模型中的三角形数量，必须指定一个大于0的数。", 0, 0, SDT_INT, 0, NULL},
    /*600*/ {"顶点数量", "顶点数量，必须指定一个大于0的数。", 0, 0, SDT_INT, 0, NULL},
    /*601*/ {"创建标志", "指定模型的创建标志，为“模型创建标志”常量值之一或组合。", 0, 0, SDT_INT, 0, NULL},
    /*602*/ {"灵活顶点格式", "模型的灵活顶点格式，为“灵活顶点格式”常量值之一或组合。本命令不支持“变换后位置”格式。", 0, 0, SDT_INT, 0, NULL},
    /*603*/ {"设备", "与模型相关联的设备对象。", 0, 0, MAKELONG(0x09, 0), 0, NULL},
    /*604*/ {"模型", "要创建的模型对象。", 0, 0, MAKELONG(0x1A, 0), 0, NULL},

    /*605*/ {"模型", "要检测是否相交的模型。", 0, 0, MAKELONG(0x1A, 0), 0, NULL},
    /*606*/ {"射线发出点", "指定射线的原点坐标。", 0, 0, MAKELONG(0x02, 0), 0, NULL},
    /*607*/ {"射线方向", "指定射线的发射方向。", 0, 0, MAKELONG(0x02, 0), 0, NULL},
    /*608*/ {"三角形索引", "如果相交，则为与射线发出点距离最近的三角形的索引。", 0, 0, SDT_INT, 0, AS_RECEIVE_VAR},
    /*609*/ {"重心坐标U分量", "如果相交，则为与射线相交的三角形中的重心坐标U分量。", 0, 0, SDT_FLOAT, 0, AS_DEFAULT_VALUE_IS_EMPTY | AS_RECEIVE_VAR},
    /*610*/ {"重心坐标V分量", "如果相交，则为与射线相交的三角形中的重心坐标V分量。", 0, 0, SDT_FLOAT, 0, AS_DEFAULT_VALUE_IS_EMPTY | AS_RECEIVE_VAR},
    /*611*/ {"距离", "如果相交，则为从射线发出点到相交点的距离。", 0, 0, SDT_FLOAT, 0, AS_DEFAULT_VALUE_IS_EMPTY | AS_RECEIVE_VAR},
    /*612*/ {"所有相交信息", "如果相交，则为所有相交信息数组。", 0, 0, MAKELONG(0x45, 0), 0, AS_DEFAULT_VALUE_IS_EMPTY | AS_RECEIVE_VAR_ARRAY},

    /*613*/ {"模型文件", "要载入的模型文件（.x）。", 0, 0, SDT_TEXT, 0, NULL},
    /*614*/ {"创建标志", "指定模型的创建标志，为“模型创建标志”常量值之一或组合。", 0, 0, SDT_INT, 0, NULL},
    /*615*/ {"设备", "指定与模型相关联的设备。", 0, 0, MAKELONG(0x09, 0), 0, NULL},
    /*616*/ {"邻接信息", "返回模型的邻接信息。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY | AS_RECEIVE_VAR_ARRAY},
    /*617*/ {"材质数据", "返回模型的材质数据。", 0, 0, MAKELONG(0x0C, 0), 0, AS_DEFAULT_VALUE_IS_EMPTY | AS_RECEIVE_VAR_ARRAY},
    /*618*/ {"纹理文件名", NULL, 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY | AS_RECEIVE_VAR_ARRAY},
    /*619*/ {"模型", "载入的模型对象。", 0, 0, MAKELONG(0x1A, 0), 0, NULL},

    /*620*/ {NULL, NULL, 0, 0, SDT_INT, 0, NULL},

    /*621*/ {"模型文件", "模型文件名。", 0, 0, SDT_TEXT, 0, NULL},
    /*622*/ {"模型", "要保存的模型对象。", 0, 0, MAKELONG(0x1A, 0), 0, NULL},
    /*623*/ {"邻接信息", "模型邻接信息。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY | AS_RECEIVE_ARRAY_DATA},
    /*624*/ {"材质数据", "要保存到模型文件的材质数据。", 0, 0, MAKELONG(0x0C, 0), 0, AS_RECEIVE_ARRAY_DATA},
    /*625*/ {"材质数量", "要保存到模型文件的材质数量。", 0, 0, SDT_INT, 0, NULL},
    /*626*/ {"格式", "保存到模型文件时使用的格式。为以下值之一：0、二进制格式；1、文本格式；2、压缩格式。默认值为0。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*627*/ {"纹理文件数组", "要保存到模型文件的纹理文件数组。", 0, 0, SDT_TEXT, 0, AS_RECEIVE_ARRAY_DATA},

    /*628*/ {"选项", "建立模型的选项。可以是一个或多个“模型创建标志”常量数据类型中的值。", 0, 0, MAKELONG(0x42, 0), 0, NULL},
    /*629*/ {"定义", "指定的输出模型的顶点格式。", 0, 0, MAKELONG(0x16, 0), 0, AS_RECEIVE_VAR_ARRAY},
    /*630*/ {"设备", "输出模型在哪个设备中。", 0, 0, MAKELONG(0x09, 0), 0, NULL},
    /*631*/ {"输出模型", "输出的模型。", 0, 0, MAKELONG(0x1A, 0), 0, NULL},

    /*632*/ {"选项", "建立模型的选项。可以是一个或多个“模型创建标志”常量数据类型中的值。", 0, 0, MAKELONG(0x42, 0), 0, NULL},
    /*633*/ {"灵活顶点", "指定的灵活顶点格式。", 0, 0, MAKELONG(0x3C, 0), 0, NULL},
    /*634*/ {"设备", "输出模型在哪个设备中。", 0, 0, MAKELONG(0x09, 0), 0, NULL},
    /*635*/ {"输出模型", "输出的模型。", 0, 0, MAKELONG(0x1A, 0), 0, NULL},

    /*636*/ {"标识符", "属性表标识符，用于标识哪个面被画。", 0, 0, SDT_INT, 0, NULL},

    /*637*/ {"属性表", "存放属性表。", 0, 0, MAKELONG(0x44, 0), 0, AS_RECEIVE_VAR_ARRAY},

    /*638*/ {"顶点定义", "存放顶点定义。", 0, 0, MAKELONG(0x16, 0), 0, AS_RECEIVE_VAR_ARRAY},

    /*639*/ {"设备", "存放设备。", 0, 0, MAKELONG(0x09, 0), 0, NULL},

    /*640*/ {"索引缓冲", "存放索引缓冲。", 0, 0, MAKELONG(0x18, 0), 0, NULL},

    /*641*/ {"顶点缓冲", "存放顶点缓冲。", 0, 0, MAKELONG(0x13, 0), 0, NULL},

    /*642*/ {"数据", "属性数据。", 0, 0, SDT_BIN, 0, NULL},

    /*643*/ {"大小", "要读数据的大小。单位为字节。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*644*/ {"数据", "属性数据。", 0, 0, SDT_BIN, 0, AS_RECEIVE_VAR},

    /*645*/ {"大小", "要读数据的大小。单位为字节。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*646*/ {"数据", "属性数据。", 0, 0, SDT_BIN, 0, AS_RECEIVE_VAR},

    /*647*/ {"大小", "要读数据的大小。单位为字节。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*648*/ {"数据", "属性数据。", 0, 0, SDT_BIN, 0, AS_RECEIVE_VAR},

};

#ifdef _DEBUG    // 这里是为了确认参数序号是否正确, 成员数比最后一个序号大1就是正确
const int dbg_cmd_arg_count__ = sizeof(g_argumentInfo_ogrelib_global_var) / sizeof(g_argumentInfo_ogrelib_global_var[0]);
#endif


#define OGRELIB_DEF_CMDINFO(_index, _szName, _szEgName, _szExplain, _shtCategory, _wState, _dtRetValType, _wReserved, _shtUserLevel, _shtBitmapIndex, _shtBitmapCount, _nArgCount, _pBeginArgInfo) \
    { _szName, ______E_FNENAME(_szEgName), _szExplain, _shtCategory, _wState, _dtRetValType, _wReserved, _shtUserLevel, _shtBitmapIndex, _shtBitmapCount, _nArgCount, _pBeginArgInfo },


// 易语言每个命令的定义, 会把信息显示在支持库列表里, 这里每个成员都是详细的描述一个命令的信息
CMD_INFO g_cmdInfo_ogrelib_global_var[] = 
{
    OGRELIB_DEF(OGRELIB_DEF_CMDINFO)
};

int g_cmdInfo_ogrelib_global_var_count = sizeof(g_cmdInfo_ogrelib_global_var) / sizeof(g_cmdInfo_ogrelib_global_var[0]);

#endif

