#include "..\include_ewizard_header.h"

// 调用格式: _SDT_NULL 定义模板变量, 命令说明: "设置模板变量的值，模板变量可以用作自动程序替换。可以在模板易语言程序中使用模板变量与模板变量条件表达式，具体使用方法为：\r\n\r\n一、在子程序代码中使用模板变量条件表达式：\r\n    在相应程序语句备注中加上以下指令以定义生成条件（符合该条件此段程序块将被包含到生成后的易语言程序中，否则会被自动抛弃）：\r\n    1、$如果(条件) 或 $if(条件)，后者为前者的英文方式。\r\n       条件可以定义多个，只要有一个条件为真整体即为真。如：“$如果(条件1)$如果(条件2)”\r\n    2、$否则(条件) 或 $else(条件)\r\n    3、$否则 或 $else\r\n    4、$结束 或 $end\r\n  其中，“条件”参数可以使用以下表达式之一：\r\n    1、模板变量                如果指定模板变量已被定义则为真，否则为假。\r\n    2、!模板变量               如果指定模板变量未被定义则为真，否则为假。\r\n    3、模板变量 = \"xxx\"        如果指定模板变量的内容等于指定文本内容则为真，否则为假，其中“xxx”为任意文本。\r\n    4、模板变量 = xxx          如果指定模板变量的内容等于指定数值则为真，否则为假，其中“xxx”为任意数值。\r\n    5、模板变量1 = 模板变量2   如果模板变量1的内容等于模板变量2则为真，否则为假。\r\n    6、模板变量 <> \"xxx\"       如果指定模板变量的内容不等于指定文本内容则为真，否则为假，其中“xxx”为任意文本。\r\n    7、模板变量 <> xxx          如果指定模板变量的内容不等于指定数值则为真，否则为假，其中“xxx”为任意数值。\r\n    8、模板变量1 <> 模板变量2  如果模板变量1的内容不等于模板变量2则为真，否则为假。\r\n  注意：必须确保模板变量条件语句代码块完整，不交叉跨越分枝及循环语句，否则将导致系统出错。另外不要将模板变量条件表达式设置在分枝和循环代码块的首尾语句上，最好单独设置在一条空白语句上，该空白语句在生成后会被自动删除。\r\n  简例1，其中“使用数据源1”和“使用数据源2”为模板变量：\r\n    ※备注：$如果 (使用数据源1)\r\n    数据源1.刷新 ()\r\n    ※备注：$否则 (使用数据源2)\r\n    数据源2.刷新 ()\r\n    ※备注：$否则\r\n    数据源3.刷新 ()\r\n    ※备注：$结束\r\n  简例2，其中“欲使用数据源”为模板变量：\r\n    ※备注：$如果 (欲使用数据源 = \"1\")\r\n    数据源1.刷新 ()\r\n    ※备注：$否则 (欲使用数据源 = \"2\")\r\n    数据源2.刷新 ()\r\n    ※备注：$否则\r\n    数据源3.刷新 ()\r\n    ※备注：$结束\r\n\r\n二、在其它位置使用模板变量条件表达式：\r\n    在任何其它程序项目的备注中加入以下指令以定义生成条件（符合该条件此程序项将被包含到生成后的易语言程序中，否则会被自动抛弃）：\r\n    $如果(条件) 或 $if(条件)，后者为前者的英文方式，有关此指令的具体解释见前。\r\n  简例，在模板易语言程序的“数据源1”窗口组件的备注中加入“$如果 (使用数据源1)”指令即可达到只有定义了“使用数据源1”模板变量，在最终生成的易语言程序中才包含此组件的目的：\r\n    条件可以定义多个，只要有一个条件为真整体即为真。如：“$如果(条件1)$如果(条件2)”\r\n\r\n三、在子程序代码中使用模板变量替换参数：\r\n  在程序语句中使用如下格式的参数会在生成易语言程序时自动被替换：\r\n    \"$(模板变量名)\"\r\n  简例，如果“变量1”模板变量的内容为文本型数据“单位1”，则下述语句\r\n    程序变量 = \"$(变量1)\"\r\n  在最终程序生成后将变为：\r\n    程序变量 = \"单位1\"\r\n  而当“变量1”模板变量的内容为数值型数据123时，则此语句将被替换为：\r\n    程序变量 = 123\r\n"
// 参数<1>: 模板变量名称 SDT_TEXT, 参数说明: NULL
// 参数<2>: [模板变量值 _SDT_ALL], 参数说明: "只能是系统基本数据类型数据。如果本参数被省略，默认值为空文本"
EWIZARD_EXTERN_C void ewizard_SetTemplateVar_10_ewizard(PMDATA_INF pRetData, INT nArgCount, PMDATA_INF pArgInf)
{
    LPSTR    arg1 = pArgInf[0].m_pText;
    PVOID    arg2 = pArgInf[1].m_pByte;

}

