#if !defined(__E_STATIC_LIB)
#include "include_krnln_header.h"

// 系统核心支持库命令信息
// 自动生成于 2026-01-04 15:09:00

// 参数信息数组
static ARG_INFO g_argumentInfo_krnln_global_var[] = 
{
    // 1=参数名称, 2=参数详细说明, 3=指定图标索引, 4=图标数目
    // 5=参数类型, 6=参数默认值, 7=参数标志
    // 命令 0: 如果
    /*0000*/ {"条件", "本条件值的结果决定下一步程序执行位置。", 0, 0, SDT_BOOL, 0, NULL},
    // 命令 1: 如果真
    /*0001*/ {"条件", "本条件值的结果决定下一步程序执行位置。", 0, 0, SDT_BOOL, 0, NULL},
    // 命令 2: 判断
    /*0002*/ {"条件", "本条件值的结果决定下一步程序执行位置。", 0, 0, SDT_BOOL, 0, NULL},
    // 命令 3: 判断循环首
    /*0003*/ {"条件", "本条件值的结果决定下一步程序执行位置。", 0, 0, SDT_BOOL, 0, NULL},
    // 命令 6: 循环判断尾
    /*0004*/ {"条件", "本条件值的结果决定下一步程序执行位置。", 0, 0, SDT_BOOL, 0, NULL},
    // 命令 7: 计次循环首
    /*0005*/ {"循环次数", "本数值指定执行计次循环体内所有命令的次数，必须大于等于零。", 0, 0, SDT_INT, 0, NULL},
    /*0006*/ {"已循环次数记录变量", "本数值型变量用作记录当前循环首已经被进入过的次数（从 1 开始），程序可以直接取用此变量中的值。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY | AS_RECEIVE_VAR},
    // 命令 9: 变量循环首
    /*0007*/ {"变量起始值", "定义循环变量的起始数值。", 0, 0, SDT_INT, 1, NULL},
    /*0008*/ {"变量目标值", "定义循环变量的目标数值，在循环首部如果发现变量值已超出此目标值时将跳出循环。", 0, 0, SDT_INT, 0, NULL},
    /*0009*/ {"变量递增值", "每次执行到循环尾部时都将把此值加入到循环变量中去，此值可为正数或负数，如为正数则递增，为负数则递减。", 0, 0, SDT_INT, 1, NULL},
    /*0010*/ {"循环变量", "本数值型变量将用作控制循环执行次数，在循环尾部将自动递增或递减该变量内的数值。如果被省略，命令将自动使用内部临时变量。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY | AS_RECEIVE_VAR},
    // 命令 13: 返回
    /*0011*/ {"返回到调用方的值", "", 0, 0, _SDT_ALL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 15: 相乘
    /*0012*/ {"被乘数", "", 0, 0, SDT_FLOAT, 0, NULL},
    /*0013*/ {"乘数", "", 0, 0, SDT_FLOAT, 0, NULL},
    // 命令 16: 相除
    /*0014*/ {"被除数", "", 0, 0, SDT_FLOAT, 0, NULL},
    /*0015*/ {"除数", "", 0, 0, SDT_FLOAT, 0, NULL},
    // 命令 17: 整除
    /*0016*/ {"被除数", "", 0, 0, SDT_FLOAT, 0, NULL},
    /*0017*/ {"除数", "", 0, 0, SDT_FLOAT, 0, NULL},
    // 命令 18: 求余数
    /*0018*/ {"被除数", "", 0, 0, SDT_FLOAT, 0, NULL},
    /*0019*/ {"除数", "", 0, 0, SDT_FLOAT, 0, NULL},
    // 命令 19: 相加
    /*0020*/ {"被加数或文本或字节集", "", 0, 0, _SDT_ALL, 0, NULL},
    /*0021*/ {"加数或文本或字节集", "", 0, 0, _SDT_ALL, 0, NULL},
    // 命令 20: 相减
    /*0022*/ {"被减数", "", 0, 0, SDT_FLOAT, 0, NULL},
    /*0023*/ {"减数", "", 0, 0, SDT_FLOAT, 0, NULL},
    // 命令 21: 负
    /*0024*/ {"数值", "", 0, 0, SDT_FLOAT, 0, NULL},
    // 命令 22: 取符号
    /*0025*/ {"欲取其符号的数值", "", 0, 0, SDT_FLOAT, 0, NULL},
    // 命令 23: 取绝对值
    /*0026*/ {"欲取其绝对值的数值", "", 0, 0, SDT_FLOAT, 0, NULL},
    // 命令 24: 取整
    /*0027*/ {"欲取整的小数", "", 0, 0, SDT_FLOAT, 0, NULL},
    // 命令 25: 绝对取整
    /*0028*/ {"欲取整的小数", "", 0, 0, SDT_FLOAT, 0, NULL},
    // 命令 26: 四舍五入
    /*0029*/ {"欲被四舍五入的数值", "", 0, 0, SDT_FLOAT, 0, NULL},
    /*0030*/ {"被舍入的位置", "如果大于0，表示小数点右边应保留的位数；如果等于0，表示舍入到整数；如果小于0，表示小数点左边舍入到的位置。例如：四舍五", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 27: 求次方
    /*0031*/ {"欲求次方数值", "参数值指定欲求其某次方的数值。", 0, 0, SDT_FLOAT, 0, NULL},
    /*0032*/ {"次方数", "参数值指定对欲求次方数值的运算指数。", 0, 0, SDT_FLOAT, 0, NULL},
    // 命令 28: 求平方根
    /*0033*/ {"欲求其平方根的数值", "参数值如果小于零将导致计算错误。", 0, 0, SDT_FLOAT, 0, NULL},
    // 命令 29: 求正弦
    /*0034*/ {"欲进行计算的角", "所使用单位为弧度。为了将角度转换成弧度，请将角度乘以 #pi / 180。为了将弧度转换成角度，请将弧度乘以 180 /", 0, 0, SDT_FLOAT, 0, NULL},
    // 命令 30: 求余弦
    /*0035*/ {"欲进行计算的角", "所使用单位为弧度。为了将角度转换成弧度，请将角度乘以 #pi / 180。为了将弧度转换成角度，请将弧度乘以 180 /", 0, 0, SDT_FLOAT, 0, NULL},
    // 命令 31: 求正切
    /*0036*/ {"欲进行计算的角", "所使用单位为弧度。为了将角度转换成弧度，请将角度乘以 #pi / 180。为了将弧度转换成角度，请将弧度乘以 180 /", 0, 0, SDT_FLOAT, 0, NULL},
    // 命令 32: 求反正切
    /*0037*/ {"欲求其反正切值的数值", "", 0, 0, SDT_FLOAT, 0, NULL},
    // 命令 33: 求自然对数
    /*0038*/ {"欲求其自然对数的数值", "", 0, 0, SDT_FLOAT, 0, NULL},
    // 命令 34: 求反对数
    /*0039*/ {"欲求其反对数的数值", "如果参数值超过 709.782712893，将导致计算溢出。", 0, 0, SDT_FLOAT, 0, NULL},
    // 命令 35: 是否运算正确
    /*0040*/ {"欲校验的计算结果", "", 0, 0, SDT_FLOAT, 0, NULL},
    // 命令 36: 置随机数种子
    /*0041*/ {"欲置入的种子数值", "如果省略本参数，将默认使用当前计算机系统的时钟值。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 37: 取随机数
    /*0042*/ {"欲取随机数的最小值", "参数必须大于或等于零。本参数如果被省略，默认为 0 。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0043*/ {"欲取随机数的最大值", "参数必须大于或等于零。本参数如果被省略，默认为无限。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 38: 等于
    /*0044*/ {"被比较值", "", 0, 0, _SDT_ALL, 0, NULL},
    /*0045*/ {"比较值", "比较值的数据类型必须与“被比较值”一致或者可以相互转换。", 0, 0, _SDT_ALL, 0, NULL},
    // 命令 39: 不等于
    /*0046*/ {"被比较值", "", 0, 0, _SDT_ALL, 0, NULL},
    /*0047*/ {"比较值", "比较值的数据类型必须与“被比较值”一致或者可以相互转换。", 0, 0, _SDT_ALL, 0, NULL},
    // 命令 40: 小于
    /*0048*/ {"被比较值", "被比较值的数据类型可以为数值型、日期时间型、文本型。", 0, 0, _SDT_ALL, 0, NULL},
    /*0049*/ {"比较值", "比较值的数据类型可以为数值型、日期时间型、文本型，且必须与“被比较值”一致或者可以相互转换。", 0, 0, _SDT_ALL, 0, NULL},
    // 命令 41: 大于
    /*0050*/ {"被比较值", "被比较值的数据类型可以为数值型、日期时间型、文本型。", 0, 0, _SDT_ALL, 0, NULL},
    /*0051*/ {"比较值", "比较值的数据类型可以为数值型、日期时间型、文本型，且必须与“被比较值”一致或者可以相互转换。", 0, 0, _SDT_ALL, 0, NULL},
    // 命令 42: 小于或等于
    /*0052*/ {"被比较值", "被比较值的数据类型可以为数值型、日期时间型、文本型。", 0, 0, _SDT_ALL, 0, NULL},
    /*0053*/ {"比较值", "比较值的数据类型可以为数值型、日期时间型、文本型，且必须与“被比较值”一致或者可以相互转换。", 0, 0, _SDT_ALL, 0, NULL},
    // 命令 43: 大于或等于
    /*0054*/ {"被比较值", "被比较值的数据类型可以为数值型、日期时间型、文本型。", 0, 0, _SDT_ALL, 0, NULL},
    /*0055*/ {"比较值", "比较值的数据类型可以为数值型、日期时间型、文本型，且必须与“被比较值”一致或者可以相互转换。", 0, 0, _SDT_ALL, 0, NULL},
    // 命令 44: 近似等于
    /*0056*/ {"被比较文本", "", 0, 0, SDT_TEXT, 0, NULL},
    /*0057*/ {"比较文本", "", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 45: 并且
    /*0058*/ {"逻辑值一", "", 0, 0, SDT_BOOL, 0, NULL},
    /*0059*/ {"逻辑值二", "", 0, 0, SDT_BOOL, 0, NULL},
    // 命令 46: 或者
    /*0060*/ {"逻辑值一", "", 0, 0, SDT_BOOL, 0, NULL},
    /*0061*/ {"逻辑值二", "", 0, 0, SDT_BOOL, 0, NULL},
    // 命令 47: 取反
    /*0062*/ {"被反转的逻辑值", "", 0, 0, SDT_BOOL, 0, NULL},
    // 命令 48: 位取反
    /*0063*/ {"欲取反的数值", "", 0, 0, SDT_INT, 0, NULL},
    // 命令 49: 位与
    /*0064*/ {"位运算数值一", "", 0, 0, SDT_INT, 0, NULL},
    /*0065*/ {"位运算数值二", "", 0, 0, SDT_INT, 0, NULL},
    // 命令 50: 位或
    /*0066*/ {"位运算数值一", "", 0, 0, SDT_INT, 0, NULL},
    /*0067*/ {"位运算数值二", "", 0, 0, SDT_INT, 0, NULL},
    // 命令 51: 位异或
    /*0068*/ {"位运算数值一", "", 0, 0, SDT_INT, 0, NULL},
    /*0069*/ {"位运算数值二", "", 0, 0, SDT_INT, 0, NULL},
    // 命令 52: 左移
    /*0070*/ {"欲移动的整数", "", 0, 0, SDT_INT, 0, NULL},
    /*0071*/ {"欲移动的位数", "", 0, 0, SDT_INT, 0, NULL},
    // 命令 53: 右移
    /*0072*/ {"欲移动的整数", "", 0, 0, SDT_INT, 0, NULL},
    /*0073*/ {"欲移动的位数", "", 0, 0, SDT_INT, 0, NULL},
    // 命令 54: 合并整数
    /*0074*/ {"用作合并的整数1", "", 0, 0, SDT_INT, 0, NULL},
    /*0075*/ {"用作合并的整数2", "", 0, 0, SDT_INT, 0, NULL},
    // 命令 55: 合并短整数
    /*0076*/ {"用作合并的整数1", "", 0, 0, SDT_INT, 0, NULL},
    /*0077*/ {"用作合并的整数2", "", 0, 0, SDT_INT, 0, NULL},
    // 命令 56: 赋值
    /*0078*/ {"被赋值的变量或变量数组", "", 0, 0, _SDT_ALL, 0, AS_RECEIVE_VAR | AS_RECEIVE_ALL_TYPE_DATA},
    /*0079*/ {"用作赋于的值或资源", "", 0, 0, _SDT_ALL, 0, AS_RECEIVE_ALL_TYPE_DATA},
    // 命令 57: 连续赋值
    /*0080*/ {"用作赋于的值或资源", "", 0, 0, _SDT_ALL, 0, AS_RECEIVE_ALL_TYPE_DATA},
    /*0081*/ {"被赋值的变量或变量数组", "", 0, 0, _SDT_ALL, 0, AS_RECEIVE_VAR | AS_RECEIVE_ALL_TYPE_DATA},
    // 命令 58: 重定义数组
    /*0082*/ {"欲重定义的数组变量", "", 0, 0, _SDT_ALL, 0, AS_RECEIVE_VAR | AS_RECEIVE_ALL_TYPE_DATA},
    /*0083*/ {"是否保留以前的内容", "", 0, 0, SDT_BOOL, 0, NULL},
    /*0084*/ {"数组对应维的上限值", "", 0, 0, SDT_INT, 0, AS_RECEIVE_ALL_TYPE_DATA},
    // 命令 59: 取数组成员数
    /*0085*/ {"欲检查的变量", "参数值指定欲检查其成员数目的数组变量或者欲检查其是否为数组的变量。", 0, 0, _SDT_ALL, 0, AS_RECEIVE_VAR | AS_RECEIVE_ALL_TYPE_DATA},
    // 命令 60: 取数组下标
    /*0086*/ {"欲取某维最大下标的数组变量", "", 0, 0, _SDT_ALL, 0, AS_RECEIVE_VAR | AS_RECEIVE_ALL_TYPE_DATA},
    /*0087*/ {"欲取其最大下标的维", "1 表示第一维，2 表示第二维，如此类推。如果省略本参数，默认值是 1。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 61: 复制数组
    /*0088*/ {"复制到的数组变量", "", 0, 0, _SDT_ALL, 0, AS_RECEIVE_VAR | AS_RECEIVE_ALL_TYPE_DATA},
    /*0089*/ {"待复制的数组数据", "", 0, 0, _SDT_ALL, 0, AS_RECEIVE_ALL_TYPE_DATA},
    // 命令 62: 加入成员
    /*0090*/ {"欲加入成员的数组变量", "", 0, 0, _SDT_ALL, 0, AS_RECEIVE_VAR | AS_RECEIVE_ALL_TYPE_DATA},
    /*0091*/ {"欲加入的成员数据", "参数值所指定成员数据的数据类型必须能够与第一个参数所指定的数组变量相匹配。", 0, 0, _SDT_ALL, 0, AS_RECEIVE_ALL_TYPE_DATA},
    // 命令 63: 插入成员
    /*0092*/ {"欲插入成员的数组变量", "", 0, 0, _SDT_ALL, 0, AS_RECEIVE_VAR | AS_RECEIVE_ALL_TYPE_DATA},
    /*0093*/ {"欲插入的位置", "位置值从 1 开始，如果小于 1 或大于第一个参数所指定数组变量的成员数目 + 1，将不会插入任何数据。", 0, 0, SDT_INT, 0, AS_RECEIVE_ALL_TYPE_DATA},
    /*0094*/ {"欲插入的成员数据", "参数值所指定成员数据的数据类型必须能够与第一个参数所指定的数组变量相匹配。", 0, 0, _SDT_ALL, 0, AS_RECEIVE_ALL_TYPE_DATA},
    // 命令 64: 删除成员
    /*0095*/ {"欲删除成员的数组变量", "", 0, 0, _SDT_ALL, 0, AS_RECEIVE_VAR | AS_RECEIVE_ALL_TYPE_DATA},
    /*0096*/ {"欲删除的位置", "位置值从 1 开始，如果小于 1 或大于第一个参数所指定数组变量的成员数目，将不会删除任何数据。", 0, 0, SDT_INT, 0, AS_RECEIVE_ALL_TYPE_DATA},
    /*0097*/ {"欲删除的成员数目", "本参数如果被省略，默认为 1 。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 65: 清除数组
    /*0098*/ {"欲删除成员的数组变量", "", 0, 0, _SDT_ALL, 0, AS_RECEIVE_VAR | AS_RECEIVE_ALL_TYPE_DATA},
    // 命令 66: 数组排序
    /*0099*/ {"数值数组变量", "", 0, 0, _SDT_ALL, 0, AS_RECEIVE_VAR | AS_RECEIVE_ALL_TYPE_DATA},
    /*0100*/ {"排序方向是否为从小到大", "如果参数值为真，排序方向为从小到大，否则为从大到小。如果本参数被省略，默认值为真。", 0, 0, SDT_BOOL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 67: 数组清零
    /*0101*/ {"数值数组变量", "", 0, 0, _SDT_ALL, 0, AS_RECEIVE_VAR | AS_RECEIVE_ALL_TYPE_DATA},
    // 命令 68: 取命令行
    /*0102*/ {"存放被取回命令行文本的数组变量", "在命令执行完毕后，本变量数组内被顺序填入在启动易程序时附加在其可执行文件名后面的以空格分隔的命令行文本段。变量数组内原有", 0, 0, SDT_TEXT, 0, AS_RECEIVE_VAR | AS_RECEIVE_ALL_TYPE_DATA},
    // 命令 71: 读环境变量
    /*0103*/ {"环境变量名称", "", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 72: 写环境变量
    /*0104*/ {"环境变量名称", "", 0, 0, SDT_TEXT, 0, NULL},
    /*0105*/ {"欲写入内容", "", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 73: 取所有发音
    /*0106*/ {"欲取其拼音的汉字", "只取用文本首部的第一个汉字，如果该文本首部不为国标汉字，命令将返回一个成员数目为 0 的空文本数组。", 0, 0, SDT_TEXT, 0, AS_RECEIVE_ALL_TYPE_DATA},
    // 命令 74: 取发音数目
    /*0107*/ {"欲取其发音数目的汉字", "只取用文本首部的第一个汉字，如果该文本首部不为国标汉字，命令将返回 0。", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 75: 取拼音
    /*0108*/ {"欲取其拼音编码的汉字", "只取用文本首部的第一个汉字，如果该文本首部不为国标汉字，命令将返回一个空文本。", 0, 0, SDT_TEXT, 0, NULL},
    /*0109*/ {"欲取拼音编码的索引", "应该在 1 到该汉字的发音数目之间。汉字的发音数目可以使用“取发音数目”命令取得。", 0, 0, SDT_INT, 1, NULL},
    // 命令 76: 取声母
    /*0110*/ {"欲取其拼音编码的汉字", "只取用文本首部的第一个汉字，如果该文本首部不为国标汉字，命令将返回一个空文本。", 0, 0, SDT_TEXT, 0, NULL},
    /*0111*/ {"欲取拼音编码的索引", "应该在 1 到该汉字的发音数目之间。汉字的发音数目可以使用“取发音数目”命令取得。", 0, 0, SDT_INT, 1, NULL},
    // 命令 77: 取韵母
    /*0112*/ {"欲取其拼音编码的汉字", "只取用文本首部的第一个汉字，如果该文本首部不为国标汉字，命令将返回一个空文本。", 0, 0, SDT_TEXT, 0, NULL},
    /*0113*/ {"欲取拼音编码的索引", "应该在 1 到该汉字的发音数目之间。汉字的发音数目可以使用“取发音数目”命令取得。", 0, 0, SDT_INT, 1, NULL},
    // 命令 78: 发音比较
    /*0114*/ {"待比较文本一", "", 0, 0, SDT_TEXT, 0, NULL},
    /*0115*/ {"待比较文本二", "", 0, 0, SDT_TEXT, 0, NULL},
    /*0116*/ {"是否支持南方音", "为真则支持南方音。如果支持南方音，比较时将认为所有相近的发音都相同。如： n 和 l、 z 和 zh、 ie 和 ue ", 0, 0, SDT_BOOL, 0, NULL},
    /*0117*/ {"是否为模糊比较", "本参数为真时，当待比较文本一的发音在待比较文本二的首部被包容时即认为比较通过。如果被省略，默认值为假。", 0, 0, SDT_BOOL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 79: 输入字比较
    /*0118*/ {"待比较拼音输入字", "拼音输入字有以下三类：", 0, 0, SDT_TEXT, 0, NULL},
    /*0119*/ {"待比较普通文本", "", 0, 0, SDT_TEXT, 0, NULL},
    /*0120*/ {"是否支持南方音", "为真则支持南方音。如果支持南方音，比较时将认为所有相近的发音都相同。如： n 和 l、 z 和 zh、 ie 和 ue ", 0, 0, SDT_BOOL, 0, NULL},
    /*0121*/ {"拼音输入字类别", "参数值可以为以下常量之一： 1、#首拼及全拼； 2、#双拼； 3、#自动判别。 如果省略本参数，默认为“#自动判别”。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 80: 取文本长度
    /*0122*/ {"文本数据", "参数值指定欲检查其长度的文本数据。", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 81: 取文本左边
    /*0123*/ {"欲取其部分的文本", "", 0, 0, SDT_TEXT, 0, NULL},
    /*0124*/ {"欲取出字符的数目", "", 0, 0, SDT_INT, 0, NULL},
    // 命令 82: 取文本右边
    /*0125*/ {"欲取其部分的文本", "", 0, 0, SDT_TEXT, 0, NULL},
    /*0126*/ {"欲取出字符的数目", "", 0, 0, SDT_INT, 0, NULL},
    // 命令 83: 取文本中间
    /*0127*/ {"欲取其部分的文本", "", 0, 0, SDT_TEXT, 0, NULL},
    /*0128*/ {"起始取出位置", "1为首位置，2为第2个位置，如此类推。", 0, 0, SDT_INT, 0, NULL},
    /*0129*/ {"欲取出字符的数目", "", 0, 0, SDT_INT, 0, NULL},
    // 命令 84: 字符
    /*0130*/ {"欲取其字符的字符代码", "", 0, 0, SDT_BYTE, 0, NULL},
    // 命令 85: 取代码
    /*0131*/ {"欲取字符代码的文本", "", 0, 0, SDT_TEXT, 0, NULL},
    /*0132*/ {"欲取其代码的字符位置", "1为首位置，2为第2个位置，如此类推。如果本参数被省略，默认为首位置。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 86: 寻找文本
    /*0133*/ {"被搜寻的文本", "", 0, 0, SDT_TEXT, 0, NULL},
    /*0134*/ {"欲寻找的文本", "", 0, 0, SDT_TEXT, 0, NULL},
    /*0135*/ {"起始搜寻位置", "位置值从 1 开始。如果本参数被省略，默认为 1 。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0136*/ {"是否不区分大小写", "为真不区分大小写，为假区分。", 0, 0, SDT_BOOL, 0, NULL},
    // 命令 87: 倒找文本
    /*0137*/ {"被搜寻的文本", "", 0, 0, SDT_TEXT, 0, NULL},
    /*0138*/ {"欲寻找的文本", "", 0, 0, SDT_TEXT, 0, NULL},
    /*0139*/ {"起始搜寻位置", "位置值从 1 开始。如果本参数被省略，默认为从被搜寻文本的尾部开始。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0140*/ {"是否不区分大小写", "为真不区分大小写，为假区分。", 0, 0, SDT_BOOL, 0, NULL},
    // 命令 88: 到大写
    /*0141*/ {"欲变换的文本", "", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 89: 到小写
    /*0142*/ {"欲变换的文本", "", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 90: 到全角
    /*0143*/ {"欲变换的文本", "", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 91: 到半角
    /*0144*/ {"欲变换的文本", "", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 92: 到文本
    /*0145*/ {"待转换的数据", "参数值只能为数值、逻辑值、字节集、日期时间或数值型数组。", 0, 0, _SDT_ALL, 0, AS_RECEIVE_ALL_TYPE_DATA},
    // 命令 93: 删首空
    /*0146*/ {"欲删除空格的文本", "", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 94: 删尾空
    /*0147*/ {"欲删除空格的文本", "", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 95: 删首尾空
    /*0148*/ {"欲删除空格的文本", "", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 96: 删全部空
    /*0149*/ {"欲删除空格的文本", "", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 97: 文本替换
    /*0150*/ {"欲被替换的文本", "", 0, 0, SDT_TEXT, 0, NULL},
    /*0151*/ {"起始替换位置", "替换的起始位置，1为首位置，2为第2个位置，如此类推。", 0, 0, SDT_INT, 0, NULL},
    /*0152*/ {"替换长度", "", 0, 0, SDT_INT, 0, NULL},
    /*0153*/ {"用作替换的文本", "如果本参数被省略，则删除文本中的指定部分。", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 98: 子文本替换
    /*0154*/ {"欲被替换的文本", "", 0, 0, SDT_TEXT, 0, NULL},
    /*0155*/ {"欲被替换的子文本", "", 0, 0, SDT_TEXT, 0, NULL},
    /*0156*/ {"用作替换的子文本", "如果本参数被省略，默认为空文本。", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0157*/ {"进行替换的起始位置", "参数值指定被替换子文本的起始搜索位置。如果省略，默认从 1 开始。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0158*/ {"替换进行的次数", "参数值指定对子文本进行替换的次数。如果省略，默认进行所有可能的替换。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0159*/ {"是否区分大小写", "为真区分大小写，为假不区分。", 0, 0, SDT_BOOL, 0, NULL},
    // 命令 99: 取空白文本
    /*0160*/ {"重复次数", "", 0, 0, SDT_INT, 0, NULL},
    // 命令 100: 取重复文本
    /*0161*/ {"重复次数", "", 0, 0, SDT_INT, 0, NULL},
    /*0162*/ {"待重复文本", "该文本将用于建立返回的文本。如果为空，将返回一个空文本。", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 101: 文本比较
    /*0163*/ {"待比较文本一", "", 0, 0, SDT_TEXT, 0, NULL},
    /*0164*/ {"待比较文本二", "", 0, 0, SDT_TEXT, 0, NULL},
    /*0165*/ {"是否区分大小写", "为真区分大小写，为假不区分。", 0, 0, SDT_BOOL, 0, NULL},
    // 命令 102: 分割文本
    /*0166*/ {"待分割文本", "如果参数值是一个长度为零的文本，则返回一个空数组，即没有任何成员的数组。", 0, 0, SDT_TEXT, 0, AS_RECEIVE_ALL_TYPE_DATA},
    /*0167*/ {"用作分割的文本", "参数值用于标识子文本边界。如果被省略，则默认使用半角逗号字符作为分隔符。如果是一个长度为零的文本，则返回的数组仅包含一个", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY | AS_RECEIVE_ALL_TYPE_DATA},
    /*0168*/ {"要返回的子文本数目", "如果被省略，则默认返回所有的子文本。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 103: 指针到文本
    /*0169*/ {"内存文本指针", "本参数提供指向一个以零字符结束的文本串内存指针值。", 0, 0, SDT_INT, 0, NULL},
    // 命令 104: 文本到UTF8
    /*0170*/ {"待转换的文本", "提供待转换到UTF8格式的文本。", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 105: UTF8到文本
    /*0171*/ {"待转换的UTF8文本数据", "提供待转换到通常文本的UTF8文本数据。", 0, 0, SDT_BIN, 0, NULL},
    // 命令 106: 文本到UTF16
    /*0172*/ {"待转换的文本", "提供待转换到UTF16格式的文本。", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 107: UTF16到文本
    /*0173*/ {"待转换的UTF16文本数据", "提供待转换到通常文本的UTF16文本数据。", 0, 0, SDT_BIN, 0, NULL},
    // 命令 108: 到时间
    /*0174*/ {"欲转换的文本", "文本内容应按以下格式之一提供，年份后的时间部分可以省略：", 0, 0, _SDT_ALL, 0, NULL},
    // 命令 109: 增减时间
    /*0175*/ {"时间", "", 0, 0, SDT_DATE_TIME, 0, NULL},
    /*0176*/ {"被增加部分", "参数值指定增加或减少时间的哪一部分，可以为以下常量： 1、#年份； 2、#季度； 3、#月份； 4、#周； 5、#日； ", 0, 0, SDT_INT, 0, NULL},
    /*0177*/ {"增加值", "相对于被增加部分的增加或减少数值。", 0, 0, SDT_INT, 0, NULL},
    // 命令 110: 取时间间隔
    /*0178*/ {"时间1", "", 0, 0, SDT_DATE_TIME, 0, NULL},
    /*0179*/ {"时间2", "", 0, 0, SDT_DATE_TIME, 0, NULL},
    /*0180*/ {"取间隔部分", "参数值指定取时间间隔的单位，可以为以下常量： 1、#年份； 2、#季度； 3、#月份； 4、#周； 5、#日； 6、#小", 0, 0, SDT_INT, 0, NULL},
    // 命令 111: 取某月天数
    /*0181*/ {"年份", "参数值从 100 到 9999。", 0, 0, SDT_INT, 0, NULL},
    /*0182*/ {"月份", "参数值从 1 到 12。", 0, 0, SDT_INT, 0, NULL},
    // 命令 112: 时间到文本
    /*0183*/ {"欲转换到文本的时间", "", 0, 0, SDT_DATE_TIME, 0, NULL},
    /*0184*/ {"转换部分", "参数值可以为以下常量： 1、#全部转换； 2、#日期部分； 3、#时间部分。如果省略了本参数，默认为“#全部转换”。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 113: 取时间部分
    /*0185*/ {"欲取其部分的时间", "", 0, 0, SDT_DATE_TIME, 0, NULL},
    /*0186*/ {"欲取的时间部分", "参数值可以为以下常量： 1、#年份； 2、#季度； 3、#月份； 4、#自年首周数； 5、#日； 6、#小时； 7、#分", 0, 0, SDT_INT, 0, NULL},
    // 命令 114: 取年份
    /*0187*/ {"时间", "", 0, 0, SDT_DATE_TIME, 0, NULL},
    // 命令 115: 取月份
    /*0188*/ {"时间", "", 0, 0, SDT_DATE_TIME, 0, NULL},
    // 命令 116: 取日
    /*0189*/ {"时间", "", 0, 0, SDT_DATE_TIME, 0, NULL},
    // 命令 117: 取星期几
    /*0190*/ {"时间", "", 0, 0, SDT_DATE_TIME, 0, NULL},
    // 命令 118: 取小时
    /*0191*/ {"时间", "", 0, 0, SDT_DATE_TIME, 0, NULL},
    // 命令 119: 取分钟
    /*0192*/ {"时间", "", 0, 0, SDT_DATE_TIME, 0, NULL},
    // 命令 120: 取秒
    /*0193*/ {"时间", "", 0, 0, SDT_DATE_TIME, 0, NULL},
    // 命令 121: 指定时间
    /*0194*/ {"年", "", 0, 0, SDT_INT, 0, NULL},
    /*0195*/ {"月", "如果本参数被省略，默认为 1 月。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0196*/ {"日", "如果本参数被省略，默认为 1 日。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0197*/ {"小时", "如果本参数被省略，默认为 0 时。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0198*/ {"分钟", "如果本参数被省略，默认为 0 分钟。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0199*/ {"秒", "如果本参数被省略，默认为 0 秒。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 123: 置现行时间
    /*0200*/ {"欲设置的时间", "", 0, 0, SDT_DATE_TIME, 0, NULL},
    // 命令 124: 取日期
    /*0201*/ {"时间", "", 0, 0, SDT_DATE_TIME, 0, NULL},
    // 命令 125: 取时间
    /*0202*/ {"时间", "", 0, 0, SDT_DATE_TIME, 0, NULL},
    // 命令 126: 到数值
    /*0203*/ {"待转换的文本或数值", "", 0, 0, _SDT_ALL, 0, NULL},
    // 命令 127: 数值到大写
    /*0204*/ {"欲转换形式的数值", "", 0, 0, SDT_FLOAT, 0, NULL},
    /*0205*/ {"是否转换为简体", "如果参数值为假，则转换为繁体。", 0, 0, SDT_BOOL, 0, NULL},
    // 命令 128: 数值到金额
    /*0206*/ {"欲转换形式的数值", "", 0, 0, SDT_FLOAT, 0, NULL},
    /*0207*/ {"是否转换为简体", "如果参数值为假，则转换为繁体。", 0, 0, SDT_BOOL, 0, NULL},
    // 命令 129: 数值到格式文本
    /*0208*/ {"欲转换为文本的数值", "", 0, 0, SDT_FLOAT, 0, NULL},
    /*0209*/ {"小数保留位数", "如果大于0，表示小数点右边应四舍五入保留的位数；如果等于0，表示舍入到整数；如果小于0，表示小数点左边舍入到的位置。例如", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0210*/ {"是否进行千分位分隔", "如果参数值为真，数值文本的每个千分位上都将被自动插入一个逗号进行分隔。", 0, 0, SDT_BOOL, 0, NULL},
    // 命令 130: 取十六进制文本
    /*0211*/ {"欲取进制文本的数值", "", 0, 0, SDT_INT, 0, NULL},
    // 命令 131: 取八进制文本
    /*0212*/ {"欲取进制文本的数值", "", 0, 0, SDT_INT, 0, NULL},
    // 命令 132: 到字节
    /*0213*/ {"待转换的文本或数值", "", 0, 0, _SDT_ALL, 0, NULL},
    // 命令 133: 到短整数
    /*0214*/ {"待转换的文本或数值", "", 0, 0, _SDT_ALL, 0, NULL},
    // 命令 134: 到整数
    /*0215*/ {"待转换的文本或数值", "", 0, 0, _SDT_ALL, 0, NULL},
    // 命令 135: 到长整数
    /*0216*/ {"待转换的文本或数值", "", 0, 0, _SDT_ALL, 0, NULL},
    // 命令 136: 到小数
    /*0217*/ {"待转换的文本或数值", "", 0, 0, _SDT_ALL, 0, NULL},
    // 命令 137: 十六进制
    /*0218*/ {"十六进制文本常量", "本参数指定欲转换为整数的十六进制文本常量。", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 138: 二进制
    /*0219*/ {"二进制文本常量", "本参数指定欲转换为整数的二进制文本常量。", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 139: 反转整数字节序
    /*0220*/ {"待反转的整数值", "提供所欲反转其字节序的整数值。", 0, 0, SDT_INT, 0, NULL},
    // 命令 140: 取字节集长度
    /*0221*/ {"字节集数据", "参数值指定欲检查其长度的字节集数据。", 0, 0, SDT_BIN, 0, NULL},
    // 命令 141: 到字节集
    /*0222*/ {"欲转换为字节集的数据", "参数值只能为基本数据类型数据或数值型数组。", 0, 0, _SDT_ALL, 0, AS_RECEIVE_ALL_TYPE_DATA},
    // 命令 142: 取字节集数据
    /*0223*/ {"欲取出其中数据的字节集", "", 0, 0, SDT_BIN, 0, NULL},
    /*0224*/ {"欲取出数据的类型", "参数值可以为以下常量： 1、#字节型； 2、#短整数型； 3、#整数型； 4、#长整数型； 5、#小数型； 6、#双精度", 0, 0, SDT_INT, 0, NULL},
    /*0225*/ {"起始索引位置", "指定从字节集的什么地方开始取数据，索引值从1开始。如果被省略，默认为数值1。如果为本参数提供一个整数型变量，则命令执行后", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 143: 取字节集左边
    /*0226*/ {"欲取其部分的字节集", "", 0, 0, SDT_BIN, 0, NULL},
    /*0227*/ {"欲取出字节的数目", "", 0, 0, SDT_INT, 0, NULL},
    // 命令 144: 取字节集右边
    /*0228*/ {"欲取其部分的字节集", "", 0, 0, SDT_BIN, 0, NULL},
    /*0229*/ {"欲取出字节的数目", "", 0, 0, SDT_INT, 0, NULL},
    // 命令 145: 取字节集中间
    /*0230*/ {"欲取其部分的字节集", "", 0, 0, SDT_BIN, 0, NULL},
    /*0231*/ {"起始取出位置", "1为首位置，2为第2个位置，如此类推。", 0, 0, SDT_INT, 0, NULL},
    /*0232*/ {"欲取出字节的数目", "", 0, 0, SDT_INT, 0, NULL},
    // 命令 146: 寻找字节集
    /*0233*/ {"被搜寻的字节集", "", 0, 0, SDT_BIN, 0, NULL},
    /*0234*/ {"欲寻找的字节集", "", 0, 0, SDT_BIN, 0, NULL},
    /*0235*/ {"起始搜寻位置", "1为首位置，2为第2个位置，如此类推，如果被省略，则“寻找字节集”命令默认从首部开始，“倒找字节集”命令默认从尾部开始。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 147: 倒找字节集
    /*0236*/ {"被搜寻的字节集", "", 0, 0, SDT_BIN, 0, NULL},
    /*0237*/ {"欲寻找的字节集", "", 0, 0, SDT_BIN, 0, NULL},
    /*0238*/ {"起始搜寻位置", "1为首位置，2为第2个位置，如此类推，如果被省略，则“寻找字节集”命令默认从首部开始，“倒找字节集”命令默认从尾部开始。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 148: 字节集替换
    /*0239*/ {"欲替换其部分的字节集", "", 0, 0, SDT_BIN, 0, NULL},
    /*0240*/ {"起始替换位置", "替换的起始位置，1为首位置，2为第2个位置，如此类推。", 0, 0, SDT_INT, 0, NULL},
    /*0241*/ {"替换长度", "", 0, 0, SDT_INT, 0, NULL},
    /*0242*/ {"用作替换的字节集", "如果本参数被省略，则删除字节集中的指定部分。", 0, 0, SDT_BIN, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 149: 子字节集替换
    /*0243*/ {"欲被替换的字节集", "", 0, 0, SDT_BIN, 0, NULL},
    /*0244*/ {"欲被替换的子字节集", "", 0, 0, SDT_BIN, 0, NULL},
    /*0245*/ {"用作替换的子字节集", "如果省略本参数，则默认为空字节集。", 0, 0, SDT_BIN, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0246*/ {"进行替换的起始位置", "被替换子字节集的起始搜索位置。如果省略，默认从1开始。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0247*/ {"替换进行的次数", "对子字节集进行替换的次数。如果省略，默认进行所有可能的替换。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 150: 取空白字节集
    /*0248*/ {"零字节数目", "", 0, 0, SDT_INT, 0, NULL},
    // 命令 151: 取重复字节集
    /*0249*/ {"重复次数", "", 0, 0, SDT_INT, 0, NULL},
    /*0250*/ {"待重复的字节集", "该字节集将用于建立返回的字节集。如果为空，将返回一个空字节集。", 0, 0, SDT_BIN, 0, NULL},
    // 命令 152: 分割字节集
    /*0251*/ {"待分割字节集", "如果参数值是一个长度为零的字节集，则返回一个空数组，即没有任何成员的数组。", 0, 0, SDT_BIN, 0, AS_RECEIVE_ALL_TYPE_DATA},
    /*0252*/ {"用作分割的字节集", "用于标识子字节集边界。本参数如果被省略，则默认使用字节 0 作为分隔符。", 0, 0, SDT_BIN, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0253*/ {"要返回的子字节集数目", "如果被省略，则默认返回所有的子字节集。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 153: 指针到字节集
    /*0254*/ {"内存数据指针", "本参数提供指向一个内存地址的指针值。", 0, 0, SDT_INT, 0, NULL},
    /*0255*/ {"内存数据长度", "本参数提供该内存地址处所需获取的数据长度。", 0, 0, SDT_INT, 0, NULL},
    // 命令 154: 指针到整数
    /*0256*/ {"内存数据指针", "本参数提供指向一个内存地址的指针值。", 0, 0, SDT_INT, 0, NULL},
    // 命令 155: 指针到小数
    /*0257*/ {"内存数据指针", "本参数提供指向一个内存地址的指针值。", 0, 0, SDT_INT, 0, NULL},
    // 命令 156: 指针到双精度小数
    /*0258*/ {"内存数据指针", "本参数提供指向一个内存地址的指针值。", 0, 0, SDT_INT, 0, NULL},
    // 命令 157: 取字节集内整数
    /*0259*/ {"待处理的字节集", "提供待处理的字节集。", 0, 0, SDT_BIN, 0, NULL},
    /*0260*/ {"欲获取整数所处偏移", "提供所欲获取的整数值在字节集中的偏移位置。", 0, 0, SDT_INT, 0, NULL},
    /*0261*/ {"是否反转字节序", "指定是否将所获取整数值的字节序进行反转,譬如十六进制整数0x12345678,反转后将为0x78563412. 本功能在", 0, 0, SDT_BOOL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 158: 置字节集内整数
    /*0262*/ {"待处理的字节集", "提供待处理的字节集。", 0, 0, SDT_BIN, 0, NULL},
    /*0263*/ {"欲设置整数所处偏移", "提供所欲设置的整数值在字节集中的偏移位置。", 0, 0, SDT_INT, 0, NULL},
    /*0264*/ {"欲设置的整数值", "提供所欲设置的具体整数值。", 0, 0, SDT_INT, 0, NULL},
    /*0265*/ {"是否反转字节序", "指定是否将所设置整数的字节序进行反转,譬如十六进制整数0x12345678,反转后将为0x78563412. 本功能在与", 0, 0, SDT_BOOL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 159: 取磁盘总空间
    /*0266*/ {"磁盘驱动器字符", "类似“A”、“B”、“C”等，只取用给定文本的第一个字符。如果本参数被省略，默认使用当前驱动器。", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 160: 取磁盘剩余空间
    /*0267*/ {"磁盘驱动器字符", "类似“A”、“B”、“C”等，只取用给定文本的第一个字符。如果本参数被省略，默认使用当前驱动器。", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 161: 取磁盘卷标
    /*0268*/ {"磁盘驱动器字符", "类似“A”、“B”、“C”等，只取用给定文本的第一个字符。如果本参数被省略，默认使用当前驱动器。", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 162: 置磁盘卷标
    /*0269*/ {"磁盘驱动器字符", "类似“A”、“B”、“C”等，只取用给定文本的第一个字符。如果本参数被省略，默认使用当前驱动器。", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0270*/ {"欲置入的卷标文本", "", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 163: 改变驱动器
    /*0271*/ {"欲改变到的驱动器", "参数值指明一个存在的驱动器。类似“A”、“B”、“C”等，只取用给定文本的第一个字符。如果使用零长度的文本，则当前的驱动", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 164: 改变目录
    /*0272*/ {"欲改变到的目录", "参数值指明哪个目录将成为新的缺省目录，可能会包含驱动器。如果没有指定驱动器，则在当前的驱动器上改变缺省目录。", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 166: 创建目录
    /*0273*/ {"欲创建的目录名称", "", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 167: 删除目录
    /*0274*/ {"欲删除的目录名称", "该目录应实际存在，如果目录中存在文件或子目录，将被一并删除，因此使用本命令请千万慎重。", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 168: 复制文件
    /*0275*/ {"被复制的文件名", "", 0, 0, SDT_TEXT, 0, NULL},
    /*0276*/ {"复制到的文件名", "", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 169: 移动文件
    /*0277*/ {"被移动的文件", "", 0, 0, SDT_TEXT, 0, NULL},
    /*0278*/ {"移动到的位置", "", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 170: 删除文件
    /*0279*/ {"欲删除的文件名", "", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 171: 文件更名
    /*0280*/ {"欲更名的原文件或目录名", "", 0, 0, SDT_TEXT, 0, NULL},
    /*0281*/ {"欲更改为的现文件或目录名", "", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 172: 文件是否存在
    /*0282*/ {"欲测试的文件名称", "", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 173: 寻找文件
    /*0283*/ {"欲寻找的文件或目录名称", "可以使用多字符 (*) 和单字符 (?) 通配符来指定多重文件。在非首次寻找文件时，参数值必须为空或被省略。", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0284*/ {"欲寻找文件的属性", "参数值可以为以下常量值或其和： 1、#只读文件； 2、#隐藏文件； 4、#系统文件； 16、#子目录； 32、#存档文件", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 174: 取文件时间
    /*0285*/ {"文件名", "", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 175: 取文件尺寸
    /*0286*/ {"文件名", "", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 176: 取文件属性
    /*0287*/ {"文件名", "", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 177: 置文件属性
    /*0288*/ {"欲设置其属性的文件名称", "", 0, 0, SDT_TEXT, 0, NULL},
    /*0289*/ {"欲设置为的属性值", "参数值可以为以下常量值或其和： 1、#只读文件； 2、#隐藏文件； 4、#系统文件； 32、#存档文件 。通过将这些常量", 0, 0, SDT_INT, 0, NULL},
    // 命令 178: 取临时文件名
    /*0290*/ {"目录名", "如果省略本参数，默认将使用系统的标准临时目录。", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 179: 读入文件
    /*0291*/ {"文件名", "", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 180: 写到文件
    /*0292*/ {"文件名", "", 0, 0, SDT_TEXT, 0, NULL},
    /*0293*/ {"欲写入文件的数据", "", 0, 0, SDT_BIN, 0, NULL},
    // 命令 181: 打开文件
    /*0294*/ {"欲打开的文件名称", "", 0, 0, SDT_TEXT, 0, NULL},
    /*0295*/ {"打开方式", "参数值说明对文件的操作方式，如果省略本参数，默认为“#读写”。方式值可以为以下常量之一：", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0296*/ {"共享方式", "参数值指定限制其它进程操作此文件的方式。如果省略本参数，默认为“#无限制”。方式值可以为以下常量之一：", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 183: 关闭文件
    /*0297*/ {"欲关闭的文件号", "参数值指明欲关闭的文件号，该文件号由“打开文件”命令所返回。", 0, 0, SDT_INT, 0, NULL},
    // 命令 185: 锁住文件
    /*0298*/ {"欲加锁或解锁的文件号", "该文件号由“打开文件”命令所返回。", 0, 0, SDT_INT, 0, NULL},
    /*0299*/ {"欲加锁或解锁的位置", "位置值从 0 开始。", 0, 0, SDT_INT, 0, NULL},
    /*0300*/ {"欲加锁或解锁的长度", "", 0, 0, SDT_INT, 0, NULL},
    /*0301*/ {"加锁重试时间", "本参数指定加锁失败后反复进行重试的毫秒数。如果被省略，默认为 0 ，即一旦失败立即返回。如果参数值提供为 -1 ，则反复", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 186: 解锁文件
    /*0302*/ {"欲加锁或解锁的文件号", "该文件号由“打开文件”命令所返回。", 0, 0, SDT_INT, 0, NULL},
    /*0303*/ {"欲加锁或解锁的位置", "位置值从 0 开始。", 0, 0, SDT_INT, 0, NULL},
    /*0304*/ {"欲加锁或解锁的长度", "", 0, 0, SDT_INT, 0, NULL},
    // 命令 187: 移动读写位置
    /*0305*/ {"欲进行操作的文件号", "该文件号由“打开文件”命令所返回。", 0, 0, SDT_INT, 0, NULL},
    /*0306*/ {"起始移动位置", "参数值指定从文件中开始移动的位置。可以为以下常量之一：1、#文件首； 2、#文件尾； 3、#现行位置。如果本参数被省略，", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0307*/ {"移动距离", "参数值指定相对于起始移动位置的移动长度。", 0, 0, SDT_INT, 0, NULL},
    // 命令 188: 移到文件首
    /*0308*/ {"欲进行操作的文件号", "该文件号由“打开文件”命令所返回。", 0, 0, SDT_INT, 0, NULL},
    // 命令 189: 移到文件尾
    /*0309*/ {"欲进行操作的文件号", "该文件号由“打开文件”命令所返回。", 0, 0, SDT_INT, 0, NULL},
    // 命令 190: 读入字节集
    /*0310*/ {"欲读入数据的文件号", "该文件号由“打开文件”命令所返回。", 0, 0, SDT_INT, 0, NULL},
    /*0311*/ {"欲读入数据的长度", "", 0, 0, SDT_INT, 0, NULL},
    // 命令 191: 写出字节集
    /*0312*/ {"欲写出数据的文件号", "该文件号由“打开文件”命令所返回。", 0, 0, SDT_INT, 0, NULL},
    /*0313*/ {"欲写出的字节集数据", "", 0, 0, SDT_BIN, 0, NULL},
    // 命令 192: 读入文本
    /*0314*/ {"欲读入文本数据的文件号", "该文件号由“打开文件”命令所返回。", 0, 0, SDT_INT, 0, NULL},
    /*0315*/ {"欲读入文本数据的长度", "如果本参数被省略，默认读入文件中的所有文本数据。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 193: 写出文本
    /*0316*/ {"欲写出文本的文件号", "该文件号由“打开文件”命令所返回。", 0, 0, SDT_INT, 0, NULL},
    /*0317*/ {"欲写出的文本", "参数值如果不为文本类型数据，将自动进行转换，如果无法转换（即数据类型为字节集、子程序指针、库或用户自定义数据类型），则不", 0, 0, _SDT_ALL, 0, NULL},
    // 命令 194: 读入一行
    /*0318*/ {"欲读入文本数据的文件号", "该文件号由“打开文件”命令所返回。", 0, 0, SDT_INT, 0, NULL},
    // 命令 195: 写文本行
    /*0319*/ {"欲写出文本的文件号", "该文件号由“打开文件”命令所返回。", 0, 0, SDT_INT, 0, NULL},
    /*0320*/ {"欲写出的文本", "参数值如果不为文本类型数据，将自动进行转换，如果无法转换（即数据类型为字节集、子程序指针、库或用户自定义数据类型），则不", 0, 0, _SDT_ALL, 0, NULL},
    // 命令 196: 读入数据
    /*0321*/ {"欲读入数据的文件号", "该文件号由“打开文件”命令所返回。", 0, 0, SDT_INT, 0, NULL},
    /*0322*/ {"存放所读入数据的变量", "如果变量的数据类型为用户自定义或库定义数据类型，命令将会失败。", 0, 0, _SDT_ALL, 0, AS_RECEIVE_VAR | AS_RECEIVE_ALL_TYPE_DATA},
    // 命令 197: 写出数据
    /*0323*/ {"欲写出数据的文件号", "该文件号由“打开文件”命令所返回。", 0, 0, SDT_INT, 0, NULL},
    /*0324*/ {"欲写出的数据", "如果被写出数据的数据类型为用户自定义或库定义数据类型，命令将会失败。", 0, 0, _SDT_ALL, 0, AS_RECEIVE_ALL_TYPE_DATA},
    // 命令 198: 是否在文件尾
    /*0325*/ {"文件号", "参数值指明欲操作的文件号，该文件号必须由“打开文件”命令所返回。", 0, 0, SDT_INT, 0, NULL},
    /*0326*/ {"是否为判断文本已读完", "如果本参数值为真而且下一即将读入的字节为字节值 0 或 26 等文本终止标记符或者当前读写位置已处于该文件数据的尾部，命", 0, 0, SDT_BOOL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 199: 取读写位置
    /*0327*/ {"文件号", "参数值指明欲操作的文件号，该文件号必须由“打开文件”命令所返回。", 0, 0, SDT_INT, 0, NULL},
    // 命令 200: 取文件长度
    /*0328*/ {"文件号", "参数值指明欲操作的文件号，该文件号必须由“打开文件”命令所返回。", 0, 0, SDT_INT, 0, NULL},
    // 命令 201: 插入字节集
    /*0329*/ {"欲写出数据的文件号", "该文件号由“打开文件”命令所返回。", 0, 0, SDT_INT, 0, NULL},
    /*0330*/ {"欲写出的字节集数据", "", 0, 0, SDT_BIN, 0, NULL},
    // 命令 202: 插入文本
    /*0331*/ {"欲写出文本的文件号", "该文件号由“打开文件”命令所返回。", 0, 0, SDT_INT, 0, NULL},
    /*0332*/ {"欲写出的文本", "参数值如果不为文本类型数据，将自动进行转换，如果无法转换（即数据类型为字节集、子程序指针、库或用户自定义数据类型），则不", 0, 0, _SDT_ALL, 0, NULL},
    // 命令 203: 插入文本行
    /*0333*/ {"欲写出文本的文件号", "该文件号由“打开文件”命令所返回。", 0, 0, SDT_INT, 0, NULL},
    /*0334*/ {"欲写出的文本", "参数值如果不为文本类型数据，将自动进行转换，如果无法转换（即数据类型为字节集、子程序指针、库或用户自定义数据类型），则不", 0, 0, _SDT_ALL, 0, NULL},
    // 命令 204: 删除数据
    /*0335*/ {"文件号", "该文件号由“打开文件”命令所返回。", 0, 0, SDT_INT, 0, NULL},
    /*0336*/ {"欲删除数据的字节数", "", 0, 0, SDT_INT, 0, NULL},
    // 命令 205: 打开加密文件
    /*0337*/ {"欲打开的文件名称", "", 0, 0, SDT_TEXT, 0, NULL},
    /*0338*/ {"打开方式", "参数值说明对文件的操作方式，如果省略本参数，默认为“#读写”。方式值可以为以下常量之一：", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0339*/ {"共享方式", "参数值指定限制其它进程操作此文件的方式。如果省略本参数，默认为“#无限制”。方式值可以为以下常量之一：", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0340*/ {"文件密码", "如果即将打开的文件中不存在任何数据（即为空文件或将创建的新文件），本参数指定保护该文件时所将使用的密码，以后所有写入该文", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0341*/ {"明文区长度", "本参数指定从文件首部开始不希望被加密部分的长度，系统在读写此区域内的数据时，不会使用密码对其进行加解密操作。此参数用作将", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 206: 运行
    /*0342*/ {"欲运行的命令行", "", 0, 0, SDT_TEXT, 0, NULL},
    /*0343*/ {"是否等待程序运行完毕", "", 0, 0, SDT_BOOL, 0, NULL},
    /*0344*/ {"被运行程序窗口显示方式", "参数值可以为以下常量之一：1、#隐藏窗口； 2、#普通激活； 3、#最小化激活； 4、#最大化激活； 5、#普通不激活；", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 208: 置剪辑板文本
    /*0345*/ {"准备置入剪辑板的文本", "", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 216: 输入框
    /*0346*/ {"提示信息", "如果提示信息包含多行，可在各行之间用回车符 (即“字符 (13)”)、换行符 (即“字符 (10)”) 或回车换行符的组", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0347*/ {"窗口标题", "参数值指定显示在对话框标题栏中的文本。如果省略，默认为文本“请输入：”。", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0348*/ {"初始文本", "参数值指定初始设置到对话框输入文本框中的内容。", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0349*/ {"存放输入内容的变量", "参数值所指定的变量可以为数值或文本型，用于以不同的数据类型取回输入内容。", 0, 0, _SDT_ALL, 0, AS_RECEIVE_VAR},
    /*0350*/ {"输入方式", "参数值可以为以下常量值： 1、#输入文本； 2、#输入整数； 3、#输入小数； 4、#输入密码。如果省略本参数，默认为“", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0351*/ {"父窗口", "指定输入框的父窗口,可以是一个\"窗口\"类型数据或者一个整数型窗口句柄.如果被省略,默认为无.", 0, 0, _SDT_ALL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 217: 信息框
    /*0352*/ {"提示信息", "提示信息只能为文本、数值、逻辑值或日期时间。如果提示信息为文本且包含多行，可在各行之间用回车符 (即“字符 (13)”)", 0, 0, _SDT_ALL, 0, NULL},
    /*0353*/ {"按钮", "参数值由以下几组常量值组成，在将这些常量值相加以生成参数值时，每组值只能取用一个数字（第五组除外）：", 0, 0, SDT_INT, 0, NULL},
    /*0354*/ {"窗口标题", "参数值指定显示在对话框标题栏中的文本。如果省略，默认为文本“信息：”。", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0355*/ {"父窗口", "指定信息框的父窗口,可以是一个\"窗口\"类型数据或者一个整数型窗口句柄.如果被省略,默认为无.", 0, 0, _SDT_ALL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 222: 延时
    /*0356*/ {"欲等待的时间", "本参数指定欲暂停程序执行的时间，单位为毫秒。", 0, 0, SDT_INT, 0, NULL},
    // 命令 223: 取文本注册项
    /*0357*/ {"根目录", "可以为以下常量值之一： 1、#根类； 2、#现行设置； 3、#现行用户； 4、#本地机器； 5、#所有用户。", 0, 0, SDT_INT, 0, NULL},
    /*0358*/ {"全路径注册项名", "", 0, 0, SDT_TEXT, 0, NULL},
    /*0359*/ {"默认文本", "如果指定的注册表项不存在，将返回此默认文本。如果指定的注册表项不存在且本参数被省略，将返回一个长度为 0 的空文本。", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 224: 取数值注册项
    /*0360*/ {"根目录", "可以为以下常量值之一： 1、#根类； 2、#现行设置； 3、#现行用户； 4、#本地机器； 5、#所有用户。", 0, 0, SDT_INT, 0, NULL},
    /*0361*/ {"全路径注册项名", "", 0, 0, SDT_TEXT, 0, NULL},
    /*0362*/ {"默认数值", "如果指定的注册表项不存在，将返回此默认数值。如果指定的注册表项不存在且本参数被省略，将返回数值 0。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 225: 取字节集注册项
    /*0363*/ {"根目录", "可以为以下常量值之一： 1、#根类； 2、#现行设置； 3、#现行用户； 4、#本地机器； 5、#所有用户。", 0, 0, SDT_INT, 0, NULL},
    /*0364*/ {"全路径注册项名", "", 0, 0, SDT_TEXT, 0, NULL},
    /*0365*/ {"默认字节集", "如果指定的注册表项不存在，将返回此默认字节集。如果指定的注册表项不存在且本参数被省略，将返回空字节集。", 0, 0, SDT_BIN, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 226: 写注册项
    /*0366*/ {"根目录", "可以为以下常量值之一： 1、#根类； 2、#现行设置； 3、#现行用户； 4、#本地机器； 5、#所有用户。", 0, 0, SDT_INT, 0, NULL},
    /*0367*/ {"全路径注册项名", "", 0, 0, SDT_TEXT, 0, NULL},
    /*0368*/ {"欲写入值", "参数值指定欲写入到指定注册表项中的值，只能为数值、文本或者字节集，否则命令将失败。", 0, 0, _SDT_ALL, 0, NULL},
    // 命令 227: 删除注册项
    /*0369*/ {"根目录", "可以为以下常量值之一： 1、#根类； 2、#现行设置； 3、#现行用户； 4、#本地机器； 5、#所有用户。", 0, 0, SDT_INT, 0, NULL},
    /*0370*/ {"全路径注册项名", "", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 228: 注册项是否存在
    /*0371*/ {"根目录", "可以为以下常量值之一： 1、#根类； 2、#现行设置； 3、#现行用户； 4、#本地机器； 5、#所有用户。", 0, 0, SDT_INT, 0, NULL},
    /*0372*/ {"全路径注册项名", "", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 230: 快照
    /*0373*/ {"窗口句柄", "指定欲捕获其显示内容的窗口。如果被省略，默认为捕获屏幕显示内容。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0374*/ {"输出宽度", "指定图片的输出宽度。如果小于0，参数值指定的是最终图片输出宽度相对于所取得图片宽度的百分比（最小为10%）；如果等于0，", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0375*/ {"输出高度", "指定图片的输出高度。如果小于0，参数值指定的是最终图片输出高度相对于所取得图片高度的百分比（最小为10%）；如果等于0，", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 231: 读配置项
    /*0376*/ {"配置文件名", "指定配置文件的名称，通常以.ini作为文件名后缀。", 0, 0, SDT_TEXT, 0, NULL},
    /*0377*/ {"节名称", "包含欲读入配置项所处节的名称。", 0, 0, SDT_TEXT, 0, NULL},
    /*0378*/ {"配置项名称", "参数值指定欲读入配置项在其节中的名称。", 0, 0, SDT_TEXT, 0, NULL},
    /*0379*/ {"默认文本", "如果指定配置项不存在，将返回此默认文本。如果指定配置项不存在且本参数被省略，将返回空文本。", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 232: 写配置项
    /*0380*/ {"配置文件名", "指定配置文件的名称，通常以.ini作为文件名后缀。", 0, 0, SDT_TEXT, 0, NULL},
    /*0381*/ {"节名称", "包含欲写入配置项所处节的名称。", 0, 0, SDT_TEXT, 0, NULL},
    /*0382*/ {"配置项名称", "参数值指定欲写入配置项在其节中的名称。如果参数值被省略，则删除指定节及其下的所有配置项。", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0383*/ {"欲写入值", "参数值指定欲写入到指定配置项中的文本。如果参数值被省略，则删除所指定配置项。", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 233: 取配置节名
    /*0384*/ {"配置文件名", "指定配置文件的名称，通常以.ini作为文件名后缀。", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 235: 多文件对话框
    /*0385*/ {"标题", "指定文件打开对话框的标题，如果被省略，则默认为“请输入欲打开的文件：”。", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0386*/ {"过滤器", "过滤器文本由单个或多个成对的文本串组成，每对文本串的第一个描述显示形式，如：“文本文件（*.txt）”；第二个指定实际的", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0387*/ {"初始过滤器", "如果上一参数提供了有效的过滤器文本，则本参数用作指定初始的过滤器，0为第一个过滤器。如果被省略，则默认值为0。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0388*/ {"初始目录", "指定当打开对话框时所自动跳转到的目录，如果被省略，则默认为当前目录。", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0389*/ {"不改变目录", "指定在对话框关闭后是否自动返回到进入对话框前的文件目录，如果被省略，则默认值为假。", 0, 0, SDT_BOOL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0390*/ {"父窗口", "指定对话框的父窗口,可以是一个\"窗口\"类型数据或者一个整数型窗口句柄.如果被省略,默认为无.", 0, 0, _SDT_ALL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 236: 取程序名称
    /*0391*/ {"欲取的程序名称类型", "1:当前语句所处子程序名称; 2:当前语句所处程序集名称; 3:当前语句所处易语言程序的全路径文件名称(注意如果编译时易", 0, 0, SDT_INT, 0, NULL},
    // 命令 237: 交换变量
    /*0392*/ {"变量1", "欲将其内容交换到变量2的变量1。", 0, 0, _SDT_ALL, 0, AS_RECEIVE_VAR | AS_RECEIVE_ALL_TYPE_DATA},
    /*0393*/ {"变量2", "欲将其内容交换到变量1的变量2。", 0, 0, _SDT_ALL, 0, AS_RECEIVE_VAR | AS_RECEIVE_ALL_TYPE_DATA},
    // 命令 238: 强制交换变量
    /*0394*/ {"变量1", "欲将其内容交换到变量2的变量1。", 0, 0, _SDT_ALL, 0, AS_RECEIVE_VAR | AS_RECEIVE_ALL_TYPE_DATA},
    /*0395*/ {"变量2", "欲将其内容交换到变量1的变量2。", 0, 0, _SDT_ALL, 0, AS_RECEIVE_VAR | AS_RECEIVE_ALL_TYPE_DATA},
    // 命令 239: 取运行时数据类型
    /*0396*/ {"欲取其数据类型的数据", "欲取其运行时数据类型的数据。", 0, 0, _SDT_ALL, 0, NULL},
    // 命令 240: 宏
    /*0397*/ {"编译插件名称", "提供被安装到易语言系统目录的plugins子目录内的插件名称(不允许包括文件路径和后缀),譬如\"plugin1.dll\"", 0, 0, SDT_TEXT, 0, NULL},
    /*0398*/ {"相关常量参数", "顺序提供被编译插件使用的所有常量参数数据。", 0, 0, _SDT_ALL, 0, AS_RECEIVE_ALL_TYPE_DATA},
    // 命令 244: 取统一文本
    /*0399*/ {"待转换常量文本", "提供将被转换到Unicode字节集的常量文本。", 0, 0, SDT_TEXT, 0, NULL},
    /*0400*/ {"转换到宽文本", "本参数如果为真则转换到UTF-16宽字符文本,否则转换为UTF-8文本.本参数如果被省略,则默认值为真.", 0, 0, SDT_BOOL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0401*/ {"添加结束零字符", "本参数如果为真则在文本尾部添加结束零字符,为假则不添加.本参数如果被省略,则默认值为真.", 0, 0, SDT_BOOL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 245: 取统一文本长度
    /*0402*/ {"待转换常量文本", "提供将被转换到Unicode字节集的常量文本。", 0, 0, SDT_TEXT, 0, NULL},
    /*0403*/ {"转换到宽文本", "本参数如果为真则转换到UTF-16宽字符文本,否则转换为UTF-8文本.本参数如果被省略,则默认值为真.", 0, 0, SDT_BOOL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 246: 播放音乐
    /*0404*/ {"欲播放的音乐", "参数值可以为 .WAV、.MID 声音文件名称或相应格式的字节集声音数据、声音资源。", 0, 0, _SDT_ALL, 0, NULL},
    /*0405*/ {"是否循环播放", "为真表示指定音乐将被循环播放，否则仅只播放一次。如果本参数被省略，默认为仅播放一次。", 0, 0, SDT_BOOL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 248: 播放MID
    /*0406*/ {"播放次数", "为 -1 表示指定音乐将被循环播放，否则仅只播放指定的次数。如果本参数被省略，默认值为 1 。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0407*/ {"间隔时间", "指定 MIDI 音乐之间的播放间隔时间，单位为 0.1 秒。如果本参数被省略，默认值为 0 。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0408*/ {"欲播放的MIDI音乐", "参数值可以为 MIDI 声音文件名称或相应格式的字节集声音数据、声音资源。", 0, 0, _SDT_ALL, 0, AS_RECEIVE_ALL_TYPE_DATA},
    // 命令 249: 播放MP3
    /*0409*/ {"播放次数", "为 -1 表示指定音乐将被循环播放，否则仅只播放指定的次数。如果本参数被省略，默认值为 1 。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0410*/ {"欲播放的MP3文件名", "", 0, 0, SDT_TEXT, 0, AS_RECEIVE_ALL_TYPE_DATA},
    // 命令 250: 同步播放MP3
    /*0411*/ {"欲播放的MP3文件名", "", 0, 0, SDT_TEXT, 0, NULL},
    /*0412*/ {"起始播放位置", "指定MP3的起始播放百分比位置，此值范围应在0-100之间。如果被省略，默认值为零，即从首部起始播放。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0413*/ {"欲通知的反馈标签", "如果本参数提供了有效的标签组件，在MP3播放过程中，会同步不断地给该组件发送反馈事件通知，该事件的第一个参数提供现行播放", 0, 0, _SDT_ALL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0414*/ {"保留参数", "", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 254: 输出调试文本
    /*0415*/ {"准备输出的调试文本信息", "", 0, 0, _SDT_ALL, 0, NULL},
    // 命令 256: 检查
    /*0416*/ {"被校验的条件", "如果此条件不能成立，即参数值为假，易程序的执行将被暂停且警示。", 0, 0, SDT_BOOL, 0, NULL},
    // 命令 258: 载入
    /*0417*/ {"欲载入的窗口", "参数值指定欲载入的窗口。", 0, 0, _SDT_ALL, 0, NULL},
    /*0418*/ {"父窗口", "参数值指定欲载入窗口的父窗口，此窗口必须已经被载入。如果本参数被省略，表示无父窗口。如果窗口具有父窗口，其位置将永远位于", 0, 0, _SDT_ALL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0419*/ {"是否采用对话框方式", "参数值指定用户在对被载入窗口进行操作的同时是否允许同时对其他窗口进行操作，如果本参数值为真且被载入窗口的“可视”属性为真", 0, 0, SDT_BOOL, 0, NULL},
    // 命令 259: 选择
    /*0420*/ {"用作选择的逻辑值", "如果该值为真，将返回第一个待选择项，否则将返回第二个待选择项。", 0, 0, SDT_BOOL, 0, NULL},
    /*0421*/ {"待选择项一", "如果给定逻辑值为真，命令将返回本选择项。", 0, 0, _SDT_ALL, 0, NULL},
    /*0422*/ {"待选择项二", "如果给定逻辑值为假，命令将返回本选择项。", 0, 0, _SDT_ALL, 0, NULL},
    // 命令 260: 多项选择
    /*0423*/ {"索引值", "命令会根据本索引值来返回选择项列表中的某个值。如果索引值是 1，则命令会返回列表中的第 1 个选择项。如果索引值是 2，", 0, 0, SDT_INT, 0, NULL},
    /*0424*/ {"待选择项数据", "", 0, 0, _SDT_ALL, 0, NULL},
    // 命令 261: 是否为空
    /*0425*/ {"欲测试的参数变量", "", 0, 0, _SDT_ALL, 0, AS_RECEIVE_VAR | AS_RECEIVE_ALL_TYPE_DATA},
    // 命令 262: 是否已创建
    /*0426*/ {"欲被检查的窗口或窗口组件", "", 0, 0, _SDT_ALL, 0, NULL},
    // 命令 263: 取数据类型尺寸
    /*0427*/ {"欲取其尺寸的数据类型", "参数值可以为以下常量： 1、#字节型； 2、#短整数型； 3、#整数型； 4、#长整数型； 5、#小数型； 6、#双精度", 0, 0, SDT_INT, 0, NULL},
    // 命令 264: 取颜色值
    /*0428*/ {"红色", "数值范围从 0 到 255，表示颜色中的红色成份。", 0, 0, SDT_INT, 0, NULL},
    /*0429*/ {"绿色", "数值范围从 0 到 255，表示颜色中的绿色成份。", 0, 0, SDT_INT, 0, NULL},
    /*0430*/ {"蓝色", "数值范围从 0 到 255，表示颜色中的蓝色成份。", 0, 0, SDT_INT, 0, NULL},
    // 命令 266: 事件转移
    /*0431*/ {"组件一", "参数值指定欲将其事件转移的组件。如果该参数值指定的不是窗口内的组件，而是窗口本身，则不考虑“组件二”参数的设置情况，直接", 0, 0, _SDT_ALL, 0, NULL},
    /*0432*/ {"组件二", "参数值指定组件一事件转移到的目的组件，必须与组件一的类型相同且在同一窗口内，否则命令会失败。如果本参数被省略，将取消组件", 0, 0, _SDT_ALL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 267: 复制窗口组件
    /*0433*/ {"欲被复制的窗口组件", "参数值不能为窗口本身、窗口菜单项组件、选择夹窗口组件。", 0, 0, _SDT_ALL, 0, NULL},
    /*0434*/ {"存放新创建组件的变量", "该变量数据类型必须与被复制窗口组件数据类型完全一致，否则命令会失败。", 0, 0, _SDT_ALL, 0, AS_RECEIVE_VAR},
    // 命令 269: 载入图片
    /*0435*/ {"欲被载入的图片", "参数值可以为 .JPG、.GIF、.BMP、.DIB、.ICO、.CUR 等等被支持格式的图片数据、图片资源或图片文件名", 0, 0, _SDT_ALL, 0, NULL},
    // 命令 270: 卸载图片
    /*0436*/ {"图片号", "参数值必须为调用“载入图片”命令所返回的图片号。", 0, 0, SDT_INT, 0, NULL},
    // 命令 273: 写到内存
    /*0437*/ {"欲写到内存的数据", "参数值只能为基本数据类型数据或字节数组。", 0, 0, _SDT_ALL, 0, AS_RECEIVE_ALL_TYPE_DATA},
    /*0438*/ {"内存区域指针", "本参数提供欲写向内存区域首地址的指针值。", 0, 0, SDT_INT, 0, NULL},
    /*0439*/ {"内存区域尺寸", "本参数提供该内存区域的有效尺寸，如果欲写出数据超出此尺寸值，将被自动切除。参数值如果为 -1 ，则表示此内存区域尺寸不受", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 274: DLL命令调用转向
    /*0440*/ {"DLL库文件名", "指定欲调用DLL命令所处的DLL库全路径文件名，如果本参数为空文本或被省略，则取消上次调用本命令时所设置的信息，使其不再", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0441*/ {"调用命令名", "指定欲调用DLL命令在其所处DLL库文件中的名称。如果本参数为空文本或被省略，则当程序中下次调用DLL命令时将使用其程序", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 275: 置错误提示管理
    /*0442*/ {"用作进行错误提示的子程序", "注意该子程序必须接收两个参数，第一个参数为整数型，用作接收错误代码，第二个参数为文本型，用作接收详细错误文本。同时该子程", 0, 0, _SDT_ALL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 276: 置DLL装载目录
    /*0443*/ {"DLL装载目录", "本参数指定系统对DLL命令配置中DLL库文件的优先装载路径，如果被省略，则默认值为空文本。", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 277: 取组件名称
    /*0444*/ {"窗口组件", "", 0, 0, _SDT_ALL, 0, NULL},
    // 命令 278: 取对象类型
    /*0445*/ {"欲取类型的对象", "", 0, 0, _SDT_ALL, 0, NULL},
    // 命令 279: 寻找组件
    /*0446*/ {"父组件", "指定欲寻找组件的直接或间接父组件，可以为容器组件或窗口。", 0, 0, _SDT_ALL, 0, NULL},
    /*0447*/ {"名称前缀", "指定欲寻找组件的名称前缀，只有以此名称开头的组件才能符合要求。如果参数名以\"@\"字符开头,则进行精确名称查找(不包括该\"", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0448*/ {"类型", "指定欲寻找组件的类型名称，如果提供空文本，则表示无类型要求。如果本参数被省略，默认为空文本。", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0449*/ {"标记最小值", "指定欲寻找组件的标记的最小值，只有其“标记”属性转换到的数值大于或等于该值的组件才能符合要求。如果本参数被省略，默认为最", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0450*/ {"标记最大值", "指定欲寻找组件的标记的最大值，只有其“标记”属性转换到的数值小于或等于该值的组件才能符合要求。如果本参数被省略，默认为最", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 280: 取找到组件数目
    /*0451*/ {"组件寻找句柄", "由“寻找组件”命令所返回的寻找句柄。", 0, 0, SDT_INT, 0, NULL},
    // 命令 281: 取所找到组件
    /*0452*/ {"组件寻找句柄", "由“寻找组件”命令所返回的寻找句柄。", 0, 0, SDT_INT, 0, NULL},
    /*0453*/ {"组件索引位置", "本参数必须大于等于零且小于“取找到组件数目”所返回的寻找到组件数目。", 0, 0, SDT_INT, 0, NULL},
    // 命令 282: 清除组件寻找句柄
    /*0454*/ {"组件寻找句柄", "由“寻找组件”命令所返回的寻找句柄。", 0, 0, SDT_INT, 0, NULL},
    // 命令 283: 置入代码
    /*0455*/ {"代码数据", "欲置入到代码段中的机器指令码数据，可以是字节集数据或二进制文件名文本。", 0, 0, _SDT_ALL, 0, NULL},
    // 命令 284: 运行控制台程序
    /*0456*/ {"欲运行的命令行", "提供欲运行控制台程序的命令行文本。", 0, 0, SDT_TEXT, 0, NULL},
    /*0457*/ {"标准输出内容存放变量", "控制台程序在运行期间输出到标准输出设备的所有内容将被存放到此变量中。如果参数被省略，默认值为无。", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY | AS_RECEIVE_VAR},
    /*0458*/ {"错误输出内容存放变量", "控制台程序在运行期间输出到标准错误设备的所有内容将被存放到此变量中。如果参数被省略，默认值为无。", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY | AS_RECEIVE_VAR},
    /*0459*/ {"返回值存放变量", "控制台程序退出时所提供的返回值将被存放到此变量中。如果参数被省略，默认值为无。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY | AS_RECEIVE_VAR},
    // 命令 286: 条件宏是否存在
    /*0460*/ {"所欲检测的条件宏名", "提供欲检测其是否已经被定义的条件宏名。", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 290: 创建
    /*0461*/ {"欲创建数据库的文件名", "", 0, 0, SDT_TEXT, 0, NULL},
    /*0462*/ {"字段信息表", "参数数组值中顺序指定本数据库中所有字段的信息。", 0, 0, _SDT_ALL, 0, AS_RECEIVE_ALL_TYPE_DATA},
    // 命令 291: 打开
    /*0463*/ {"数据库文件名", "", 0, 0, SDT_TEXT, 0, NULL},
    /*0464*/ {"在程序中使用的别名", "别名为在后面的程序中引用本数据库时可使用的另一个名称。欲引用一个已经被打开的数据库可以使用该数据库本身的名称（数据库名称", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0465*/ {"是否只读", "参数值说明是否仅对数据库进行读操作，如果省略本参数，默认为假。", 0, 0, SDT_BOOL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0466*/ {"共享方式", "参数值指定在多用户环境中限制其它用户操作此数据库的方式。如果省略本参数，默认为“#无限制”。方式值可以为以下常量之一：", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0467*/ {"保留参数1", "本参数仅用作保留参数位置。", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0468*/ {"数据库密码", "本参数提供访问数据库时所需要的密码，如果该数据库没有被加密，请提供空文本。注意“?”（即单个问号）是一个特殊的密码文本，", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0469*/ {"索引文件表", "本参数的各参数值顺序指定本数据库的所有索引文件，它们将被同步打开，以便得到及时更新。", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY | AS_RECEIVE_ALL_TYPE_DATA},
    // 命令 292: 替换打开
    /*0470*/ {"数据库文件名", "", 0, 0, SDT_TEXT, 0, NULL},
    /*0471*/ {"在程序中使用的别名", "别名为在后面的程序中引用本数据库时可使用的另一个名称。欲引用一个已经被打开的数据库可以使用该数据库本身的名称（数据库名称", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0472*/ {"是否只读", "参数值说明是否仅对数据库进行读操作，如果省略本参数，默认为假。", 0, 0, SDT_BOOL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0473*/ {"共享方式", "参数值指定在多用户环境中限制其它用户操作此数据库的方式。如果省略本参数，默认为“#无限制”。方式值可以为以下常量之一：", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0474*/ {"保留参数1", "本参数仅用作保留参数位置。", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0475*/ {"数据库密码", "本参数提供访问数据库时所需要的密码，如果该数据库没有被加密，请提供空文本。注意“?”（即单个问号）是一个特殊的密码文本，", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0476*/ {"索引文件表", "本参数的各参数值顺序指定本数据库的所有索引文件，它们将被同步打开，以便得到及时更新。", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY | AS_RECEIVE_ALL_TYPE_DATA},
    // 命令 293: 置当前库
    /*0477*/ {"数据库别名或名称", "参数值指定一个已经被打开的数据库。", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 295: 关闭
    /*0478*/ {"数据库别名或名称", "参数值如果被省略，默认为关闭当前数据库。", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 298: 是否已打开
    /*0479*/ {"欲测试的数据库文件名", "", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 302: 取字段名
    /*0480*/ {"字段名称或位置", "参数值可以为一个字段名称文本或者一个字段位置数值，字段位置数值从 1 开始。", 0, 0, _SDT_ALL, 0, NULL},
    // 命令 303: 改字段名
    /*0481*/ {"字段名称或位置", "参数值可以为一个字段名称文本或者一个字段位置数值，字段位置数值从 1 开始。", 0, 0, _SDT_ALL, 0, NULL},
    /*0482*/ {"字段的新名称", "", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 304: 取字段类型
    /*0483*/ {"字段名称或位置", "参数值可以为一个字段名称文本或者一个字段位置数值，字段位置数值从 1 开始。", 0, 0, _SDT_ALL, 0, NULL},
    // 命令 305: 取字段尺寸
    /*0484*/ {"字段名称或位置", "参数值可以为一个字段名称文本或者一个字段位置数值，字段位置数值从 1 开始。", 0, 0, _SDT_ALL, 0, NULL},
    // 命令 306: 新建索引
    /*0485*/ {"欲创建索引文件的名称", "", 0, 0, SDT_TEXT, 0, NULL},
    /*0486*/ {"索引类型", "参数值可以为以下常量值之一，如果被省略，默认为“#通常索引”：", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0487*/ {"索引选项", "参数值可以为以下常量值之一或者之和：", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0488*/ {"索引块尺寸", "参数值指定索引文件记录索引项时所使用索引块的大小，以 512 字节为单位，最大值为 10 。如果本参数被省略，默认值为 ", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0489*/ {"被索引字段的名称", "本参数的各参数值顺序指定所有被索引字段的名称，支持以数组方式直接提供多个字段。", 0, 0, SDT_TEXT, 0, AS_RECEIVE_ALL_TYPE_DATA},
    // 命令 307: 置当前索引
    /*0490*/ {"索引名称", "索引名称为索引文件名的无后缀部分。譬如“sy.enx”索引文件，其索引名称为“sy”。", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 311: 取索引名
    /*0491*/ {"索引位置", "参数值指定索引在当前数据库内所有被打开索引中的位置，从 1 开始。", 0, 0, SDT_INT, 0, NULL},
    // 命令 312: 取索引字段
    /*0492*/ {"索引位置", "参数值指定索引在当前数据库内所有被打开索引中的位置，从 1 开始。", 0, 0, SDT_INT, 0, NULL},
    // 命令 313: 置加锁重试时间
    /*0493*/ {"加锁重试时间", "参数值可以为以下值之一：", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 318: 锁住记录
    /*0494*/ {"记录号", "参数值指定的记录号从 1 开始。", 0, 0, SDT_INT, 0, NULL},
    // 命令 319: 解锁记录
    /*0495*/ {"记录号", "参数值指定的记录号从 1 开始。", 0, 0, SDT_INT, 0, NULL},
    // 命令 321: 取平均值
    /*0496*/ {"计算表达式", "本参数所指定的表达式内必须使用了当前数据库的字段。", 0, 0, _SDT_ALL, 0, NULL},
    /*0497*/ {"记录条件", "如果本参数被省略，默认为当前数据库中的所有记录，否则将仅限于满足此条件的记录。", 0, 0, _SDT_ALL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 322: 求和
    /*0498*/ {"计算表达式", "本参数所指定的表达式内必须使用了当前数据库的字段。", 0, 0, _SDT_ALL, 0, NULL},
    /*0499*/ {"记录条件", "如果本参数被省略，默认为当前数据库中的所有记录，否则将仅限于满足此条件的记录。", 0, 0, _SDT_ALL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 323: 取最大值
    /*0500*/ {"计算表达式", "本参数所指定的表达式内必须使用了当前数据库的字段。", 0, 0, _SDT_ALL, 0, NULL},
    /*0501*/ {"记录条件", "如果本参数被省略，默认为当前数据库中的所有记录，否则将仅限于满足此条件的记录。", 0, 0, _SDT_ALL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 324: 取最小值
    /*0502*/ {"计算表达式", "本参数所指定的表达式内必须使用了当前数据库的字段。", 0, 0, _SDT_ALL, 0, NULL},
    /*0503*/ {"记录条件", "如果本参数被省略，默认为当前数据库中的所有记录，否则将仅限于满足此条件的记录。", 0, 0, _SDT_ALL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 325: 取最大时间
    /*0504*/ {"计算表达式", "本参数所指定的表达式内必须使用了当前数据库的字段。", 0, 0, _SDT_ALL, 0, NULL},
    /*0505*/ {"记录条件", "如果本参数被省略，默认为当前数据库中的所有记录，否则将仅限于满足此条件的记录。", 0, 0, _SDT_ALL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 326: 取最小时间
    /*0506*/ {"计算表达式", "本参数所指定的表达式内必须使用了当前数据库的字段。", 0, 0, _SDT_ALL, 0, NULL},
    /*0507*/ {"记录条件", "如果本参数被省略，默认为当前数据库中的所有记录，否则将仅限于满足此条件的记录。", 0, 0, _SDT_ALL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 327: 计算数目
    /*0508*/ {"记录条件", "如果本参数被省略，默认为当前数据库中的所有记录，否则将仅限于满足此条件的记录。", 0, 0, _SDT_ALL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 328: 复制结构
    /*0509*/ {"数据库文件名", "本参数指定欲复制到的数据库文件，该数据库必须不存在或者尚未被打开。如果已经存在，将会被覆盖。", 0, 0, SDT_TEXT, 0, NULL},
    /*0510*/ {"字段范围", "本参数的各参数值顺序指定所有欲复制字段的名称。如果被省略，默认为所有字段。", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY | AS_RECEIVE_ALL_TYPE_DATA},
    // 命令 329: 复制记录
    /*0511*/ {"数据库文件名", "本参数指定欲复制到的数据库文件，该数据库必须不存在或者尚未被打开。如果已经存在，将会被覆盖。", 0, 0, SDT_TEXT, 0, NULL},
    /*0512*/ {"记录条件", "如果本参数被省略，默认为当前数据库中的所有记录，否则将仅限于满足此条件的记录。", 0, 0, _SDT_ALL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0513*/ {"字段范围", "本参数的各参数值顺序指定所有欲复制字段的名称。如果被省略，默认为所有字段。", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY | AS_RECEIVE_ALL_TYPE_DATA},
    // 命令 330: 计算排序
    /*0514*/ {"数据库文件名", "本参数指定欲复制到的数据库文件，该数据库必须不存在或者尚未被打开。如果已经存在，将会被覆盖。", 0, 0, SDT_TEXT, 0, NULL},
    /*0515*/ {"排序表达式", "本参数所指定的表达式内必须使用了当前数据库的字段，表达式所返回数据的类型必须为数值型。", 0, 0, _SDT_ALL, 0, NULL},
    /*0516*/ {"排序方向", "本参数的值如果为真或者被省略，将按照从小到大的顺序排序，否则为从大到小。", 0, 0, SDT_BOOL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0517*/ {"记录条件", "如果本参数被省略，默认为当前数据库中的所有记录，否则将仅限于满足此条件的记录。", 0, 0, _SDT_ALL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0518*/ {"字段范围", "本参数的各参数值顺序指定所有欲复制字段的名称。如果被省略，默认为所有字段。", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY | AS_RECEIVE_ALL_TYPE_DATA},
    // 命令 331: 排序
    /*0519*/ {"数据库文件名", "本参数指定欲复制到的数据库文件，该数据库必须不存在或者尚未被打开。如果已经存在，将会被覆盖。", 0, 0, SDT_TEXT, 0, NULL},
    /*0520*/ {"排序字段", "本参数的数据可以为字段名文本或者字段名文本数组（用作同时指定多个字段）。", 0, 0, SDT_TEXT, 0, AS_RECEIVE_ALL_TYPE_DATA},
    /*0521*/ {"排序方向", "本参数的数据可以为一个逻辑值或者逻辑值数组（用作同时为多个字段指定排序方向）。如果逻辑值为真，对应字段将按照从小到大的顺", 0, 0, SDT_BOOL, 0, AS_DEFAULT_VALUE_IS_EMPTY | AS_RECEIVE_ALL_TYPE_DATA},
    /*0522*/ {"记录条件", "如果本参数被省略，默认为当前数据库中的所有记录，否则将仅限于满足此条件的记录。", 0, 0, _SDT_ALL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0523*/ {"字段范围", "本参数的各参数值顺序指定所有欲复制字段的名称。如果被省略，默认为所有字段。", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY | AS_RECEIVE_ALL_TYPE_DATA},
    // 命令 332: 分类计算
    /*0524*/ {"数据库文件名", "本参数指定欲复制到的数据库文件，该数据库必须不存在或者尚未被打开。如果已经存在，将会被覆盖。", 0, 0, SDT_TEXT, 0, NULL},
    /*0525*/ {"分类字段", "本参数的数据可以为字段名文本或者字段名文本数组（用作同时指定多个字段）。", 0, 0, SDT_TEXT, 0, AS_RECEIVE_ALL_TYPE_DATA},
    /*0526*/ {"计算方法", "参数值可以为以下常量之一： 1、#取平均值； 2、#求和； 3、#取最大值； 4、#取最小值。 如果本参数被省略，默认为", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0527*/ {"记录条件", "如果本参数被省略，默认为当前数据库中的所有记录，否则将仅限于满足此条件的记录。", 0, 0, _SDT_ALL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0528*/ {"字段范围", "本参数的各参数值顺序指定所有欲复制字段的名称。如果被省略，默认为所有字段。", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY | AS_RECEIVE_ALL_TYPE_DATA},
    // 命令 333: 添加
    /*0529*/ {"数据库别名或名称", "本参数指定一个已打开数据库，命令将从该数据库中获取欲添加的记录数据。", 0, 0, SDT_TEXT, 0, NULL},
    /*0530*/ {"记录条件", "如果本参数被省略，默认为添加指定数据库中的所有记录，否则仅添加指定数据库中满足此条件的记录。", 0, 0, _SDT_ALL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0531*/ {"字段范围", "本参数的各参数值顺序指定所有欲添加字段的名称。如果被省略，默认添加所有同名字段。", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY | AS_RECEIVE_ALL_TYPE_DATA},
    // 命令 334: 加记录
    /*0532*/ {"记录数据", "本参数的每一个参数值用作为记录中对应位置处的一个字段提供数据。如果某参数值被省略，则对应位置处字段的内容被设置为初始值。", 0, 0, _SDT_ALL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 336: 替换
    /*0533*/ {"替换范围", "如果本参数被省略，默认为替换当前记录数据，否则替换所有满足此条件记录的数据。如果欲在所有记录内进行替换，请直接将逻辑值“", 0, 0, _SDT_ALL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0534*/ {"字段名称或替换数据", "本参数的每一对参数值顺序指定欲被替换字段的名称及其相应的替换值。替换值的数据类型必须与所对应字段的数据类型一致或可互相转", 0, 0, _SDT_ALL, 0, NULL},
    // 命令 337: 修改
    /*0535*/ {"修改数据", "本参数的每一个参数值用作替换当前记录中对应位置处的一个字段。如果某参数值被省略，则对应位置处字段的内容将保持不变。", 0, 0, _SDT_ALL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 338: 删除
    /*0536*/ {"记录范围", "如果本参数被省略，默认为删除或恢复删除当前记录，否则删除或恢复删除所有满足此条件的记录。如果欲删除或恢复删除全部记录，请", 0, 0, _SDT_ALL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 340: 恢复删除
    /*0537*/ {"记录范围", "如果本参数被省略，默认为删除或恢复删除当前记录，否则删除或恢复删除所有满足此条件的记录。如果欲删除或恢复删除全部记录，请", 0, 0, _SDT_ALL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 343: 读
    /*0538*/ {"字段名称或位置", "参数值可以为一个字段名称文本或者一个字段位置数值，字段位置数值从 1 开始。", 0, 0, _SDT_ALL, 0, NULL},
    // 命令 344: 写
    /*0539*/ {"字段名称或位置", "参数值可以为一个字段名称文本或者一个字段位置数值，字段位置数值从 1 开始。", 0, 0, _SDT_ALL, 0, NULL},
    /*0540*/ {"欲写入数据", "本参数数据的类型必须与所对应字段的数据类型一致或可互相转换。如果本参数被省略，则初始化对应字段中的内容，具体为：数值字段", 0, 0, _SDT_ALL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 345: 读字段
    /*0541*/ {"字段名称或位置", "参数值可以为一个字段名称文本或者一个字段位置数值，字段位置数值从 1 开始。", 0, 0, _SDT_ALL, 0, NULL},
    /*0542*/ {"数据库别名或名称", "参数值指定一个已经被打开的数据库，该数据库内包含所欲读取的字段。如果被省略，默认为当前数据库。", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 346: 写字段
    /*0543*/ {"字段名称或位置", "参数值可以为一个字段名称文本或者一个字段位置数值，字段位置数值从 1 开始。", 0, 0, _SDT_ALL, 0, NULL},
    /*0544*/ {"数据库别名或名称", "参数值指定一个已经被打开的数据库，该数据库内包含所欲写入的字段。如果被省略，默认为当前数据库。", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0545*/ {"欲写入数据", "本参数数据的类型必须与所对应字段的数据类型一致或可互相转换。如果本参数被省略，则初始化对应字段中的内容，具体为：数值字段", 0, 0, _SDT_ALL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 347: 附加字节集
    /*0546*/ {"字段名称或位置", "参数值可以为一个字段名称文本或者一个字段位置数值，字段位置数值从 1 开始。", 0, 0, _SDT_ALL, 0, NULL},
    /*0547*/ {"欲添加的字节集数据", "", 0, 0, SDT_BIN, 0, NULL},
    // 命令 348: 附加备注
    /*0548*/ {"字段名称或位置", "参数值可以为一个字段名称文本或者一个字段位置数值，字段位置数值从 1 开始。", 0, 0, _SDT_ALL, 0, NULL},
    /*0549*/ {"欲添加的文本数据", "", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 349: 索引查找
    /*0550*/ {"欲搜寻值", "本参数数据的类型必须与索引字段表中对应位置处字段的类型一致。", 0, 0, _SDT_ALL, 0, NULL},
    // 命令 350: 查找
    /*0551*/ {"查找条件", "参数值指定欲查找记录应该满足的条件。", 0, 0, _SDT_ALL, 0, NULL},
    // 命令 353: 跳过
    /*0552*/ {"欲跳过的记录数", "参数值如果为负数，则向前移动，否则向后移动。如果本参数被省略，默认值为 1 ，即向后移动一条记录。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 355: 跳到
    /*0553*/ {"欲跳到的记录号", "参数值所指定的记录号从 1 开始，即首记录的记录号为 1 ，依此类推。", 0, 0, SDT_INT, 0, NULL},
    // 命令 357: 记录是否存在
    /*0554*/ {"记录的标签值", "", 0, 0, SDT_INT, 0, NULL},
    // 命令 358: 标签跳转
    /*0555*/ {"记录的标签值", "", 0, 0, SDT_INT, 0, NULL},
    // 命令 363: 编辑
    /*0556*/ {"标题", "本参数指定对话框的标题，如果被省略，默认为“数据库记录编辑”。", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0557*/ {"编辑方式", "可以为 0 或者以下常量值的组合： 1、#禁止修改； 2、#禁止添加； 4、#禁止删除； 8、#禁止自动判断（注：在默认", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0558*/ {"字段范围", "本参数的各参数值顺序指定所有欲编辑字段的名称。如果被省略，默认为所有字段。", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY | AS_RECEIVE_ALL_TYPE_DATA},
    // 命令 364: 是否已加密
    /*0559*/ {"数据库文件名", "", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 365: 置数据库密码
    /*0560*/ {"新密码文本", "建议密码长度最少为6个字符以上，并且最好混合使用汉字、字母、数字、符号，以保证密码本身的安全性。注意不能为“?”（即单个", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 366: 密码输入框
    /*0561*/ {"存放所输入密码的变量", "", 0, 0, SDT_TEXT, 0, AS_RECEIVE_VAR},
    /*0562*/ {"已重试次数", "本参数提供已经重试输入密码的次数，用作在对话框中显示剩余次数（允许总次数恒定为3次）。如果本参数被省略，则默认值为0。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 367: 复制密码
    /*0563*/ {"数据库别名或名称", "参数值指定一个已经被打开的数据库。", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 369: 通信测试
    /*0564*/ {"被测试主机地址", "可以为主机名、IP地址等。", 0, 0, SDT_TEXT, 0, NULL},
    /*0565*/ {"最长等待时间", "指定最长等待被测试主机响应的时间，单位为毫秒。超过此时间即认为无法与被测试主机通讯。如果省略本参数，则默认为 10 * ", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 370: 转换为主机名
    /*0566*/ {"欲转换IP地址", "", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 371: 转换为IP地址
    /*0567*/ {"欲转换主机名", "", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 372: 标准输出
    /*0568*/ {"输出方向", "本参数提供内容所输出到的设备，可以为以下常量值之一： 1、#标准输出设备； 2、#标准错误设备。如果省略本参数，默认为“", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0569*/ {"欲输出内容", "本参数只能为文本、数值、逻辑值或日期时间。如果内容为文本且包含多行，可在各行之间用回车符 (即“字符 (13)”)、换行", 0, 0, _SDT_ALL, 0, NULL},
    // 命令 373: 标准输入
    /*0570*/ {"是否回显", "本参数决定输入时是否显示所输入字符，为假不显示，为真显示。如果被省略，默认值为真，即回显。可以通过将本参数设置为假以输入", 0, 0, SDT_BOOL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 374: 载入易包文件
    /*0571*/ {"易包文件名", "指定所欲载入易包的文件名(易语言编译器所编译生成的易包数据文件)。", 0, 0, SDT_TEXT, 0, NULL},
    /*0572*/ {"易包名称", "指定所欲载入易包的名称,如果被省略,则默认为易包文件名去除后缀和路径后的部分。", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 375: 载入易包数据
    /*0573*/ {"易包名称", "指定欲操作易包的名称。", 0, 0, SDT_TEXT, 0, NULL},
    /*0574*/ {"易包数据", "指定所欲载入易包的数据(易语言编译器所编译生成的易包数据)。", 0, 0, SDT_BIN, 0, NULL},
    // 命令 376: 卸载易包
    /*0575*/ {"易包名称", "指定欲操作易包的名称。", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 377: 易包是否被载入
    /*0576*/ {"易包名称", "指定欲操作易包的名称。", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 378: 复制易包常量
    /*0577*/ {"待复制常量数据", "欲转换到非常量状态的常量数据。", 0, 0, _SDT_ALL, 0, NULL},
    // 命令 380: 销毁
    /*0578*/ {"立即销毁", "通常情况下，调用销毁方法后为了考虑到事件处理子程序的后续安全操作，窗口真正的销毁工作会被延迟到所处事件处理子程序执行完毕", 0, 0, SDT_BOOL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 388: 部分重画
    /*0579*/ {"欲重画区域的左边", "单位为像素点，相对于用户区域的左边。", 0, 0, SDT_INT, 0, NULL},
    /*0580*/ {"欲重画区域的顶边", "单位为像素点，相对于用户区域的顶边。", 0, 0, SDT_INT, 0, NULL},
    /*0581*/ {"欲重画区域的宽度", "单位为像素点。", 0, 0, SDT_INT, 0, NULL},
    /*0582*/ {"欲重画区域的高度", "单位为像素点。", 0, 0, SDT_INT, 0, NULL},
    // 命令 391: 移动
    /*0583*/ {"左边", "单位为像素点。如被省略则不改变左边原位置。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0584*/ {"顶边", "单位为像素点。如被省略则不改变顶边原位置。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0585*/ {"宽度", "单位为像素点。如被省略或等于 -1 ，则不改变原宽度。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0586*/ {"高度", "单位为像素点。如被省略或等于 -1 ，则不改变原高度。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 392: 调整层次
    /*0587*/ {"欲调整到的层次", "可以为以下常量之一： 1、#顶层； 2、#底层； 3、#最高层； 4、#次高层。如果被省略，默认为“#顶层”。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 393: 弹出菜单
    /*0588*/ {"欲弹出的菜单", "指定菜单内必须包含有子菜单，且所处窗口必须与调用对象窗口一致。", 0, 0, _SDT_ALL, 0, NULL},
    /*0589*/ {"水平显示位置", "单位为像素点，相对于屏幕左边。如果被省略，将自动使用当前鼠标位置。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0590*/ {"垂直显示位置", "单位为像素点，相对于屏幕顶边。如果被省略，将自动使用当前鼠标位置。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 394: 发送信息
    /*0591*/ {"信息值", "", 0, 0, SDT_INT, 0, NULL},
    /*0592*/ {"参数1", "", 0, 0, SDT_INT, 0, NULL},
    /*0593*/ {"参数2", "", 0, 0, SDT_INT, 0, NULL},
    // 命令 395: 投递信息
    /*0594*/ {"信息值", "", 0, 0, SDT_INT, 0, NULL},
    /*0595*/ {"参数1", "", 0, 0, SDT_INT, 0, NULL},
    /*0596*/ {"参数2", "", 0, 0, SDT_INT, 0, NULL},
    // 命令 396: 取标记组件
    /*0597*/ {"欲寻找组件的标记数值", "即该组件的“标记”属性文本的数值形式。", 0, 0, SDT_INT, 0, NULL},
    // 命令 397: 置外形图片
    /*0598*/ {"图片数据", "参数值可以为 .JPG、.GIF、.BMP、.DIB 等等被支持格式的图片数据、图片资源或图片文件名。", 0, 0, _SDT_ALL, 0, NULL},
    /*0599*/ {"透明颜色", "指定图片中透明部分的颜色。如果被省略，默认为白色。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 399: 置托盘图标
    /*0600*/ {"图标数据", "参数值可以为图标字节集数据、图标资源或图标文件名。如果省略本参数，默认为清除已有的本程序图标。", 0, 0, _SDT_ALL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0601*/ {"提示信息", "本参数指定当鼠标移动到图标上后显示的提示信息。如果省略本参数，默认为空文本。", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 400: 弹出托盘菜单
    /*0602*/ {"欲弹出的菜单", "指定菜单内必须包含有子菜单，且所处窗口必须与调用对象窗口一致。", 0, 0, _SDT_ALL, 0, NULL},
    // 命令 401: 置父窗口
    /*0603*/ {"父窗口或窗口组件", "参数值提供欲设置为本对象窗口组件父窗口的窗口或窗口组件。", 0, 0, _SDT_ALL, 0, NULL},
    // 命令 402: 加入文本
    /*0604*/ {"欲加入文本", "", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 404: 清除
    /*0605*/ {"清除区左上角横坐标", "使用当前绘画单位，相对于画板左上角。如果被省略，默认为 0 。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0606*/ {"清除区左上角纵坐标", "使用当前绘画单位，相对于画板左上角。如果被省略，默认为 0 。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0607*/ {"清除区宽度", "使用当前绘画单位。如果被省略，默认为清除区左边到画板右边之间的宽度。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0608*/ {"清除区高度", "使用当前绘画单位。如果被省略，默认为清除区顶边到画板底边之间的高度。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 405: 取点
    /*0609*/ {"点横坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0610*/ {"点纵坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    // 命令 406: 画点
    /*0611*/ {"点横坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0612*/ {"点纵坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0613*/ {"欲画入点的颜色值", "", 0, 0, SDT_INT, 0, NULL},
    // 命令 407: 画直线
    /*0614*/ {"起始点横坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0615*/ {"起始点纵坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0616*/ {"结束点横坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0617*/ {"结束点纵坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    // 命令 408: 画椭圆
    /*0618*/ {"椭圆左上角横坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0619*/ {"椭圆左上角纵坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0620*/ {"椭圆右下角横坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0621*/ {"椭圆右下角纵坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    // 命令 409: 画弧线
    /*0622*/ {"椭圆左上角横坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0623*/ {"椭圆左上角纵坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0624*/ {"椭圆右下角横坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0625*/ {"椭圆右下角纵坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0626*/ {"弧线起始点横坐标", "弧线从椭圆中心点至此起始点的直线与椭圆圆弧相交处开始绘制。使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0627*/ {"弧线起始点纵坐标", "弧线从椭圆中心点至此起始点的直线与椭圆圆弧相交处开始绘制。使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0628*/ {"弧线终止点横坐标", "弧线在椭圆中心点至此终止点的直线与椭圆圆弧相交处结束绘制。使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0629*/ {"弧线终止点纵坐标", "弧线在椭圆中心点至此终止点的直线与椭圆圆弧相交处结束绘制。使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    // 命令 410: 画弦
    /*0630*/ {"椭圆左上角横坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0631*/ {"椭圆左上角纵坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0632*/ {"椭圆右下角横坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0633*/ {"椭圆右下角纵坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0634*/ {"弧线起始点横坐标", "弧线从椭圆中心点至此起始点的直线与椭圆圆弧相交处开始绘制。使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0635*/ {"弧线起始点纵坐标", "弧线从椭圆中心点至此起始点的直线与椭圆圆弧相交处开始绘制。使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0636*/ {"弧线终止点横坐标", "弧线在椭圆中心点至此终止点的直线与椭圆圆弧相交处结束绘制。使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0637*/ {"弧线终止点纵坐标", "弧线在椭圆中心点至此终止点的直线与椭圆圆弧相交处结束绘制。使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    // 命令 411: 画饼
    /*0638*/ {"椭圆左上角横坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0639*/ {"椭圆左上角纵坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0640*/ {"椭圆右下角横坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0641*/ {"椭圆右下角纵坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0642*/ {"弧线起始点横坐标", "弧线从椭圆中心点至此起始点的直线与椭圆圆弧相交处开始绘制。使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0643*/ {"弧线起始点纵坐标", "弧线从椭圆中心点至此起始点的直线与椭圆圆弧相交处开始绘制。使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0644*/ {"弧线终止点横坐标", "弧线在椭圆中心点至此终止点的直线与椭圆圆弧相交处结束绘制。使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0645*/ {"弧线终止点纵坐标", "弧线在椭圆中心点至此终止点的直线与椭圆圆弧相交处结束绘制。使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    // 命令 412: 画矩形
    /*0646*/ {"矩形左上角横坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0647*/ {"矩形左上角纵坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0648*/ {"矩形右下角横坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0649*/ {"矩形右下角纵坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    // 命令 413: 画渐变矩形
    /*0650*/ {"矩形区域左边", "", 0, 0, SDT_INT, 0, NULL},
    /*0651*/ {"矩形区域顶边", "", 0, 0, SDT_INT, 0, NULL},
    /*0652*/ {"矩形区域宽度", "", 0, 0, SDT_INT, 0, NULL},
    /*0653*/ {"矩形区域高度", "", 0, 0, SDT_INT, 0, NULL},
    /*0654*/ {"渐变方向", "参数值可以为以下常量值之一： 1、#从上到下； 2、#从左到右； 3、从左上到右下； 4、从右上到左下； 5、从下到上；", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0655*/ {"首渐变颜色", "", 0, 0, SDT_INT, 0, NULL},
    /*0656*/ {"其它渐变颜色", "", 0, 0, SDT_INT, 0, NULL},
    // 命令 414: 填充矩形
    /*0657*/ {"矩形左上角横坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0658*/ {"矩形左上角纵坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0659*/ {"矩形右下角横坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0660*/ {"矩形右下角纵坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    // 命令 415: 画圆角矩形
    /*0661*/ {"矩形左上角横坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0662*/ {"矩形左上角纵坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0663*/ {"矩形右下角横坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0664*/ {"矩形右下角纵坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0665*/ {"圆角宽度", "使用当前绘画单位。", 0, 0, SDT_INT, 0, NULL},
    /*0666*/ {"圆角高度", "使用当前绘画单位。如果省略本参数，默认与圆角宽度相等。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 416: 翻转矩形区
    /*0667*/ {"矩形左上角横坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0668*/ {"矩形左上角纵坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0669*/ {"矩形右下角横坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0670*/ {"矩形右下角纵坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    // 命令 417: 画多边形
    /*0671*/ {"多边形顶点", "本参数数组顺序记录多边形各顶点的横向及纵向坐标值。使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, AS_RECEIVE_ALL_TYPE_DATA},
    /*0672*/ {"顶点数目", "本参数指定多边形顶点的总数目。如果被省略，默认为数组中所记录的顶点数目。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY | AS_RECEIVE_ALL_TYPE_DATA},
    // 命令 418: 置写出位置
    /*0673*/ {"横向写出位置", "如果本参数被省略，则使用现行横向写出位置。使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0674*/ {"纵向写出位置", "如果本参数被省略，则使用现行纵向写出位置。使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 419: 写文本行
    /*0675*/ {"欲写出数据", "参数值只能为文本、数值、逻辑值或日期时间。如果本参数被省略，则写出一个空行。", 0, 0, _SDT_ALL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 420: 滚动写行
    /*0676*/ {"欲写出数据", "参数值只能为文本、数值、逻辑值或日期时间。如果本参数被省略，则写出一个空行。", 0, 0, _SDT_ALL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 421: 写出
    /*0677*/ {"欲写出数据", "参数值只能为文本、数值、逻辑值或日期时间。如果本参数被省略，则写出一个空行。", 0, 0, _SDT_ALL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 422: 定位写出
    /*0678*/ {"横向写出位置", "如果本参数被省略，则使用现行横向写出位置。使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0679*/ {"纵向写出位置", "如果本参数被省略，则使用现行纵向写出位置。使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0680*/ {"欲写出数据", "参数值只能为文本、数值、逻辑值或日期时间。", 0, 0, _SDT_ALL, 0, NULL},
    // 命令 423: 取宽度
    /*0681*/ {"欲取其宽度或高度的数据", "参数值只能为文本、数值、逻辑值或日期时间。", 0, 0, _SDT_ALL, 0, NULL},
    // 命令 424: 取高度
    /*0682*/ {"欲取其宽度或高度的数据", "参数值只能为文本、数值、逻辑值或日期时间。", 0, 0, _SDT_ALL, 0, NULL},
    // 命令 425: 画图片
    /*0683*/ {"图片号", "参数值必须为调用“载入图片”命令所返回的图片号。", 0, 0, SDT_INT, 0, NULL},
    /*0684*/ {"图片左边画出位置", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0685*/ {"图片顶边画出位置", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0686*/ {"图片画出宽度", "如果本参数被省略，则使用图片本身的宽度。使用当前绘画单位。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0687*/ {"图片画出高度", "如果本参数被省略，则使用图片本身的高度。使用当前绘画单位。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0688*/ {"图片画出方法", "本参数定义在将图像绘制到对象（画板 / 打印机）上时对图像执行的位操作。对“图标”类型图片无效。可以为以下常量值之一或者", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 426: 取图片宽度
    /*0689*/ {"图片号", "参数值必须为调用“载入图片”命令所返回的图片号。", 0, 0, SDT_INT, 0, NULL},
    // 命令 427: 取图片高度
    /*0690*/ {"图片号", "参数值必须为调用“载入图片”命令所返回的图片号。", 0, 0, SDT_INT, 0, NULL},
    // 命令 428: 复制
    /*0691*/ {"欲复制区域的左边", "如果本参数被省略，默认值为 0 。使用源画板的当前绘画单位。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0692*/ {"欲复制区域的顶边", "如果本参数被省略，默认值为 0 。使用源画板的当前绘画单位。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0693*/ {"欲复制区域的宽度", "如果本参数被省略，默认等同于源画板的宽度。使用源画板的当前绘画单位。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0694*/ {"欲复制区域的高度", "如果本参数被省略，默认等同于源画板的高度。使用源画板的当前绘画单位。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0695*/ {"复制到的目的画板", "如果本参数被省略，默认为复制到源画板对象。", 0, 0, _SDT_ALL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0696*/ {"欲复制到位置左边", "如果本参数被省略，默认值为 0 。使用目的画板的当前绘画单位。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0697*/ {"欲复制到位置顶边", "如果本参数被省略，默认值为 0 。使用目的画板的当前绘画单位。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0698*/ {"复制方法", "本参数定义在将画板内容复制到目的画板上时对图像执行的位操作。可以为以下常量值之一或者其它自定义操作码：", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 429: 取图片
    /*0699*/ {"输出宽度", "指定图片的输出宽度。如果小于0，参数值指定的是最终图片输出宽度相对于所取得图片宽度的百分比（最小为10%）；如果等于0，", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0700*/ {"输出高度", "指定图片的输出高度。如果小于0，参数值指定的是最终图片输出高度相对于所取得图片高度的百分比（最小为10%）；如果等于0，", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 430: 单位转换
    /*0701*/ {"欲转换的座标值", "提供欲转换的横向或纵向座标值。", 0, 0, SDT_INT, 0, NULL},
    /*0702*/ {"欲转换座标值的类型", "可以为以下常量值之一： 1：#横向绘画单位； 2：#纵向绘画单位； 3：#横向像素单位； 4：#纵向像素单位。 根据所提", 0, 0, SDT_INT, 0, NULL},
    // 命令 431: 调用反馈事件
    /*0703*/ {"参数一", "为反馈事件所携带的第一个参数，如果被省略，默认值为零。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0704*/ {"参数二", "为反馈事件所携带的第二个参数，如果被省略，默认值为零。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0705*/ {"事件传递方式", "为真则采用发送方式传递事件消息，此时本命令将一直等待到“反馈事件”用户事件处理子程序处理完毕后才返回，为假则采用投递方式", 0, 0, SDT_BOOL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 433: 置顶端可见项目
    /*0706*/ {"项目索引", "0 为项目一，1 为项目二，如此类推。", 0, 0, SDT_INT, 0, NULL},
    // 命令 435: 取项目数值
    /*0707*/ {"项目索引", "0 为项目一，1 为项目二，如此类推。", 0, 0, SDT_INT, 0, NULL},
    // 命令 436: 置项目数值
    /*0708*/ {"项目索引", "0 为项目一，1 为项目二，如此类推。", 0, 0, SDT_INT, 0, NULL},
    /*0709*/ {"欲置入的项目数值", "该项目数值与指定项目相关联。", 0, 0, SDT_INT, 0, NULL},
    // 命令 437: 取项目文本
    /*0710*/ {"项目索引", "0 为项目一，1 为项目二，如此类推。", 0, 0, SDT_INT, 0, NULL},
    // 命令 438: 置项目文本
    /*0711*/ {"项目索引", "0 为项目一，1 为项目二，如此类推。", 0, 0, SDT_INT, 0, NULL},
    /*0712*/ {"欲置入的项目文本", "", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 439: 加入项目
    /*0713*/ {"欲加入项目的文本", "", 0, 0, SDT_TEXT, 0, NULL},
    /*0714*/ {"与欲加入项目相关的数值", "如果省略本参数，默认值为 0。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 440: 插入项目
    /*0715*/ {"欲插入的位置", "0 为项目位置一，1 为项目位置二，如此类推。", 0, 0, SDT_INT, 0, NULL},
    /*0716*/ {"欲插入项目的文本", "", 0, 0, SDT_TEXT, 0, NULL},
    /*0717*/ {"与欲插入项目相关的数值", "如果省略本参数，默认值为 0。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 441: 删除项目
    /*0718*/ {"项目索引", "0 为项目一，1 为项目二，如此类推。", 0, 0, SDT_INT, 0, NULL},
    // 命令 443: 选择
    /*0719*/ {"欲选择的项目文本", "", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 445: 置顶端可见项目
    /*0720*/ {"项目索引", "0 为项目一，1 为项目二，如此类推。", 0, 0, SDT_INT, 0, NULL},
    // 命令 447: 取项目数值
    /*0721*/ {"项目索引", "0 为项目一，1 为项目二，如此类推。", 0, 0, SDT_INT, 0, NULL},
    // 命令 448: 置项目数值
    /*0722*/ {"项目索引", "0 为项目一，1 为项目二，如此类推。", 0, 0, SDT_INT, 0, NULL},
    /*0723*/ {"欲置入的项目数值", "该项目数值与指定项目相关联。", 0, 0, SDT_INT, 0, NULL},
    // 命令 449: 取项目文本
    /*0724*/ {"项目索引", "0 为项目一，1 为项目二，如此类推。", 0, 0, SDT_INT, 0, NULL},
    // 命令 450: 置项目文本
    /*0725*/ {"项目索引", "0 为项目一，1 为项目二，如此类推。", 0, 0, SDT_INT, 0, NULL},
    /*0726*/ {"欲置入的项目文本", "", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 453: 是否被选择
    /*0727*/ {"项目索引", "0 为项目一，1 为项目二，如此类推。", 0, 0, SDT_INT, 0, NULL},
    // 命令 454: 选择项目
    /*0728*/ {"欲选择或取消选择的项目索引", "0 为项目一，1 为项目二，如此类推。", 0, 0, SDT_INT, 0, NULL},
    /*0729*/ {"欲置入的项目选择状态", "如果省略本参数或者参数值为真，则选择该项目，否则取消对该项目的选择。", 0, 0, SDT_BOOL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 456: 置焦点项目
    /*0730*/ {"项目索引", "0 为项目一，1 为项目二，如此类推。", 0, 0, SDT_INT, 0, NULL},
    // 命令 457: 加入项目
    /*0731*/ {"欲加入项目的文本", "", 0, 0, SDT_TEXT, 0, NULL},
    /*0732*/ {"与欲加入项目相关的数值", "如果省略本参数，默认值为 0。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 458: 插入项目
    /*0733*/ {"欲插入的位置", "0 为项目位置一，1 为项目位置二，如此类推。", 0, 0, SDT_INT, 0, NULL},
    /*0734*/ {"欲插入项目的文本", "", 0, 0, SDT_TEXT, 0, NULL},
    /*0735*/ {"与欲插入项目相关的数值", "如果省略本参数，默认值为 0。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 459: 删除项目
    /*0736*/ {"项目索引", "0 为项目一，1 为项目二，如此类推。", 0, 0, SDT_INT, 0, NULL},
    // 命令 461: 选择
    /*0737*/ {"欲选择的项目文本", "", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 463: 置顶端可见项目
    /*0738*/ {"项目索引", "0 为项目一，1 为项目二，如此类推。", 0, 0, SDT_INT, 0, NULL},
    // 命令 465: 取项目数值
    /*0739*/ {"项目索引", "0 为项目一，1 为项目二，如此类推。", 0, 0, SDT_INT, 0, NULL},
    // 命令 466: 置项目数值
    /*0740*/ {"项目索引", "0 为项目一，1 为项目二，如此类推。", 0, 0, SDT_INT, 0, NULL},
    /*0741*/ {"欲置入的项目数值", "该项目数值与指定项目相关联。", 0, 0, SDT_INT, 0, NULL},
    // 命令 467: 取项目文本
    /*0742*/ {"项目索引", "0 为项目一，1 为项目二，如此类推。", 0, 0, SDT_INT, 0, NULL},
    // 命令 468: 置项目文本
    /*0743*/ {"项目索引", "0 为项目一，1 为项目二，如此类推。", 0, 0, SDT_INT, 0, NULL},
    /*0744*/ {"欲置入的项目文本", "", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 469: 加入项目
    /*0745*/ {"欲加入项目的文本", "", 0, 0, SDT_TEXT, 0, NULL},
    /*0746*/ {"与欲加入项目相关的数值", "如果省略本参数，默认值为 0。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 470: 插入项目
    /*0747*/ {"欲插入的位置", "0 为项目位置一，1 为项目位置二，如此类推。", 0, 0, SDT_INT, 0, NULL},
    /*0748*/ {"欲插入项目的文本", "", 0, 0, SDT_TEXT, 0, NULL},
    /*0749*/ {"与欲插入项目相关的数值", "如果省略本参数，默认值为 0。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 471: 删除项目
    /*0750*/ {"项目索引", "0 为项目一，1 为项目二，如此类推。", 0, 0, SDT_INT, 0, NULL},
    // 命令 473: 选择
    /*0751*/ {"欲选择的项目文本", "", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 474: 是否被选中
    /*0752*/ {"项目索引", "0 为项目一，1 为项目二，如此类推。", 0, 0, SDT_INT, 0, NULL},
    // 命令 475: 选中项目
    /*0753*/ {"欲选择或取消选择的项目索引", "0 为项目一，1 为项目二，如此类推。", 0, 0, SDT_INT, 0, NULL},
    /*0754*/ {"欲置入的项目选择状态", "如果省略本参数或者参数值为真，则选择该项目，否则取消对该项目的选择。", 0, 0, SDT_BOOL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 476: 是否被允许
    /*0755*/ {"项目索引", "0 为项目一，1 为项目二，如此类推。", 0, 0, SDT_INT, 0, NULL},
    // 命令 477: 允许
    /*0756*/ {"欲允许或禁止操作的项目索引", "0 为项目一，1 为项目二，如此类推。", 0, 0, SDT_INT, 0, NULL},
    /*0757*/ {"允许或禁止", "如果省略本参数或者参数值为真，则允许该项目，否则禁止对该项目进行选中操作。", 0, 0, SDT_BOOL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 479: 取子夹名称
    /*0758*/ {"子夹索引", "1 代表子夹一，2 代表子夹二，如此类推。", 0, 0, SDT_INT, 0, NULL},
    // 命令 480: 置子夹名称
    /*0759*/ {"子夹索引", "1 代表子夹一，2 代表子夹二，如此类推。", 0, 0, SDT_INT, 0, NULL},
    /*0760*/ {"欲置入的子夹名称", "", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 484: 开始打印
    /*0761*/ {"是否调用打印设置对话框", "指定在进入打印之前是否先调用打印设置对话框对打印机及相关打印参数进行设置。如省略本参数，默认为真。如果参数值为假，将自动", 0, 0, SDT_BOOL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0762*/ {"是否显示打印状态对话框", "指定在打印过程中是否显示由系统自动提供的打印状态对话框。用户如果在该打印状态对话框中选择了取消打印，系统将自动中止并取消", 0, 0, SDT_BOOL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0763*/ {"纸张", "指定所使用的打印纸类型。可以为以下常量值之一： -1、自定义纸张（必须在后面参数中指定自定义纸张的大小）； 0、#默认纸", 0, 0, _SDT_ALL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0764*/ {"纸张方向", "指定打印纸的放置方向。可以为以下常量值之一： 0、#纵向； 1、#横向。如省略本参数，默认为“#纵向”。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0765*/ {"纸张宽度", "指定自定义纸张的宽度，单位为0.1毫米。只有当前面的“纸张”参数给定值为-1时，本参数才有作用且必须提供具体值。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0766*/ {"纸张高度", "指定自定义纸张的高度，单位为0.1毫米。只有当前面的“纸张”参数给定值为-1时，本参数才有作用且必须提供具体值。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 489: 画点
    /*0767*/ {"点横坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0768*/ {"点纵坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0769*/ {"欲画入点的颜色值", "", 0, 0, SDT_INT, 0, NULL},
    // 命令 490: 画直线
    /*0770*/ {"起始点横坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0771*/ {"起始点纵坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0772*/ {"结束点横坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0773*/ {"结束点纵坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    // 命令 491: 画椭圆
    /*0774*/ {"椭圆左上角横坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0775*/ {"椭圆左上角纵坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0776*/ {"椭圆右下角横坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0777*/ {"椭圆右下角纵坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    // 命令 492: 画弧线
    /*0778*/ {"椭圆左上角横坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0779*/ {"椭圆左上角纵坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0780*/ {"椭圆右下角横坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0781*/ {"椭圆右下角纵坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0782*/ {"弧线起始点横坐标", "弧线从椭圆中心点至此起始点的直线与椭圆圆弧相交处开始绘制。使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0783*/ {"弧线起始点纵坐标", "弧线从椭圆中心点至此起始点的直线与椭圆圆弧相交处开始绘制。使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0784*/ {"弧线终止点横坐标", "弧线在椭圆中心点至此终止点的直线与椭圆圆弧相交处结束绘制。使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0785*/ {"弧线终止点纵坐标", "弧线在椭圆中心点至此终止点的直线与椭圆圆弧相交处结束绘制。使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    // 命令 493: 画弦
    /*0786*/ {"椭圆左上角横坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0787*/ {"椭圆左上角纵坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0788*/ {"椭圆右下角横坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0789*/ {"椭圆右下角纵坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0790*/ {"弧线起始点横坐标", "弧线从椭圆中心点至此起始点的直线与椭圆圆弧相交处开始绘制。使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0791*/ {"弧线起始点纵坐标", "弧线从椭圆中心点至此起始点的直线与椭圆圆弧相交处开始绘制。使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0792*/ {"弧线终止点横坐标", "弧线在椭圆中心点至此终止点的直线与椭圆圆弧相交处结束绘制。使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0793*/ {"弧线终止点纵坐标", "弧线在椭圆中心点至此终止点的直线与椭圆圆弧相交处结束绘制。使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    // 命令 494: 画饼
    /*0794*/ {"椭圆左上角横坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0795*/ {"椭圆左上角纵坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0796*/ {"椭圆右下角横坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0797*/ {"椭圆右下角纵坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0798*/ {"弧线起始点横坐标", "弧线从椭圆中心点至此起始点的直线与椭圆圆弧相交处开始绘制。使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0799*/ {"弧线起始点纵坐标", "弧线从椭圆中心点至此起始点的直线与椭圆圆弧相交处开始绘制。使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0800*/ {"弧线终止点横坐标", "弧线在椭圆中心点至此终止点的直线与椭圆圆弧相交处结束绘制。使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0801*/ {"弧线终止点纵坐标", "弧线在椭圆中心点至此终止点的直线与椭圆圆弧相交处结束绘制。使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    // 命令 495: 画矩形
    /*0802*/ {"矩形左上角横坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0803*/ {"矩形左上角纵坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0804*/ {"矩形右下角横坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0805*/ {"矩形右下角纵坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    // 命令 496: 画渐变矩形
    /*0806*/ {"矩形区域左边", "", 0, 0, SDT_INT, 0, NULL},
    /*0807*/ {"矩形区域顶边", "", 0, 0, SDT_INT, 0, NULL},
    /*0808*/ {"矩形区域宽度", "", 0, 0, SDT_INT, 0, NULL},
    /*0809*/ {"矩形区域高度", "", 0, 0, SDT_INT, 0, NULL},
    /*0810*/ {"渐变方向", "参数值可以为以下常量值之一： 1、#从上到下； 2、#从左到右； 3、从左上到右下； 4、从右上到左下； 5、从下到上；", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0811*/ {"首渐变颜色", "", 0, 0, SDT_INT, 0, NULL},
    /*0812*/ {"其它渐变颜色", "", 0, 0, SDT_INT, 0, NULL},
    // 命令 497: 填充矩形
    /*0813*/ {"矩形左上角横坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0814*/ {"矩形左上角纵坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0815*/ {"矩形右下角横坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0816*/ {"矩形右下角纵坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    // 命令 498: 画圆角矩形
    /*0817*/ {"矩形左上角横坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0818*/ {"矩形左上角纵坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0819*/ {"矩形右下角横坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0820*/ {"矩形右下角纵坐标", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0821*/ {"圆角宽度", "使用当前绘画单位。", 0, 0, SDT_INT, 0, NULL},
    /*0822*/ {"圆角高度", "使用当前绘画单位。如果省略本参数，默认与圆角宽度相等。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 499: 画多边形
    /*0823*/ {"多边形顶点", "本参数数组顺序记录多边形各顶点的横向及纵向坐标值。使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, AS_RECEIVE_ALL_TYPE_DATA},
    /*0824*/ {"顶点数目", "本参数指定多边形顶点的总数目。如果被省略，默认为数组中所记录的顶点数目。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY | AS_RECEIVE_ALL_TYPE_DATA},
    // 命令 500: 置写出位置
    /*0825*/ {"横向写出位置", "如果本参数被省略，则使用现行横向写出位置。使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0826*/ {"纵向写出位置", "如果本参数被省略，则使用现行纵向写出位置。使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 501: 写文本行
    /*0827*/ {"欲写出数据", "参数值只能为文本、数值、逻辑值或日期时间。如果本参数被省略，则写出一个空行。", 0, 0, _SDT_ALL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 502: 写出
    /*0828*/ {"欲写出数据", "参数值只能为文本、数值、逻辑值或日期时间。如果本参数被省略，则写出一个空行。", 0, 0, _SDT_ALL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 503: 定位写出
    /*0829*/ {"横向写出位置", "如果本参数被省略，则使用现行横向写出位置。使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0830*/ {"纵向写出位置", "如果本参数被省略，则使用现行纵向写出位置。使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0831*/ {"欲写出数据", "参数值只能为文本、数值、逻辑值或日期时间。", 0, 0, _SDT_ALL, 0, NULL},
    // 命令 504: 取宽度
    /*0832*/ {"欲取其宽度或高度的数据", "参数值只能为文本、数值、逻辑值或日期时间。", 0, 0, _SDT_ALL, 0, NULL},
    // 命令 505: 取高度
    /*0833*/ {"欲取其宽度或高度的数据", "参数值只能为文本、数值、逻辑值或日期时间。", 0, 0, _SDT_ALL, 0, NULL},
    // 命令 506: 画图片
    /*0834*/ {"图片号", "参数值必须为调用“载入图片”命令所返回的图片号。", 0, 0, SDT_INT, 0, NULL},
    /*0835*/ {"图片左边画出位置", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0836*/ {"图片顶边画出位置", "使用当前绘画单位，相对于画板或打印纸左上角。", 0, 0, SDT_INT, 0, NULL},
    /*0837*/ {"图片画出宽度", "如果本参数被省略，则使用图片本身的宽度。使用当前绘画单位。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0838*/ {"图片画出高度", "如果本参数被省略，则使用图片本身的高度。使用当前绘画单位。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0839*/ {"图片画出方法", "本参数定义在将图像绘制到对象（画板 / 打印机）上时对图像执行的位操作。对“图标”类型图片无效。可以为以下常量值之一或者", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0840*/ {"是否支持透明图片", "指定当使用打印机打印具有透明色的png图片时,是否支持图片像素混合.某些打印机不支持图像混合特性,此时打印具有透明色的p", 0, 0, SDT_BOOL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 507: 取图片宽度
    /*0841*/ {"图片号", "参数值必须为调用“载入图片”命令所返回的图片号。", 0, 0, SDT_INT, 0, NULL},
    // 命令 508: 取图片高度
    /*0842*/ {"图片号", "参数值必须为调用“载入图片”命令所返回的图片号。", 0, 0, SDT_INT, 0, NULL},
    // 命令 509: 置自定义纸张类型
    /*0843*/ {"自定义纸张类型名称", "", 0, 0, SDT_TEXT, 0, NULL},
    /*0844*/ {"纸张宽度", "单位为 0.1 毫米。", 0, 0, SDT_INT, 0, NULL},
    /*0845*/ {"纸张高度", "单位为 0.1 毫米。", 0, 0, SDT_INT, 0, NULL},
    /*0846*/ {"上边距", "单位为 0.1 毫米。如果本参数被省略，默认为0。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0847*/ {"下边距", "单位为 0.1 毫米。如果本参数被省略，默认为0。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0848*/ {"左边距", "单位为 0.1 毫米。如果本参数被省略，默认为0。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0849*/ {"右边距", "单位为 0.1 毫米。如果本参数被省略，默认为0。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 510: 删除自定义纸张类型
    /*0850*/ {"自定义纸张类型名称", "", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 511: 取自定义纸张大小
    /*0851*/ {"自定义纸张类型名称", "", 0, 0, SDT_TEXT, 0, NULL},
    /*0852*/ {"纸张宽度", "单位为 0.1 毫米。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY | AS_RECEIVE_VAR},
    /*0853*/ {"纸张高度", "单位为 0.1 毫米。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY | AS_RECEIVE_VAR},
    /*0854*/ {"上边距", "单位为 0.1 毫米。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY | AS_RECEIVE_VAR},
    /*0855*/ {"下边距", "单位为 0.1 毫米。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY | AS_RECEIVE_VAR},
    /*0856*/ {"左边距", "单位为 0.1 毫米。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY | AS_RECEIVE_VAR},
    /*0857*/ {"右边距", "单位为 0.1 毫米。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY | AS_RECEIVE_VAR},
    // 命令 513: 单位转换
    /*0858*/ {"欲转换的座标值", "提供欲转换的横向或纵向座标值。", 0, 0, SDT_INT, 0, NULL},
    /*0859*/ {"欲转换座标值的类型", "可以为以下常量值之一： 1：#横向绘画单位； 2：#纵向绘画单位； 3：#横向像素单位； 4：#纵向像素单位。 根据所提", 0, 0, SDT_INT, 0, NULL},
    // 命令 515: 发送数据
    /*0860*/ {"接收主机地址", "可以为主机名、IP地址等。如果省略本参数或者提供空文本，则在指定端口广播欲发送数据。", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0861*/ {"接收主机端口号", "", 0, 0, SDT_INT, 0, NULL},
    /*0862*/ {"欲发送数据", "欲发送数据必须是系统基本数据类型。", 0, 0, _SDT_ALL, 0, NULL},
    // 命令 517: 连接
    /*0863*/ {"服务器地址", "可以为主机名、IP地址等。", 0, 0, SDT_TEXT, 0, NULL},
    /*0864*/ {"服务器端口号", "该端口必须已经被服务器组件监听。", 0, 0, SDT_INT, 0, NULL},
    // 命令 519: 发送数据
    /*0865*/ {"欲发送数据", "欲发送数据必须是系统基本数据类型。", 0, 0, _SDT_ALL, 0, NULL},
    // 命令 523: 发送数据
    /*0866*/ {"接收客户", "为调用“取回客户”方法所返回的客户地址文本。", 0, 0, SDT_TEXT, 0, NULL},
    /*0867*/ {"欲发送数据", "欲发送数据必须是系统基本数据类型。", 0, 0, _SDT_ALL, 0, NULL},
    /*0868*/ {"最长等待时间", "指定等待发送成功的最长时间，单位为秒。如果省略本参数，默认为无限等待。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 524: 断开客户
    /*0869*/ {"欲断开客户", "为调用“取回客户”方法所返回的客户地址文本。", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 527: 发送数据
    /*0870*/ {"欲发送数据", "欲发送数据必须是系统基本数据类型。", 0, 0, _SDT_ALL, 0, NULL},
    // 命令 528: 信号操作
    /*0871*/ {"操作类型", "本参数可以为以下常量值之一： 1: #清除信号； 2: #发送或置位。", 0, 0, SDT_INT, 0, NULL},
    /*0872*/ {"欲操作信号类型", "本参数可以为以下常量值之一： 1: #DTR信号； 2: #RTS信号； 3: #Break信号。", 0, 0, SDT_INT, 0, NULL},
    // 命令 529: 置光标
    /*0873*/ {"行号", "行号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*0874*/ {"列号", "列号从1开始。", 0, 0, SDT_INT, 0, NULL},
    // 命令 530: 选择
    /*0875*/ {"行号", "行号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*0876*/ {"列号", "列号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*0877*/ {"行数", "如果本参数被省略，默认值为1。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0878*/ {"列数", "如果本参数被省略，默认值为1。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 538: 复制
    /*0879*/ {"行号", "行号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*0880*/ {"列号", "列号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*0881*/ {"行数", "如果本参数被省略，默认值为1。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0882*/ {"列数", "如果本参数被省略，默认值为1。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 540: 粘贴
    /*0883*/ {"行号", "行号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*0884*/ {"列号", "列号从1开始。", 0, 0, SDT_INT, 0, NULL},
    // 命令 541: 打印
    /*0885*/ {"是否显示进度框", "指定在打印的同时是否显示打印进度框，操作者可以在进度框内中止打印。如果本参数被省略，默认值为真。", 0, 0, SDT_BOOL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0886*/ {"打印作业标题", "本参数指定打印时显示在打印机状态窗口中的文档名称。如果参数被省略，默认值为“报表”。", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 545: 跳过
    /*0887*/ {"欲跳过的记录数", "参数值如果为负数，则向前移动，否则向后移动。如果本参数被省略，默认值为 1 ，即向后移动一条记录。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 546: 跳到
    /*0888*/ {"欲跳到的记录号", "参数值所指定的记录号从 1 开始，即首记录的记录号为 1 ，依此类推。", 0, 0, SDT_INT, 0, NULL},
    // 命令 549: 置表头行数
    /*0889*/ {"表头行数", "参数值如果为-1，则自动调整由于单元格组合而产生的行格式错误。如果本参数被省略，默认值为-1。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 551: 置表头列数
    /*0890*/ {"表头列数", "参数值如果为-1，则自动调整由于单元格组合而产生的列格式错误。如果本参数被省略，默认值为-1。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 552: 取行高
    /*0891*/ {"行号", "行号从1开始。", 0, 0, SDT_INT, 0, NULL},
    // 命令 553: 置行高
    /*0892*/ {"行号", "行号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*0893*/ {"行数", "如果本参数被省略，默认值为1。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0894*/ {"高度", "单位0.1毫米。", 0, 0, SDT_INT, 0, NULL},
    // 命令 554: 取列宽
    /*0895*/ {"列号", "列号从1开始。", 0, 0, SDT_INT, 0, NULL},
    // 命令 555: 置列宽
    /*0896*/ {"列号", "列号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*0897*/ {"列数", "如果本参数被省略，默认值为1。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0898*/ {"宽度", "单位0.1毫米。", 0, 0, SDT_INT, 0, NULL},
    // 命令 556: 取类型
    /*0899*/ {"行号", "行号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*0900*/ {"列号", "列号从1开始。", 0, 0, SDT_INT, 0, NULL},
    // 命令 557: 置类型
    /*0901*/ {"行号", "行号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*0902*/ {"列号", "列号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*0903*/ {"行数", "如果本参数被省略，默认值为1。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0904*/ {"列数", "如果本参数被省略，默认值为1。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0905*/ {"类型", "可以为以下常量值之一： 1、#文本； 2、#图片文件名； 3、#图片数据； 4、#字节集数据。如果本参数被省略，默认值为", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 558: 取文本色
    /*0906*/ {"行号", "行号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*0907*/ {"列号", "列号从1开始。", 0, 0, SDT_INT, 0, NULL},
    // 命令 559: 置文本色
    /*0908*/ {"行号", "行号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*0909*/ {"列号", "列号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*0910*/ {"行数", "如果本参数被省略，默认值为1。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0911*/ {"列数", "如果本参数被省略，默认值为1。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0912*/ {"文本颜色", "如果本参数被省略，默认值为黑色。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 560: 取背景色
    /*0913*/ {"行号", "行号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*0914*/ {"列号", "列号从1开始。", 0, 0, SDT_INT, 0, NULL},
    // 命令 561: 置背景色
    /*0915*/ {"行号", "行号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*0916*/ {"列号", "列号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*0917*/ {"行数", "如果本参数被省略，默认值为1。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0918*/ {"列数", "如果本参数被省略，默认值为1。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0919*/ {"背景颜色", "如果本参数被省略，默认值为透明色。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 562: 取字体名
    /*0920*/ {"行号", "行号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*0921*/ {"列号", "列号从1开始。", 0, 0, SDT_INT, 0, NULL},
    // 命令 563: 置字体名
    /*0922*/ {"行号", "行号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*0923*/ {"列号", "列号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*0924*/ {"行数", "如果本参数被省略，默认值为1。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0925*/ {"列数", "如果本参数被省略，默认值为1。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0926*/ {"字体名称", "如果本参数被省略，默认值为“宋体”。", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 564: 取字体尺寸
    /*0927*/ {"行号", "行号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*0928*/ {"列号", "列号从1开始。", 0, 0, SDT_INT, 0, NULL},
    // 命令 565: 置字体尺寸
    /*0929*/ {"行号", "行号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*0930*/ {"列号", "列号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*0931*/ {"行数", "如果本参数被省略，默认值为1。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0932*/ {"列数", "如果本参数被省略，默认值为1。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0933*/ {"字体尺寸", "如果本参数被省略，默认值为40。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 566: 取字体属性
    /*0934*/ {"行号", "行号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*0935*/ {"列号", "列号从1开始。", 0, 0, SDT_INT, 0, NULL},
    // 命令 567: 置字体属性
    /*0936*/ {"行号", "行号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*0937*/ {"列号", "列号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*0938*/ {"行数", "如果本参数被省略，默认值为1。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0939*/ {"列数", "如果本参数被省略，默认值为1。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0940*/ {"字体属性", "可以为以下常量值之一或之和： 1、#粗体； 2、#斜体； 4、#下划线； 8、#删除线。如果本参数被省略，默认值为0。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 568: 取边距
    /*0941*/ {"行号", "行号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*0942*/ {"列号", "列号从1开始。", 0, 0, SDT_INT, 0, NULL},
    // 命令 569: 置边距
    /*0943*/ {"行号", "行号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*0944*/ {"列号", "列号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*0945*/ {"行数", "如果本参数被省略，默认值为1。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0946*/ {"列数", "如果本参数被省略，默认值为1。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0947*/ {"边距", "如果本参数被省略，默认值为9。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 570: 取文本输入格式
    /*0948*/ {"行号", "行号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*0949*/ {"列号", "列号从1开始。", 0, 0, SDT_INT, 0, NULL},
    // 命令 571: 置文本输入格式
    /*0950*/ {"行号", "行号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*0951*/ {"列号", "列号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*0952*/ {"行数", "如果本参数被省略，默认值为1。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0953*/ {"列数", "如果本参数被省略，默认值为1。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0954*/ {"输入格式", "可以为以下常量值之一： 0、#通常型； 1、#字节型； 2、#短整数型； 3、#整数型； 4、#长整数型； 5、#小数型", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 572: 取对齐方式
    /*0955*/ {"行号", "行号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*0956*/ {"列号", "列号从1开始。", 0, 0, SDT_INT, 0, NULL},
    // 命令 573: 置对齐方式
    /*0957*/ {"行号", "行号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*0958*/ {"列号", "列号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*0959*/ {"行数", "如果本参数被省略，默认值为1。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0960*/ {"列数", "如果本参数被省略，默认值为1。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0961*/ {"对齐方式", "可以为以下常量值之一：1、#上左； 2、#上中； 3、#上右； 4、#中左； 5、#中中； 6、#中右； 7、#下左； ", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 574: 取密码方式
    /*0962*/ {"行号", "行号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*0963*/ {"列号", "列号从1开始。", 0, 0, SDT_INT, 0, NULL},
    // 命令 575: 置密码方式
    /*0964*/ {"行号", "行号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*0965*/ {"列号", "列号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*0966*/ {"行数", "如果本参数被省略，默认值为1。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0967*/ {"列数", "如果本参数被省略，默认值为1。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0968*/ {"设置值", "", 0, 0, SDT_BOOL, 0, NULL},
    // 命令 576: 取文本
    /*0969*/ {"行号", "行号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*0970*/ {"列号", "列号从1开始。", 0, 0, SDT_INT, 0, NULL},
    // 命令 577: 置文本
    /*0971*/ {"行号", "行号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*0972*/ {"列号", "列号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*0973*/ {"文本或图片文件名", "", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 578: 取数据
    /*0974*/ {"行号", "行号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*0975*/ {"列号", "列号从1开始。", 0, 0, SDT_INT, 0, NULL},
    // 命令 579: 置数据
    /*0976*/ {"行号", "行号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*0977*/ {"列号", "列号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*0978*/ {"数据", "", 0, 0, SDT_BIN, 0, NULL},
    // 命令 580: 合并
    /*0979*/ {"行号", "行号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*0980*/ {"列号", "列号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*0981*/ {"行数", "如果本参数被省略，默认值为1。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0982*/ {"列数", "如果本参数被省略，默认值为1。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 581: 分解
    /*0983*/ {"行号", "行号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*0984*/ {"列号", "列号从1开始。", 0, 0, SDT_INT, 0, NULL},
    // 命令 582: 是否被合并
    /*0985*/ {"行号", "行号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*0986*/ {"列号", "列号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*0987*/ {"周边单元格", "可以为以下常量值之一： 1、#左单元格； 2、#上单元格； 3、#右单元格； 4、#下单元格。", 0, 0, SDT_INT, 0, NULL},
    // 命令 583: 加线条
    /*0988*/ {"行号", "行号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*0989*/ {"列号", "列号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*0990*/ {"行数", "如果本参数被省略，默认值为1。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0991*/ {"列数", "如果本参数被省略，默认值为1。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0992*/ {"线条类型", "可以为以下常量值之一或之和：1、#左边框； 2、#上边框； 4、#右边框； 8、#下边框； 16、#水平线； 32、#垂", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 584: 删线条
    /*0993*/ {"行号", "行号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*0994*/ {"列号", "列号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*0995*/ {"行数", "如果本参数被省略，默认值为1。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0996*/ {"列数", "如果本参数被省略，默认值为1。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*0997*/ {"线条类型", "可以为以下常量值之一或之和：1、#左边框； 2、#上边框； 4、#右边框； 8、#下边框； 16、#水平线； 32、#垂", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 585: 是否有线条
    /*0998*/ {"行号", "行号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*0999*/ {"列号", "列号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*1000*/ {"线条类型", "可以为以下常量值之一或之和：1、#左边框； 2、#上边框； 4、#右边框； 8、#下边框； 64、#单斜线； 128、#", 0, 0, SDT_INT, 0, NULL},
    // 命令 586: 清除
    /*1001*/ {"行号", "行号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*1002*/ {"列号", "列号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*1003*/ {"行数", "如果本参数被省略，默认值为1。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*1004*/ {"列数", "如果本参数被省略，默认值为1。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 587: 置初始属性
    /*1005*/ {"类型", "可以为以下常量值之一： 1、#文本； 2、#图片文件名； 3、#图片数据； 4、#字节集数据。如果本参数被省略，默认值为", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*1006*/ {"文本颜色", "如果本参数被省略，默认值为黑色。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*1007*/ {"背景颜色", "如果本参数被省略，默认值为透明色。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*1008*/ {"字体名称", "如果本参数被省略，默认值为“宋体”。", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*1009*/ {"字体尺寸", "如果本参数被省略，默认值为40。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*1010*/ {"字体属性", "可以为以下常量值之一或之和： 1、#粗体； 2、#斜体； 4、#下划线； 8、#删除线。如果本参数被省略，默认值为0。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*1011*/ {"边距", "如果本参数被省略，默认值为9。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*1012*/ {"对齐方式", "可以为以下常量值之一：1、#上左； 2、#上中； 3、#上右； 4、#中左； 5、#中中； 6、#中右； 7、#下左； ", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*1013*/ {"输入格式", "可以为以下常量值之一： 0、#通常型； 1、#字节型； 2、#短整数型； 3、#整数型； 4、#长整数型； 5、#小数型", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*1014*/ {"添加边框线", "指定是否在单元格周围添加边框线。如果本参数被省略，默认值为假。", 0, 0, SDT_BOOL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 588: 初始尺寸
    /*1015*/ {"行数", "如果本参数被省略，默认值为1。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*1016*/ {"列数", "如果本参数被省略，默认值为1。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 591: 插入行
    /*1017*/ {"行号", "行号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*1018*/ {"行数", "如果本参数被省略，默认值为1。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 592: 添加行
    /*1019*/ {"行数", "如果本参数被省略，默认值为1。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 593: 删除行
    /*1020*/ {"行号", "行号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*1021*/ {"行数", "如果本参数被省略，默认值为1。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 594: 插入列
    /*1022*/ {"列号", "列号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*1023*/ {"列数", "如果本参数被省略，默认值为1。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 595: 删除列
    /*1024*/ {"列号", "列号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*1025*/ {"列数", "如果本参数被省略，默认值为1。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 596: 添加
    /*1026*/ {"数据源或数据提供者", "本参数指定欲添加其数据到数据源中的其它数据源或数据提供者。", 0, 0, _SDT_ALL, 0, NULL},
    /*1027*/ {"首行行号", "指定欲添加数据首行的行号。如果本参数被省略，默认值为1。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*1028*/ {"欲添加行数", "指定欲添加数据行的行数。如果参数值为-1，则添加首行后的所有数据行。如果本参数被省略，默认值为-1。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 598: 从字节集读
    /*1029*/ {"数据源数据", "", 0, 0, SDT_BIN, 0, NULL},
    // 命令 599: 存到文件
    /*1030*/ {"数据源数据文件名", "", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 600: 从文件读
    /*1031*/ {"数据源数据文件名", "", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 601: 单元格到字节集
    /*1032*/ {"行号", "行号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*1033*/ {"列号", "列号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*1034*/ {"行数", "如果本参数被省略，默认值为1。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*1035*/ {"列数", "如果本参数被省略，默认值为1。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 602: 字节集到单元格
    /*1036*/ {"行号", "行号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*1037*/ {"列号", "列号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*1038*/ {"单元格数据", "", 0, 0, SDT_BIN, 0, NULL},
    /*1039*/ {"自动扩展", "本参数指定如果数据源内的数据行列数无法容纳即将读入的数据，是否自动扩展。如果本参数被省略，默认值为真。", 0, 0, SDT_BOOL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 603: 单元格到文件
    /*1040*/ {"行号", "行号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*1041*/ {"列号", "列号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*1042*/ {"行数", "如果本参数被省略，默认值为1。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*1043*/ {"列数", "如果本参数被省略，默认值为1。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*1044*/ {"数据源数据文件名", "", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 604: 文件到单元格
    /*1045*/ {"行号", "行号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*1046*/ {"列号", "列号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*1047*/ {"单元格数据文件名", "", 0, 0, SDT_TEXT, 0, NULL},
    /*1048*/ {"自动扩展", "本参数指定如果数据源内的数据行列数无法容纳即将读入的数据，是否自动扩展。如果本参数被省略，默认值为真。", 0, 0, SDT_BOOL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 609: 置打印设置
    /*1049*/ {"打印设置信息", "", 0, 0, _SDT_ALL, 0, NULL},
    // 命令 612: 取只读方式
    /*1050*/ {"行号", "行号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*1051*/ {"列号", "列号从1开始。", 0, 0, SDT_INT, 0, NULL},
    // 命令 613: 置只读方式
    /*1052*/ {"行号", "行号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*1053*/ {"列号", "列号从1开始。", 0, 0, SDT_INT, 0, NULL},
    /*1054*/ {"行数", "如果本参数被省略，默认值为1。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*1055*/ {"列数", "如果本参数被省略，默认值为1。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*1056*/ {"设置值", "", 0, 0, SDT_BOOL, 0, NULL},
    // 命令 614: 打开
    /*1057*/ {"ODBC数据源连接文本", "指定指向ODBC数据源的连接文本，如果为空，则激活ODBC数据源选择对话框。如果参数被省略，默认值为空。", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*1058*/ {"是否只读", "指定是否以只读方式打开。如果参数被省略，默认值为假。", 0, 0, SDT_BOOL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*1059*/ {"不显示ODBC连接对话框", "指定当数据源连接失败的时候，是否自动显示ODBC的数据源连接对话框。如果参数被省略，默认值为假。", 0, 0, SDT_BOOL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 620: 查询
    /*1060*/ {"查询类SQL语句", "本参数提供用作查询的SELECT语句。", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 621: 重新查询
    /*1061*/ {"记录集句柄", "指定欲操作记录集的句柄。记录集句柄由“查询”命令返回。", 0, 0, SDT_INT, 0, NULL},
    // 命令 622: 关闭记录集
    /*1062*/ {"记录集句柄", "指定欲关闭记录集的句柄，记录集句柄由“查询”命令返回。如果参数值为0，则关闭所有记录集。如果参数被省略，默认值为0。", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 623: 首记录前
    /*1063*/ {"记录集句柄", "指定欲操作记录集的句柄。记录集句柄由“查询”命令返回。", 0, 0, SDT_INT, 0, NULL},
    // 命令 624: 尾记录后
    /*1064*/ {"记录集句柄", "指定欲操作记录集的句柄。记录集句柄由“查询”命令返回。", 0, 0, SDT_INT, 0, NULL},
    // 命令 625: 到首记录
    /*1065*/ {"记录集句柄", "指定欲操作记录集的句柄。记录集句柄由“查询”命令返回。", 0, 0, SDT_INT, 0, NULL},
    // 命令 626: 到尾记录
    /*1066*/ {"记录集句柄", "指定欲操作记录集的句柄。记录集句柄由“查询”命令返回。", 0, 0, SDT_INT, 0, NULL},
    // 命令 627: 到前一记录
    /*1067*/ {"记录集句柄", "指定欲操作记录集的句柄。记录集句柄由“查询”命令返回。", 0, 0, SDT_INT, 0, NULL},
    // 命令 628: 到后一记录
    /*1068*/ {"记录集句柄", "指定欲操作记录集的句柄。记录集句柄由“查询”命令返回。", 0, 0, SDT_INT, 0, NULL},
    // 命令 629: 读
    /*1069*/ {"记录集句柄", "指定欲操作记录集的句柄。记录集句柄由“查询”命令返回。", 0, 0, SDT_INT, 0, NULL},
    /*1070*/ {"字段名称或位置", "参数值可以为一个字段名称文本或者一个字段位置数值，字段位置数值从 1 开始。", 0, 0, _SDT_ALL, 0, NULL},
    // 命令 630: 执行
    /*1071*/ {"非查询类SQL语句", "本参数提供非查询类SQL语句（无结果集返回），如修改、删除、添加等等。", 0, 0, SDT_TEXT, 0, NULL},
    /*1072*/ {"文本或字节集", "本参数仅用作为SQL语句中的备注或字节集型SQL参数（用问号标识其位置）提供相应数据，必须为文本或者字节集型（与SQL参", 0, 0, _SDT_ALL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 631: 打开MDB数据库
    /*1073*/ {"MDB数据库文件名", "本参数提供即将打开数据库的文件名。", 0, 0, SDT_TEXT, 0, NULL},
    /*1074*/ {"用户名", "本参数提供打开数据库所需要的用户名，如果省略本参数，默认为不需要。", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*1075*/ {"密码", "本参数提供打开数据库所需要的密码，如果省略本参数，默认为不需要。", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*1076*/ {"是否只读", "指定是否以只读方式打开。如果参数被省略，默认值为假。", 0, 0, SDT_BOOL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*1077*/ {"不显示ODBC连接对话框", "指定当数据源连接失败的时候，是否自动显示ODBC的数据源连接对话框。如果参数被省略，默认值为假。", 0, 0, SDT_BOOL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 632: 打开SQL数据库
    /*1078*/ {"服务器名称", "本参数提供 SQL SERVER 服务器的名称或其客户端别名。", 0, 0, SDT_TEXT, 0, NULL},
    /*1079*/ {"用户名", "本参数提供登录服务器所需要的用户名，如果省略本参数，默认为不需要。", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*1080*/ {"密码", "本参数提供登录服务器所需要的密码，如果省略本参数，默认为不需要。", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*1081*/ {"数据库名称", "本参数提供即将打开数据库的名称。如果省略本参数，则使用该用户的默认数据库。", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*1082*/ {"是否只读", "指定是否以只读方式打开。如果参数被省略，默认值为假。", 0, 0, SDT_BOOL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    /*1083*/ {"不显示ODBC连接对话框", "指定当数据源连接失败的时候，是否自动显示ODBC的数据源连接对话框。如果参数被省略，默认值为假。", 0, 0, SDT_BOOL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 633: 创建
    /*1084*/ {"对象类型", "本参数指定对象的类型文本，譬如“Word.Application”、“Excel.Application”、“{0002", 0, 0, SDT_TEXT, 0, NULL},
    /*1085*/ {"类型库文件名", "如果需要通过类型库才能访问指定对象，可在本参数中提供其类型库或类型库数据所在文件名。注意如果没有提供文件路径，且在当前目", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 634: 获取
    /*1086*/ {"对象类型", "本参数指定对象的类型文本，譬如“Word.Application”、“Excel.Application”、“{0002", 0, 0, SDT_TEXT, 0, NULL},
    // 命令 637: 是否相等
    /*1087*/ {"欲检查的对象", "本参数指定欲检查其内容是否相等的对象。", 0, 0, _SDT_ALL, 0, NULL},
    // 命令 638: 读文本属性
    /*1088*/ {"属性名称", "", 0, 0, SDT_TEXT, 0, NULL},
    /*1089*/ {"参数数据", "本参数及本参数后的所有扩展参数提供读写属性所需要的所有数据。如果读写该属性不需要任何参数，请保持本参数为空。", 0, 0, _SDT_ALL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 639: 读数值属性
    /*1090*/ {"属性名称", "", 0, 0, SDT_TEXT, 0, NULL},
    /*1091*/ {"参数数据", "本参数及本参数后的所有扩展参数提供读写属性所需要的所有数据。如果读写该属性不需要任何参数，请保持本参数为空。", 0, 0, _SDT_ALL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 640: 读逻辑属性
    /*1092*/ {"属性名称", "", 0, 0, SDT_TEXT, 0, NULL},
    /*1093*/ {"参数数据", "本参数及本参数后的所有扩展参数提供读写属性所需要的所有数据。如果读写该属性不需要任何参数，请保持本参数为空。", 0, 0, _SDT_ALL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 641: 读日期属性
    /*1094*/ {"属性名称", "", 0, 0, SDT_TEXT, 0, NULL},
    /*1095*/ {"参数数据", "本参数及本参数后的所有扩展参数提供读写属性所需要的所有数据。如果读写该属性不需要任何参数，请保持本参数为空。", 0, 0, _SDT_ALL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 642: 读对象型属性
    /*1096*/ {"属性名称", "", 0, 0, SDT_TEXT, 0, NULL},
    /*1097*/ {"参数数据", "本参数及本参数后的所有扩展参数提供读写属性所需要的所有数据。如果读写该属性不需要任何参数，请保持本参数为空。", 0, 0, _SDT_ALL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 643: 读属性
    /*1098*/ {"属性名称", "", 0, 0, SDT_TEXT, 0, NULL},
    /*1099*/ {"参数数据", "本参数及本参数后的所有扩展参数提供读写属性所需要的所有数据。如果读写该属性不需要任何参数，请保持本参数为空。", 0, 0, _SDT_ALL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 644: 写属性
    /*1100*/ {"属性名称", "", 0, 0, SDT_TEXT, 0, NULL},
    /*1101*/ {"参数数据", "本参数及本参数后的所有扩展参数提供读写属性所需要的所有数据。如果读写该属性不需要任何参数，请保持本参数为空。", 0, 0, _SDT_ALL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 645: 方法
    /*1102*/ {"方法名称", "本参数提供欲调用方法的名称。", 0, 0, SDT_TEXT, 0, NULL},
    /*1103*/ {"参数数据", "本参数及本参数后的所有扩展参数提供调用方法所需要的所有数据。如果该方法不需要任何参数，请保持本参数为空。", 0, 0, _SDT_ALL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 646: 通用方法
    /*1104*/ {"方法名称", "本参数提供欲调用方法的名称。", 0, 0, SDT_TEXT, 0, NULL},
    /*1105*/ {"参数数据", "本参数及本参数后的所有扩展参数提供调用方法所需要的所有数据。如果该方法不需要任何参数，请保持本参数为空。", 0, 0, _SDT_ALL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 647: 文本方法
    /*1106*/ {"方法名称", "本参数提供欲调用方法的名称。", 0, 0, SDT_TEXT, 0, NULL},
    /*1107*/ {"参数数据", "本参数及本参数后的所有扩展参数提供调用方法所需要的所有数据。如果该方法不需要任何参数，请保持本参数为空。", 0, 0, _SDT_ALL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 648: 数值方法
    /*1108*/ {"方法名称", "本参数提供欲调用方法的名称。", 0, 0, SDT_TEXT, 0, NULL},
    /*1109*/ {"参数数据", "本参数及本参数后的所有扩展参数提供调用方法所需要的所有数据。如果该方法不需要任何参数，请保持本参数为空。", 0, 0, _SDT_ALL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 649: 逻辑方法
    /*1110*/ {"方法名称", "本参数提供欲调用方法的名称。", 0, 0, SDT_TEXT, 0, NULL},
    /*1111*/ {"参数数据", "本参数及本参数后的所有扩展参数提供调用方法所需要的所有数据。如果该方法不需要任何参数，请保持本参数为空。", 0, 0, _SDT_ALL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 650: 日期方法
    /*1112*/ {"方法名称", "本参数提供欲调用方法的名称。", 0, 0, SDT_TEXT, 0, NULL},
    /*1113*/ {"参数数据", "本参数及本参数后的所有扩展参数提供调用方法所需要的所有数据。如果该方法不需要任何参数，请保持本参数为空。", 0, 0, _SDT_ALL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 651: 对象型方法
    /*1114*/ {"方法名称", "本参数提供欲调用方法的名称。", 0, 0, SDT_TEXT, 0, NULL},
    /*1115*/ {"参数数据", "本参数及本参数后的所有扩展参数提供调用方法所需要的所有数据。如果该方法不需要任何参数，请保持本参数为空。", 0, 0, _SDT_ALL, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 652: 创建图片对象
    /*1116*/ {"图片数据", "本参数提供欲用作创建图片对象的图片数据。", 0, 0, SDT_BIN, 0, NULL},
    // 命令 653: 创建字体对象
    /*1117*/ {"字体数据", "本参数提供欲用作创建字体对象的字体数据。", 0, 0, _SDT_ALL, 0, NULL},
    // 命令 658: 取接口
    /*1118*/ {"对象或窗口组件", "本参数提供欲获取其接口对象的对象数据，其数据类型为以下之一：1、COM包装库封装出来的对象型数据类型； 2、核心支持库中", 0, 0, _SDT_ALL, 0, NULL},
    /*1119*/ {"接口标志符", "可以在本参数中指定欲获取接口的具体名称或其全球唯一标志符(GUID)，如“IDataSourceControl”、{B6", 0, 0, SDT_TEXT, 0, AS_DEFAULT_VALUE_IS_EMPTY},
    // 命令 662: 取文本
    /*1120*/ {"成员索引", "如果当前对象内为数组型数据，且欲对数组内的某个成员进行操作，则可以在此参数中指定其引用索引值，该索引值从 1 开始。除开", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY | AS_RECEIVE_ALL_TYPE_DATA},
    // 命令 663: 取数值
    /*1121*/ {"成员索引", "如果当前对象内为数组型数据，且欲对数组内的某个成员进行操作，则可以在此参数中指定其引用索引值，该索引值从 1 开始。除开", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY | AS_RECEIVE_ALL_TYPE_DATA},
    // 命令 664: 取逻辑值
    /*1122*/ {"成员索引", "如果当前对象内为数组型数据，且欲对数组内的某个成员进行操作，则可以在此参数中指定其引用索引值，该索引值从 1 开始。除开", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY | AS_RECEIVE_ALL_TYPE_DATA},
    // 命令 665: 取日期
    /*1123*/ {"成员索引", "如果当前对象内为数组型数据，且欲对数组内的某个成员进行操作，则可以在此参数中指定其引用索引值，该索引值从 1 开始。除开", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY | AS_RECEIVE_ALL_TYPE_DATA},
    // 命令 666: 取对象
    /*1124*/ {"成员索引", "如果当前对象内为数组型数据，且欲对数组内的某个成员进行操作，则可以在此参数中指定其引用索引值，该索引值从 1 开始。除开", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY | AS_RECEIVE_ALL_TYPE_DATA},
    // 命令 667: 取变体型
    /*1125*/ {"成员索引", "如果当前对象内为数组型数据，且欲对数组内的某个成员进行操作，则可以在此参数中指定其引用索引值，该索引值从 1 开始。除开", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY | AS_RECEIVE_ALL_TYPE_DATA},
    // 命令 668: 赋值
    /*1126*/ {"欲写入数据", "参数值可以为文本、数值、逻辑值、日期时间值、COM对象型数据类型或者这些数据类型及“变体型”数据类型本身的数组形式。如果", 0, 0, _SDT_ALL, 0, AS_DEFAULT_VALUE_IS_EMPTY | AS_RECEIVE_ALL_TYPE_DATA},
    /*1127*/ {"成员索引", "如果当前对象内为数组型数据，且欲对数组内的某个成员进行操作，则可以在此参数中指定其引用索引值，该索引值从 1 开始。除开", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY | AS_RECEIVE_ALL_TYPE_DATA},
    // 命令 669: 创建数组
    /*1128*/ {"成员类型", "指定所创建数组成员的数据类型，为以下数值之一： 1: 字节型； 2: 短整数型； 3: 整数型； 4: 小数型； 5: ", 0, 0, SDT_INT, 0, AS_RECEIVE_ALL_TYPE_DATA},
    /*1129*/ {"成员数目", "指定所创建数组成员的数目。", 0, 0, SDT_INT, 0, AS_RECEIVE_ALL_TYPE_DATA},
    // 命令 670: 置类型
    /*1130*/ {"欲设置的类型", "参数值提供欲设置的变体类型。", 0, 0, _SDT_ALL, 0, NULL},
    // 命令 671: 取字节集
    /*1131*/ {"成员索引", "如果当前对象内为数组型数据，且欲对数组内的某个成员进行操作，则可以在此参数中指定其引用索引值，该索引值从 1 开始。除开", 0, 0, SDT_INT, 0, AS_DEFAULT_VALUE_IS_EMPTY | AS_RECEIVE_ALL_TYPE_DATA},
};

#ifdef _DEBUG
const int dbg_cmd_arg_count__ = sizeof(g_argumentInfo_krnln_global_var) / sizeof(g_argumentInfo_krnln_global_var[0]);
#endif

#define KRNLN_DEF_CMDINFO(_index, _szName, _szEgName, _szFuncId, _szExplain, _shtCategory, _wState, _dtRetValType, _wReserved, _shtUserLevel, _shtBitmapIndex, _shtBitmapCount, _nArgCount, _pBeginArgInfo) \
    { _szName, _szEgName, _szExplain, _shtCategory, _wState, _dtRetValType, _wReserved, _shtUserLevel, _shtBitmapIndex, _shtBitmapCount, _nArgCount, _pBeginArgInfo },

// 命令信息数组
CMD_INFO g_cmdInfo_krnln_global_var[] = 
{
    KRNLN_DEF(KRNLN_DEF_CMDINFO)
};

int g_cmdInfo_krnln_global_var_count = sizeof(g_cmdInfo_krnln_global_var) / sizeof(g_cmdInfo_krnln_global_var[0]);

#endif
